["A bicycle is a form of transportation.", "Bicycle is a form of transportation.", "The bicycle is a form of transportation.", "Bicycles are a form of transportation.", "A bicycle, also called a bike or cycle, is a human-powered, pedal-driven, single-track vehicle, having two wheels attached to a frame, one behind the other.", "A bicycle is a vehicle that has two wheels and is powered by a person.", "A bicycle, also called a bike or cycle, is a human-powered or motor-powered, pedal-driven, single-track vehicle, having two wheels attached to a frame, one behind the other.", "Bicycle is a pedal-driven land vehicle with two wheels attached to a frame, one behind the other.", "A bicycle, also called a cycle or bike, is a human-powered, pedal-driven, single-track vehicle, having two wheels attached to a frame, one behind the other.", "A bicycle is a pedal-driven land vehicle with two wheels attached to a frame, one behind the other.", "A bicycle is a vehicle that has two wheels, one behind the other, a steering handle, and a saddle seat or seats and is usually propelled by the action of a rider's feet upon pedals.", "A bicycle is a vehicle.", "A bicycle, also called a cycle or bike, is a human-powered or motor-powered, pedal-driven, single-track vehicle, having two wheels attached to a frame, one behind the other.", "A bicycle is a pedal-driven land vehicle with two wheels attached to a frame one behind the other.", "The bicycle is a pedal-driven, human-powered, single-track vehicle, having two wheels attached to a frame, one behind the other.", "Bicycle", "Bicycles are vehicles propelled by the rider.", "Bicycle.", "transportation is the movement of humans, animals and goods from one location to another.", "Transport or transportation is the movement of people and goods from one location to another.", "Transportation is the movement of people, animals and goods from one location to another. Modes of transport include air, rail, road, water, cable, pipeline and space. The field can be divided into infrastructure, vehicles and operations.", "The cat is not a form of transportation."]