["The size of the beds are twin beds.", "The beds are twin beds.", "Twin beds are two single beds that are the same size.", "The bed is a twin bed.", "A twin bed is a bed designed for two people.", "The beds are twin size.", "A twin bed is a bed for one person.", "A twin bed is a single bed designed to accommodate two people.", "The beds in this photo are twin size.", "A twin bed is a single bed designed to accommodate one person.", "A twin bed is a type of bed in which two people can sleep.", "The beds in this photo are twin beds.", "The beds in this photo are twin beds. A twin bed is a type of bed in a room with two single beds, one on each side.", "The bed is a double bed.", "A double bed is a bed for sleeping two people.", "A double bed is a bed that is twice as long as a single bed.", "A double bed is a bed large enough for two people to sleep in comfortably.", "A twin bed is 38 inches wide and 75 inches long.", "The double bed is a standard bed size.", "A twin bed is 39 inches wide and 75 inches long.", "A twin bed is normally 39 inches wide and 75 inches long.", "Twin beds are normally meant for one person.", "A twin bed is normally 38 inches wide by 75 inches long.", "A twin bed is normally 44 inches wide and 79 inces long.", "The beds in this photo are twins.", "A double bed is a bed big enough for two people.", "A single bed is a bed big enough for one person.", "Full size bed.", "A bed is a piece of furniture which is used as a place to sleep or relax.", "A bed is a piece of furniture which is used as a place to sleep or relax. Most modern beds consist of a soft, cushioned mattress on a bed frame, the mattress resting either on a solid base, often wood slats, or a sprung base.", "The bed is a piece of furniture used as a place to sleep, relax, or engage in sexual relations.", "The size of a bed is usually determined by the size of the mattress, which is used to lie or sleep on.", "The size of a bed is determined by the size of the mattress.", "twin", "Twin", "King size beds are the largest beds commonly sold.", "The mattress is a large pad for supporting the reclining body, used as a bed or as part of a bed."]