["The chicken (Gallus gallus domesticus) is a type of domesticated fowl, a subspecies of the red junglefowl. It is one of the most common and widespread domestic animals, with a total population of more than 19 billion as of 2011.", "A chicken is a type of domesticated fowl, a subspecies of the red junglefowl. It is one of the most common and widespread domestic animals, with a total population of more than 19 billion as of 2011.", "A chicken is a type of domesticated fowl, a subspecies of the Red Junglefowl. It is one of the most common and widespread domestic animals, with a total population of more than 19 billion as of 2011.", "A chicken is a type of domesticated bird.", "a chicken is a domesticated fowl, a subspecies of the red junglefowl.", "A chicken is a type of bird.", "The chicken (Gallus gallus domesticus) is a type of domesticated fowl, a subspecies of the red junglefowl.", "The chicken is a type of domesticated fowl, a subspecies of the red junglefowl. It is one of the most common and widespread domestic animals, with a total population of more than 19 billion as of 2011.", "A chicken is a type of domesticated fowl, a subspecies of the red junglefowl.", "The chicken is a type of domesticated fowl, a subspecies of the red junglefowl. It is one of the most common and widespread domestic animals, with a total population of more than 19 billion as of 2011. There are more chickens in the world than any other bird or domesticated fowl.", "The chicken is a type of domesticated fowl, a subspecies of the red junglefowl.", "The domestic chicken (Gallus gallus domesticus) is a type of domesticated fowl, a subspecies of the red junglefowl. It is one of the most common and widespread domestic animals, with a total population of more than 19 billion as of 2011. There are more chickens in the world than any other bird or domesticated fowl.", "A chicken is a type of domesticated bird kept as a type of poultry. It is believed to be descended from the wild Indian and south-east Asian Red Junglefowl.", "A chicken is a bird.", "A chicken is a bird with feathers and wings.", "This bird looks like a chicken.", "A chicken is a type of domesticated bird. It is believed to be descended from the wild red junglefowl of Asia, and there are more chickens in the world than any other bird or domesticated fowl. Chickens are one of the most common and widespread domestic animals, with a total population of 23.7 billion as of 2018. There are more chickens in the world than any other bird or domesticated fowl. Humans keep chickens primarily as a source of food (consuming both their meat and eggs) and, less commonly, as pets.", "This is a chicken.", "It looks like a chicken.", "Poultry are domesticated birds kept by humans for the eggs they produce, their meat, or their feathers.", "The striped chicken is a breed of chicken originating in France.", "The Combattant chicken is a breed of chicken originating in France. It is also known as the Fighting chicken.", "Chicken.", "Gallus gallus domesticus is a subspecies of the red junglefowl (Gallus gallus), one of four species in the genus Gallus and one of the closest living relatives to the red junglefowl."]