["A birthday cake is a cake eaten as part of a birthday celebration.", "The birthday cake is a cake eaten as part of a birthday celebration.", "Birthday cake refers to a cake associated with birthday celebrations.", "A birthday cake is a cake eaten as part of a birthday celebration in many world traditions.", "The occasion is a birthday.", "A birthday is a day where a person celebrates the anniversary of their birth.", "A birthday is a day or anniversary where a person celebrates his or her date of birth.", "A birthday is the anniversary of the birth of a person, or figuratively of an institution.", "Birthday cake is a cake eaten as part of a birthday celebration in many world traditions.", "A birthday is an occasion when a person or institution celebrates the anniversary of their birth. Birthdays are celebrated in numerous cultures, often with a gift, party, or rite of passage.", "A birthday is the anniversary of the birth of a person or an institution. Birthdays are celebrated in numerous cultures, often with a gift, party, or rite of passage.", "A birthday is an anniversary of the birth of a person, or figuratively an institution. Birthdays of people are celebrated in numerous cultures, often with a gift, party, or rite of passage.", "Birthday cake is traditionally served as dessert on or near a person’s birthday.", "The occasion was a birthday party.", "A birthday is the anniversary of the birth of a person, or figuratively of an institution. Birthdays of people are celebrated in numerous cultures, often with birthday gifts, birthday cards, a birthday party, or a rite of passage.", "This is a birthday cake.", "Birthday cake", "Birthday is the day of birth of a person.", "The occasion is a birthday party.", "A birthday cake is a cake eaten as part of a birthday celebration in many world traditions. Variations of the typical birthday cake include birthday cupcakes, cake pops, pastries, and tarts.", "Birthdays are celebrated to mark the anniversary of one's birth.", "Birthday cake is a cake eaten as part of a birthday celebration in many world traditions. Variations of the typical birthday cake include birthday cupcakes, cake pops, pastries, and tarts.", "The occasion was a birthday.", "Birthdays are celebrated in numerous cultures, often with a gift, party, or rite of passage.", "Birthday cakes are often decorated with candles.", "The birthday.", "Birthday.", "The birthday cake is traditionally shaped as a rectangular layer cake with white frosting and colorful sprinkles.", "The candles on the doughnut indicate that it was made for a birthday.", "A cake is a type of sweet dessert that is typically baked. In its oldest forms, cakes were modifications of breads, but cakes now cover a wide range of preparations that can be simple or elaborate, and that share features with other desserts such as pastries, meringues, custards, and pies."]