["Pirates are people who commit robbery or criminal violence at sea.", "Pirates are people who commit crimes, such as robbery or kidnapping, at sea.", "Pirates are people who commit acts of robbery and criminal violence at sea.", "Pirates are people who commit crimes at sea.", "Pirates are people who attack and steal from ships at sea.", "Pirates are people who commit robbery at sea.", "Pirates are people who rob or attack ships at sea, usually while wearing a pirate hat.", "Pirates are sea robbers who attack and steal from ships.", "Pirates are people who steal.", "Pirates are a type of thief who attack ships at sea.", "A pirate is a person who commits robbery or criminal acts at sea without the authorization of any nation.", "Pirate is a term used to refer to a person who commits robbery at sea without a commission from a sovereign nation.", "Pirates are linked to the profession of sea robbery.", "Pirate hats are often linked to pirates, who are people who attack ships at sea.", "Pirates are linked to the profession of sailing.", "Pirate is the profession of piracy.", "A pirate is a person who commits warlike acts at sea without the authorization of any nation.", "The pirate hat is associated with pirates.", "Pirate is a person who commits robbery at sea without the sanction of any nation.", "Pirate is a person who commits warlike acts at sea without the authorization of any nation.", "The pirate hat is a hat that is sometimes worn by pirates.", "Pirates are often linked to the profession of the hat.", "Pirates", "Pirate hats are worn by pirates.", "Pirate hats are frequently linked to the profession of pirate.", "Piracy is an act of robbery or criminal violence by ship or boat-borne attackers upon another ship or a coastal area, typically with the goal of stealing cargo and other valuable items or properties. Those who engage in acts of piracy are called pirates.", "pirate", "Pirate", "Pirates.", "Piracy is an act of robbery or criminal violence by ship or boat-borne attackers upon another ship or a coastal area, typically with the goal of stealing cargo and other valuable items or properties.", "Pirates are often depicted as wearing a hat with a skull and crossbones on it."]