["A helmet is the most important piece of safety equipment when riding a motorcycle.", "A helmet is suggested safety equipment.", "The safety equipment used when driving this vehicle is helmet.", "A helmet is the most important piece of safety equipment.", "The safety equipment utilized when driving this vehicle is a helmet.", "When driving a motorcycle it is important to wear a helmet.", "A motorcycle helmet is a type of helmet used by motorcycle riders.", "The motorcycle helmet is a type of helmet used by motorcycle riders.", "A motorcycle helmet.", "A motorcycle helmet is a type of helmet used by motorcycle riders. The primary goal of a motorcycle helmet is motorcycle safety - to protect the rider's head during impact, thus preventing or reducing head injury and saving the rider's life.", "Motorcycle helmets are helmets designed to attenuate impacts to the skull of a motorcycle rider and passenger in an accident.", "A helmet is a type of protective gear worn to protect the head from injuries.", "The use of a motorcycle helmet is required by law in many countries.", "A helmet is a form of protective gear worn to protect the head from injuries.", "A helmet is a form of protective gear worn to protect the head.", "Helmet is a form of protective gear worn to protect the head from injuries.", "The suggested safety equipment is a helmet. A helmet is a form of protective gear worn to protect the head from injuries.", "Motorcyclists should wear a helmet.", "Motorcycle helmets greatly reduce injuries and fatalities in motorcycle accidents, thus many countries have laws requiring acceptable helmets to be worn by motorcycle riders.", "Motorcycle helmets significantly reduce injuries and fatalities in motorcycle accidents, thus many countries have laws requiring acceptable helmets to be worn by motorcycle riders.", "Safety equipment for motorcycles typically includes a helmet, gloves, boots and specialized pants.", "The use of a motorcycle helmet is required by law in many countries; for example, in the United States, all 50 states and the District of Columbia have laws requiring some or all motorcycle riders to wear helmets.", "A mirror is an object that reflects light in such a way that, for incident light in some range of wavelengths, the reflected light preserves many or most of the detailed physical characteristics of the original light, called specular reflection.", "A mirror is an object that reflects light in a way that preserves much of its original quality subsequent to its contact with the mirror.", "A mirror is a reflective surface that can be used to reflect light.", "The United States Department of Transportation's National Highway Traffic Safety Administration (NHTSA) recommends that all motorcycle riders wear helmets.", "Motorcycle helmet use is associated with a 71% reduction in the risk of death and a 69% reduction in the risk of head injury for motorcycle riders.", "Helmet.", "The helmet, eye protection, and protective clothing.", "Motorcycle safety concerns many aspects of vehicle and equipment design as well as operator skill and training that are unique to motorcycle riding.", "A motorcycle is a two-wheeled motor vehicle.", "It is suggested that safety equipment be utilized when driving this vehicle.", "helmet, gloves, boots, and leathers."]