["A typical car gets about 25 miles per gallon.", "A car gets about 20 miles per gallon.", "The average fuel economy for cars is about 25 miles per gallon.", "The average car gets about 25 miles per gallon.", "The average car gets about 30 miles per gallon.", "The average car gets about 20 miles per gallon.", "The average car gets 25.6 miles per gallon.", "The average car gets around 27 miles per gallon.", "The average car gets 27 miles per gallon.", "The car gets 30 miles per gallon.", "The car gets 25 miles per gallon.", "The average fuel economy of a white car is 20 miles per gallon.", "The car gets 37 miles per gallon.", "The car gets 20 miles per gallon.", "The average fuel economy of new cars sold in the United States in 2017 was 25.2 miles per gallon.", "The average fuel economy for a new car sold in the United States in 2016 was 24.8 miles per gallon.", "The white car gets about 35 miles per gallon.", "Miles per gallon is a unit of measurement for fuel efficiency.", "The average fuel economy for all cars sold in the United States in November 2015 was 25.1 miles per gallon.", "A white car gets 14 miles per gallon.", "The white car gets about 40 miles per gallon.", "The white car gets 20 miles per gallon.", "a car that gets 30 miles per gallon", "The average fuel economy for the entire light-duty vehicle fleet was 24.9 mpg (miles per gallon) in 2016.", "The car gets 23 miles per gallon", "The 2020 Toyota Corolla has a fuel economy of 30 miles to the gallon.", "A car (or automobile) is a wheeled motor vehicle used for transportation.", "Car is a four-wheeled motor vehicle used for transportation.", "The fuel economy of a vehicle is the amount of fuel used per unit distance.", "The fuel economy of an automobile relates distance traveled by a vehicle and the amount of fuel consumed.", "The gas mileage of a car is the number of miles per gallon of gas it gets.", "The fuel consumption of a vehicle is the amount of fuel consumed by the vehicle, normally expressed in liters per 100 km or miles per gallon.", "The average car gets 25 mpg.", "A car with a high MPG gets more miles per gallon of fuel than a car with a low MPG.", "The fuel efficiency of an automobile relates distance traveled by a vehicle and the amount of fuel consumed.", "The Chevrolet Corvette C7 Stingray gets an average of 16 miles per gallon in the city and 29 miles per gallon on the highway.", "The average sedan gets around 30 mpg.", "The average vehicle gets about 12,000 miles per year.", "The fuel economy of an automobile is the fuel efficiency relationship between the distance traveled and the amount of fuel consumed by the vehicle.", "The average fuel economy for a compact car is 27.9 mpg.", "The fuel economy of an automobile relates distance traveled by a vehicle and the amount of fuel consumed. Consumption can be expressed in terms of volume of fuel to travel a distance, or the distance travelled per unit volume of fuel consumed.", "The Nissan Versa gets an EPA-estimated 26 mpg in the city and 35 mpg on the highway with the CVT.", "A gallon is a unit of measurement for volume and fluid capacity in both the US customary units and the British imperial systems of measurement."]