["Eggs are usually eaten for breakfast.", "This is a breakfast dish.", "The meal is for breakfast.", "You can eat this for breakfast.", "Eggs are usually eaten at breakfast.", "The dish is commonly eaten for breakfast.", "It is eaten for breakfast.", "Eggs are commonly eaten at breakfast.", "Eggs are often eaten at breakfast.", "People eat this for breakfast.", "Eggs are a common breakfast food.", "Eggs are a very common breakfast food.", "You can eat eggs for breakfast, lunch, or dinner.", "A person would eat this at breakfast.", "breakfast food is eaten in the morning.", "You eat this at breakfast.", "You would eat this at breakfast.", "You would eat this for breakfast.", "The most common breakfast foods are eggs, pancakes, and bacon.", "Eggs can be part of a healthy breakfast.", "Eggs and gravy is a common breakfast food.", "I would eat this at breakfast.", "Eggs and gravy are eaten for breakfast.", "You may eat this for breakfast.", "Breakfast", "Breakfast is the first meal of a day.", "Breakfast is the first meal of a day, most often eaten in the early morning before undertaking the day's work.", "Breakfast is the first meal of a day, most often eaten in the early morning before undertaking the day's work. The word in English refers to breaking the fasting period of the previous night. There is a strong tendency for one or more \"typical\", or \"traditional\", breakfast menus to exist in most places, but the composition of this varies widely from place to place, and has varied over time, so that globally a very wide range of preparations and ingredients are now associated with breakfast.", "Eggs are eaten in the morning.", "breakfast.", "For breakfast.", "This is a typical American breakfast.", "Breakfast, lunch or dinner.", "Eggs and gravy is a breakfast dish consisting of eggs served with gravy.", "The sauce is often eaten with eggs, meat, fish, or vegetables.", "Eggs Benedict is a traditional American breakfast or brunch dish that consists of two halves of an English muffin topped with a poached egg, bacon or ham, and hollandaise sauce.", "Eggs are laid by female animals of many different species, including birds, reptiles, amphibians, mammals, and fish, and have been eaten by humans for thousands of years.", "The dish is a plate of food.", "The cream sauce is usually made with butter, flour and milk."]