["A motorcycle license is needed to drive this vehicle.", "A motorcycle requires a motorcycle license to drive.", "A motorcycle can be driven with a motorcycle license.", "a motorcycle license is needed to drive a motorcycle.", "A motorcycle license is required to drive a motorcycle.", "A motorcycle requires a license to drive.", "A motorcycle license is required to ride a motorcycle.", "A motorcycle driver's license is a license that permits a person to drive a motorcycle.", "To drive a motorcycle, you need a motorcycle license.", "A motorcycle license is a class of driver's license that is required to operate a motorcycle or motor-driven cycle.", "A motorcycle license is required to operate a motorcycle.", "Motorcycles require a driver’s license and a motorcycle endorsement.", "A motorcycle requires a license, registration, and insurance to be driven legally on public roads.", "A motorcycle is a vehicle that needs a license plate.", "A motorcycle is a two-wheeled motorized vehicle.", "a motorcycle is a two-wheeled motor vehicle.", "A motorcycle is a two-wheeled motor vehicle.", "A motorcycle is a two-wheeled vehicle that is powered by an engine.", "A motorcycle is a motor vehicle designed to transport one or two people.", "motorcycle is a two- or three-wheeled motor vehicle.", "A motorcycle license is required to legally operate a motorcycle in a public space.", "A motorcycle is a two-wheeled motor vehicle. The driver of a motorcycle is called a motorcyclist, or biker.", "A motorcycle is a vehicle used to transport people.", "A motorcycle is a vehicle with two wheels and a strong engine.", "A motorcycle, often called a bike, motorbike, or cycle, is a two or three wheeled motor vehicle.", "A motorcycle, often called a bike, motorbike, or cycle, is a two- or three-wheeled motor vehicle.", "A motorcycle is a vehicle that can be driven by a person sitting on it or standing next to it.", "A motorcycle requires the same controls as a car.", "The motorcycle is driven by an engine that is usually powered by petrol.", "A valid driver's license and a motorcycle license.", "A driver's license is required to drive a vehicle.", "A driver's license is a document permitting a specific individual to operate one or more types of motorized vehicles.", "A driver's license is an official document, often plastic and the size of a credit card, permitting a specific individual to operate one or more types of motorized vehicles, such as a motorcycle, car, truck, or bus on a public road."]