["The sign means stop.", "The sign means that a street is closed.", "The sign means \"stop\".", "The sign means that there are two streets.", "The sign means \"No Parking\".", "The sign means \"no parking\".", "This sign means the road is coming to an end.", "The sign means: STOP.", "This is a street sign.", "A stop sign is a traffic sign, usually erected at road junctions such as a four-way intersection, that instructs drivers to stop and then to proceed only if the way ahead is clear.", "The sign means \"No left turn\".", "The sign means \"no left turn\".", "The sign is a warning sign.", "A stop sign is a traffic sign to notify drivers that they must make sure no cars are coming and slow down before proceeding.", "The sign indicates that the street is a dead end.", "A street sign is a traffic sign that indicates the name of a street.", "A street sign is a traffic sign that indicates the name of a street, road, or path.", "a street sign is a traffic sign that shows the name of a street.", "This sign means \"No parking on this street\".", "A stop sign is a traffic sign to notify drivers that they must stop before proceeding.", "The sign means no parking.", "The sign is a traffic sign for a pedestrian crossing.", "A street sign is a sign posted on or near a street or roadway to give information to road users about the location, direction, destination, or hazard ahead.", "This sign means to stop.", "A street sign is a traffic sign that indicates the name of a street, highway, or other road. The street sign is mounted on a street sign post at the edge of the road. Street signs are used to help travelers locate destinations and to help emergency services locate incidents.", "A traffic sign is a type of sign used to indicate and regulate traffic on roads.", "The sign means no left turn.", "The sign means no stopping.", "A street sign is a traffic sign that indicates the name of a street, or the street number.", "The sign says \"Stop\".", "Stop sign means stop.", "A sign is a device to convey meaning, by means of a mark or symbol.", "Street signs are used to warn drivers of the dangers of the road ahead.", "This sign means you can go straight or turn left.", "A sign is an object, quality, event, or entity whose presence or occurrence indicates the probable presence or occurrence of something else.", "This sign means no entry.", "street sign, stop sign, traffic sign, warning sign, road sign, road, street, warning, traffic, stop, sign.", "A street or road name or odonym is an identifying name given to a street. The street name usually forms part of the address (though addresses in some parts of the world, notably most of Japan, make no reference to street names).", "Zu means \"stop\" in German."]