["Elbow and knee pads are protective gear worn on the elbows and knees.", "knee and elbow pads", "Elbow pads and knee pads are protective gear worn to protect the elbows and knees from injuries.", "Elbow and knee pads.", "Elbow pads and knee pads are protective gear worn on the elbows and knees to protect them from injury.", "Knee pads and elbow pads are protective gear worn to protect the knees and elbows from injuries.", "Elbow pads are used to protect the elbow joint from injury.", "The elbow and knees can be protected with pads.", "The pads are worn on the elbows and knees to prevent injuries.", "Knee and elbow pads are protective gear worn on the knees and elbows to protect them from injury during a fall.", "Pads are used to protect the elbows and knees.", "Pads are missing on this man's elbows and knees.", "Elbow pads are a type of padding used to protect the elbow, a joint which is particularly vulnerable to impact, from injury.", "Elbow pads and knee pads are protective gear worn by skaters to protect the elbow joint and patella respectively from injury in the case of a fall.", "Elbow pads and knee pads are protective gear worn by skateboarders, inline skaters, and roller skaters to protect the elbow and knee from injury in the case of a fall.", "Pads are protective gear worn by many athletes. These pads usually protect the knees and elbows.", "Knee and elbow pads are used as protection from injury and abrasions during skateboarding.", "The man is wearing pads on his elbows and knees.", "Knee pads are protective gear worn on the knees to protect them from injury.", "Knee pads are a type of protective equipment worn on the knees to protect them from injury during a fall, sports, or work.", "He is missing elbow and knee pads.", "The man is missing elbow pads and knee pads.", "Knee pads are protective gear worn on knees to protect them against impact and abrasion and sometimes used by workers in various trades where the risk of injury to knees is high.", "A skateboarder wears protective pads on his elbows and knees.", "Knee pads are clothing accessories worn on knees to protect them when the wearer is performing various activities in a prone position.", "The elbow pads and knee pads are missing.", "In the skateboard, we need to wear elbow pads and knee pads.", "The man is missing elbow and knee pads.", "Protective gear such as pads and helmets are usually worn by skateboarders for protection from injuries from falls.", "The man is missing knee and elbow pads.", "The man is missing padding on his elbows and knees.", "Elbows and knees are two common body parts.", "Protective pads.", "Pads", "Pads.", "The elbow is the visible joint between the upper and lower parts of the arm.", "Elbows are the joints between the upper and lower parts of the arms.", "The man is missing his elbows and knees.", "He is missing a helmet and knee pads.", "The elbow is one of the largest joints in the body. It allows the arm to move in many different directions. The elbow joint is made up of bone, cartilage, ligaments and fluid.", "The man has no pads on his elbows and knees.", "A skateboard is a type of sports equipment used primarily for the activity of skateboarding. It usually consists of a specially designed maplewood board combined with a polyurethane coating used for making smoother slides and stronger durability.", "A skateboard is a type of sports equipment used for skateboarding. It usually consists of a specially designed maplewood board combined with a polyurethane coating used for making smoother slides and stronger durability.", "The elbow is a hinge joint, which connects the humerus in the upper arm with the radius and ulna in the forearm.", "skateboarders often wear specialized shoes that have a flat sole for better grip and a padded sole for shock absorption.", "A knee is a joint in the leg. It is the meeting point of the thigh with the lower leg. The knee joins the thigh bone (the femur) with the shin bone (the tibia). The smaller bone that runs alongside the tibia (and together they form the 'shin') is called the fibula."]