["The boy jumped in the air to do a trick on his skateboard.", "Skateboarding is an action sport which involves riding and performing tricks using a skateboard.", "A skateboarder can jump in the air by riding his skateboard off a ramp.", "Skateboarding is an action sport which involves riding and performing tricks using a skateboard, as well as a recreational activity, an art form, an entertainment industry job, and a method of transportation.", "A skateboard ramp is a ramp that skateboarders use to perform tricks.", "A skateboarder jumps up in the air.", "Skateboarding is an action sport which involves riding and performing tricks using a skateboard. Skateboarding can also be considered a recreational activity, an art form, a job, or a method of transportation.", "The skateboarder is jumping.", "The skateboarder jumped in the air.", "A skateboard ramp is a ramp used for skateboarding.", "A skateboarder does a trick by jumping off a ramp.", "The skateboarder did a trick.", "Skateboarding is an action sport which involves riding and performing tricks using a skateboard. Skateboarding can also be considered a recreational activity, an art form, a job, or a method of transportation. Skateboarding has been shaped and influenced by many skateboarders throughout the years. A 2009 report found that the skateboarding market is worth an estimated $4.8 billion in annual revenue with 11.08 million active skateboarders in the world.", "A skateboard is a type of sports equipment used primarily for the sport of skateboarding. It usually consists of a specially designed maplewood board combined with a polyurethane coating used for making smoother slides and stronger durability.", "The boy is doing a skateboarding trick.", "Skateboarders are known for jumping in the air.", "A skateboard ramp is a structure used for skateboarding.", "Skateboarders get in the air by doing tricks.", "The boy is skateboarding and doing jumps.", "The skateboarder's feet causes the board to flip.", "Skateboarding is an action sport which involves riding and performing tricks using a skateboard, as well as a recreational activity, an art form, an entertainment industry job, and a method of transportation. Skateboarding has been shaped and influenced by many skateboarders throughout the years. A 2009 report found that the skateboarding market is worth an estimated $4.8 billion in annual revenue with 11.08 million active skateboarders in the world. In 2016, it was announced that skateboarding will be represented at the 2020 Summer Olympics in Tokyo.", "The skateboarder jumps by using the front foot to engage the tail of the board and using the back foot to push the nose forward.", "The skateboarder jumps by using his feet to push off the ground.", "A skateboard ramp is a ramp used for skateboarding. They are used for performing skateboarding tricks.", "The boy jumped.", "The boy got in the air by jumping.", "The boy jumped in the air.", "The boy is skateboarding.", "A skateboard ramp is a sloped ramp that is used by skateboarders to perform tricks. Ramps come in a variety of sizes, and can be of various materials.", "He is jumping.", "The boy is jumping.", "The boy jumped up.", "He jumped.", "ramp", "The boy used the ramp"]