["Ski poles are used by skiers for balance and propulsion.", "Ski poles are used to help the skier balance and propel themselves forward.", "Skiers use poles to help them ski.", "A ski pole is a pole used by skiers for balance and propulsion.", "Skiing is a means of transport using skis to glide on snow.", "Ski poles are used to help the skier maintain balance.", "Ski poles, also referred to as poles or sticks, are used by skiers for balance and propulsion.", "Skiing is a mode of transport, recreational activity and competitive winter sport in which the participant uses skis to glide on snow.", "Skis are used in conjunction with ski boots.", "A ski is a narrow strip of semi-rigid material worn underfoot to glide over snow.", "Ski poles or ski sticks, or simply poles or sticks, are used by skiers for balance and propulsion.", "The ski lift is a means of transport in skiing areas. It transports skiers up the mountain.", "A skier is a person who skis.", "Skiing is a means of transport using skis to glide on snow. Variations of purpose include basic transport, a recreational activity, or a competitive winter sport.", "Ski poles are used to provide stability and balance when skiing.", "A ski is a slender, elongated, generally pointed runner for gliding over snow.", "Skiing is a means of transport, a recreational activity and a competitive winter sport in which the participant uses skis to glide on snow.", "A ski lift is a mechanism for transporting skiers up a hill.", "A ski is a narrow strip of semi-rigid material worn underfoot to glide over snow. Substantially longer than wide and characteristically employed in pairs, skis are attached to ski boots with ski bindings, with either a free, lockable, or partially secured heel.", "Ski bindings are used to attach skiers to skis.", "A skier is a person who participates in skiing.", "Skis are long flat runners made of wood, plastic, fiberglass, or metal used for gliding over snow.", "Skiers need to have a ski lift to support them.", "Skis are long flat runners designed to glide over snow.", "Skis are long flat runners designed for sliding over snow.", "A ski pole, also referred to as poles or sticks, is a general term for any pole used by skiers for balance and propulsion. Modern ski poles are most commonly made from aluminum and carbon fiber.", "Ski boots are footwear used in skiing to provide a way to attach the skier to skis using ski bindings.", "Ski poles, also referred to as poles or sticks, are used by skiers for balance and propulsion. Modern ski poles are most commonly made from aluminum and carbon fiber.", "A skier would expect to see a ski lift, a chairlift, a gondola, a snowplow, a snowmobile, a snowcat, and a snowmobile.", "Ski lifts are typically a paid service at ski resorts.", "You would expect to see a ski lift to support a skier.", "One would expect to see a ski lift.", "Poles.", "A snowboard is a thin board that is used to slide down a slope of snow."]