["Bowls are made of ceramic.", "Bowls are made from ceramic materials.", "The bowls are made of ceramic.", "Ceramic bowls are usually made of clay and are usually glazed.", "Ceramic bowls are made from clay and other minerals.", "The bowls are made from a variety of different materials including ceramic, glass, plastic and even bamboo.", "The bowls are made from the clay.", "Bowls are made of clay.", "Bowls are usually made of wood, ceramic or plastic.", "Bowls are usually made from food-grade plastic, ceramic, or wood.", "Many bowls are made from clay.", "The bowls are made of clay.", "The bowls are made of a pottery.", "Bowls are made from many different materials such as wood, plastic, metal, glass, and ceramics.", "Bowls are made from a variety of materials, including wood, plastic, and glass.", "Bowls are made of clay. Bowls are made of clay. Bowls are made of clay.", "The most common type of bowl is made of ceramic.", "The bowls are made of plastic.", "Bowls are containers used for cooking, serving, and eating. Bowls can be made from many different materials, including wood, plastic, and metal.", "Bowls are made of many different materials. Bowls are made of clay, glass, plastic, and metal. Bowls are made of many different colors. Bowls can be made of orange, blue, green, purple, and red.", "These bowls are made out of clay.", "The bowl is made of clay.", "Clay is used to make bowls.", "The bowls are made from porcelain clay that has been fired in a kiln.", "Ceramic bowls are made from clay and fired in a kiln.", "The bowl is made of plastic.", "A bowl is a round, open-top container used in many cultures to serve hot and cold food. Bowls are typically small and shallow, although some, such as punch bowls and salad bowls, are larger and often intended to serve many people.", "A bowl is a round, open-top container used in many cultures to serve food, and is also used for drinking and storing other items.", "A bowl is an open-top container used in many cultures to serve food, and is also used for drinking and storing other items.", "A bowl is a round, open-top container used in many cultures to serve food, and is also used for drinking and storing other items. They are typically small and shallow, although some, such as punch bowls and salad bowls, are larger and often intended to serve many people.", "Dishes are made from clay.", "Bowls are usually small and shallow, although some may be larger and often have a wider bottom than top.", "Bowls are usually small and shallow, although some may be larger and often have an opening greater than their height.", "Ceramic and porcelain are both man-made materials that are created by heating and cooling natural materials.", "Ceramic is a material made of clay that is hardened by heating.", "Ceramic material is a solid material comprising an inorganic compound of metal, non-metal or metalloid atoms primarily held in ionic and covalent bonds.", "Ceramic is an inorganic, non-metallic solid prepared by the action of heat and subsequent cooling.", "Ceramic glazes are glass coatings.", "Ceramic is an inorganic, non-metallic, solid material comprising metal, non-metal or metalloid atoms primarily held in ionic and covalent bonds.", "Pottery is the process and the products of forming vessels and other objects with clay and other ceramic materials, which are fired at high temperatures to give them a hard, durable form."]