["The sport is played in a riding arena, usually during a horse show.", "The sport of horse racing is played at a racetrack.", "Horse racing is an equestrian sport that has been practiced over the centuries.", "Horse racing is an equestrian performance sport, typically involving two or more horses ridden by jockeys or driven over a set distance for competition.", "Horse racing is an equestrian performance sport, typically involving two or more horses ridden by jockeys over a set distance for competition.", "Horse racing is an equestrian performance sport, typically involving two or more horses ridden by jockeys (or sometimes driven without riders) over a set distance for competition.", "Horse racing is an equestrian sport, involving two or more jockeys riding horses over a set distance for competition.", "A horse show is an event where horses perform in a competition.", "Horse riding is a sport that is played in many places around the world.", "Horse racing venues are usually racetracks or raceways.", "Horseback riding is a sport.", "A horse show is a judged exhibition of horses and ponies. Many different horse breeds and equestrian disciplines hold competitions worldwide, from local to the international levels.", "Equestrianism is a sport in which people ride horses.", "Horseback riding is a sport in which people ride horses.", "The sport of horseback riding (also called equestrianism) refers to the skill of riding, driving, steeplechasing or vaulting with horses.", "A horse show is a judged exhibition of horses and ponies. Many different horse breeds and equestrian disciplines hold competitions worldwide, from local to the international levels. Most horse shows run from one to three days, sometimes longer for major, all-breed events or national and international championships in a given discipline or breed.", "Horse racing is an equestrian sport that has been practiced over the centuries; the chariot races of Roman times are an early example, as is the contest of the steeds of the god Odin and the giant Hrungnir in Norse mythology.", "The sport of horse racing is practiced in many countries throughout the world.", "Horseback riding is a sport played all over the world.", "Horses are often ridden in the Olympics.", "The sport of horse racing is an important part of British culture.", "Equestrianism is the skill of riding, driving, steeplechasing or vaulting with horses. This broad description includes the use of horses for practical working purposes, transportation, recreational activities, artistic or cultural exercises, and competitive sport.", "The sport is governed by various national bodies, such as the United States Equestrian Federation in the United States. Show jumping events have hunter classes, jumper classes and hunt seat equitation classes.", "Show jumping, also known as stadium jumping, open jumping, or simply jumping, is a part of a group of English riding equestrian events that also includes dressage, eventing, hunters, and equitation.", "Horse show is a judged exhibition of horses and ponies.", "There are many places where you can ride horses.", "A horse show is a judged exhibition of horses and ponies.", "Horse shows are held around the world, from the local to the international levels.", "The sport of horse racing is governed on an international level by the World Horse Racing Federation.", "The sport of horse racing is an important part of the economy of the United States.", "horse riding is played in a ring.", "This sport is played in a stadium.", "The sport is played in a stadium.", "The horse is galloping at a show.", "This sport is played in an arena.", "The sport is played in a large arena.", "the place is called a racetrack.", "The place is called a racetrack.", "A stadium is a place or venue for (mostly) outdoor sports, concerts, or other events and consists of a field or stage either partly or completely surrounded by a tiered structure designed to allow spectators to stand or sit and view the event."]