["The lights over the mirror are usually made by lighting companies such as Philips, GE, and Osram.", "The lights over the mirror are usually made by lighting manufacturers such as Philips, GE, or Osram.", "The lights over the mirror are typically made by lighting companies such as Philips, GE, and Osram.", "The lights over the mirror are typically made by lighting manufacturers such as Philips, GE, and Osram.", "The lights over the mirror are usually made by a lighting company, such as Philips, GE, or Osram.", "The lights over the mirror are typically made by lighting manufacturers such as Philips, GE, and Kichler.", "The lights over a bathroom mirror are typically made by lighting companies such as Philips, GE, and Kichler.", "The lights over the mirror are typically made by lighting companies such as Philips, GE, and Osram Sylvania.", "The lights over the mirror are typically made by lighting manufacturers such as Philips, GE, and Sylvania.", "Many bathroom mirrors are equipped with lights, which are typically made by lighting manufacturers such as Philips, GE, and Kichler.", "The lights over the mirror are usually made by a lighting manufacturer such as Philips, Cree, or GE.", "Light fixtures over bathroom mirrors are typically made by lighting manufacturers such as Kichler, Progress Lighting, and Sea Gull Lighting.", "Many companies make lights that can be mounted over bathroom mirrors, including Philips, GE, and Kichler.", "Lighting manufacturers such as Philips, GE, and Kichler make lights that are designed to be mounted over bathroom mirrors.", "Light fixtures are usually made by lighting companies such as Philips, GE, or Osram.", "Light fixtures are typically manufactured by lighting companies such as Philips, GE, and Osram.", "Many lighting companies make lights specifically designed to be used over bathroom mirrors. Popular brands include Kichler, Progress Lighting, and Hinkley Lighting.", "Many bathroom light fixtures are made by companies such as Kichler, Progress Lighting, and Quoizel.", "The lights over the mirror are typically installed by an electrician.", "Light fixtures, also known as luminaires, are used to provide general, task, or accent lighting. Common types of light fixtures include ceiling lights, wall-mounted fixtures, recessed lights, track lighting, and under-cabinet lighting."]