["Kittens eat cat food.", "Kittens eat food.", "Kittens eat meat and fish.", "Kittens eat wet cat food.", "Kittens are baby cats. Kittens eat the same food as adult cats.", "Kittens need to eat a special food made for kittens.", "Kittens are small animals that eat meat.", "Kittens eat milk.", "Kittens eat wet food.", "Kittens are fed milk.", "Kittens like to eat fish.", "Kitten food is formulated to meet the nutritional needs of a growing cat during the first year of life.", "Kittens are often fed commercial kitten food for the first few months of their life, as it is easier to digest and has more nutrients.", "Kittens are small carnivorous mammals of the family Felidae. They are related to the domestic cat.", "Kittens are fed with a special milk called kitten milk replacer until they are old enough to eat solid food.", "Kittens drink milk.", "Cats eat meat.", "Kitten food is food intended for consumption by kittens. Kitten food should be high in fat and protein and easy to chew.", "cats eat meat", "Kittens are fed milk by their mothers.", "Baby cats are called kittens.", "Cats are carnivores and eat mice, birds, fish and other small animals.", "Kittens are fed milk until they are weaned.", "The kitten is eating milk.", "Cats are carnivores.", "Cats are obligate carnivores: their physiology has evolved to efficiently process meat, and they have difficulty digesting plant matter.", "A kitten is a juvenile cat. After being born, kittens are totally dependent on their mother for survival and they do not normally open their eyes until after seven to ten days.", "Cat food is food for consumption by cats. Cats have specific requirements for their dietary nutrients. Certain nutrients, including many vitamins and amino acids, are degraded by the temperatures, pressures and chemical treatments used during manufacture, and hence must be added after manufacture to avoid nutritional deficiency.", "The kitten is drinking milk.", "A cat is a carnivorous mammal.", "The cat eats fish. The dog eats meat.", "Kittens are born in a litter of one to nine kittens. They are weaned after 6–7 weeks and become independent at 7 months. Kittens are highly social animals and will normally live in a group.", "A cat is a small, furry animal that eats mice.", "Kittens are born with their eyes closed. They open them in about six days, take a look around, then close them again for the better part of their lives.", "The food these animals eat is milk.", "Kittens are born after a gestation lasting between 64 and 67 days, with an average length of 66 days.", "Milk is a white liquid produced by the mammary glands of mammals. It is the primary source of nutrition for infant mammals (including humans who breastfeed) before they are able to digest other types of food.", "The milk bottle is a milk bottle."]