["The safety precautions are wearing helmets.", "The safety precautions taken in the photo are wearing helmets.", "Safety precautions include wearing a helmet.", "Safety precautions are taken in the photo are wearing helmets.", "Helmets are an important safety precaution for any sport.", "Helmets are protective gear worn on the head to protect it from injuries.", "People wear helmets for safety.", "Helmets are worn to protect the head.", "Helmets are used to protect the head.", "Helmets are a form of protective gear worn to protect the head from injuries.", "A helmet is a form of protective gear worn to protect the head from injuries.", "The helmet is a form of protective gear worn to protect the head from injuries.", "a helmet is a form of protective gear worn to protect the head.", "They are wearing helmets.", "A helmet is a form of protective gear worn to protect the head from injuries. More specifically, a helmet complements the skull in protecting the human brain.", "Many sports require protective gear, such as helmets or shin guards. This is especially important for children, who are more likely to be injured.", "A helmet is a form of protective gear worn to protect the head from injuries. More specifically, a helmet aids the skull in protecting the human brain. Ceremonial or symbolic helmets (e.g., English police motorcycle helmets) without protective function are sometimes used.", "The young people are wearing helmets and protective gear.", "Safety precautions taken in the photo include wearing a helmet and using a baseball bat.", "Safety precautions are taken to prevent injury.", "The children are wearing helmets.", "Safety precautions are taken to prevent accidents, injuries and death.", "The players are wearing helmets.", "Safety helmets are made of a hard, shock-resistant, and water-resistant material such as fiberglass or carbon fiber.", "Wear a helmet.", "We can see the boys are wearing helmets.", "The boy and the girl are wearing helmets.", "The boys are wearing helmets.", "Proper safety equipment should be worn at all times. This includes a helmet, elbow pads, wrist guards, knee pads, and padded shorts.", "The sport of baseball requires the use of protective equipment.", "Safety is the state of being \"safe\", the condition of being protected from harm or other non-desirable outcomes.", "Safety is the state of being \"safe\", the condition of being protected against physical, social, spiritual, financial, political, emotional, occupational, psychological, educational or other types or consequences of failure, damage, error, accidents, harm or any other event which could be considered non-desirable.", "Baseball is a bat-and-ball game played between two opposing teams who take turns batting and fielding.", "Baseball is a bat-and-ball game played between two opposing teams who take turns batting and fielding. The game proceeds when a player on the fielding team, called the pitcher, throws a ball which a player on the batting team tries to hit with a bat.", "This is a photo of a baseball game.", "Safety is the state of being \"safe\" (from French sauf), the condition of being protected from harm or other non-desirable outcomes. Safety can also refer to the control of recognized hazards in order to achieve an acceptable level of risk.", "Safety is the state of being \"safe\" (from French sauf), the condition of being protected from harm or other non-desirable outcomes.", "Masks are protective coverings worn over the nose and mouth."]