["The brand is Ford.", "The brand of car shown in this photo is a Ford.", "The truck is a Ford.", "The car is a Chevrolet.", "The car shown in the photo is a Ford.", "Pepsi is a brand of car.", "The car is an old-fashioned truck.", "The car is a Ford.", "The Ford Motor Company is an American multinational automaker headquartered in Dearborn, Michigan, a suburb of Detroit. It was founded by Henry Ford and incorporated on June 16, 1903.", "Chevrolet is a brand of automobile produced by General Motors.", "The Ford Motor Company is an American multinational automaker that has its main headquarters in Dearborn, Michigan, a suburb of Detroit. It was founded by Henry Ford and incorporated on June 16, 1903.", "The Ford Motor Company is an American multinational automaker that has its main headquarters in Dearborn, Michigan, a suburb of Detroit.", "The truck is a Ustra truck.", "The Ford Motor Company is an American multinational automaker that has its main headquarter in Dearborn, Michigan, a suburb of Detroit.", "The brand of the car is Ustra.", "A truck is a motor vehicle designed to transport cargo. Trucks vary greatly in size, power, and configuration; smaller varieties may be mechanically similar to some automobiles.", "A brand is a name, term, design, symbol, or other feature that distinguishes an organization or product from its rivals in the eyes of the customer. Brands are used in business, marketing, and advertising.", "A brand is a name, term, design, symbol, or other feature that distinguishes an organization or product from its rivals in the eyes of the customer.", "A truck is a motor vehicle designed to transport cargo.", "Pepsi is a brand of carbonated soft drink produced and manufactured by PepsiCo.", "Pepsi is a carbonated soft drink manufactured by PepsiCo.", "Pepsi is a carbonated soft drink manufactured by PepsiCo. Originally created and developed in 1893 by Caleb Bradham and introduced as Brad's Drink, it was renamed as Pepsi-Cola on August 28, 1898, and then as Pepsi in 1961.", "Pepsi is a carbonated soft drink that is produced and manufactured by PepsiCo.", "Pepsi is a carbonated soft drink manufactured by PepsiCo. Originally created and developed in 1893 and introduced as Brad's Drink, it was renamed as Pepsi-Cola on August 28, 1898, then to Pepsi in 1961, and in select areas of North America, Pepsi-Cola Made with Real Sugar as of 2014.", "The car brand is Ustra.", "A truck is a motor vehicle designed to transport cargo. Trucks vary greatly in size, power, and configuration, with the smallest being mechanically similar to an automobile.", "The first Pepsi-Cola was created in 1893 by Caleb Bradham, a pharmacist and industrialist from New Bern, North Carolina.", "A truck or lorry is a motor vehicle designed to transport cargo. Trucks vary greatly in size, power and configuration, with the smallest being mechanically similar to an automobile.", "The Ford Model T (colloquially known as the Tin Lizzie, Leaping Lena, or flivver) is an automobile produced by Ford Motor Company from October 1, 1908, to May 26, 1927.", "Chevrolet (/ˌʃɛvrəˈleɪ/ shev-rə-LAY), colloquially referred to as Chevy and formally the Chevrolet Division of General Motors Company, is an American automobile division of the American manufacturer General Motors (GM).", "Chevrolet, colloquially referred to as Chevy and formally the Chevrolet Division of General Motors Company, is an American automobile division of the American manufacturer General Motors (GM). Louis Chevrolet and ousted General Motors founder William C. Durant started the company on November 3, 1911 as the Chevrolet Motor Car Company.", "The Ford F-Series is a series of light-duty trucks and medium-duty trucks (Class 2-7) that have been marketed and manufactured by Ford Motor Company.", "The Oldsmobile was a brand of American automobiles produced for most of its existence by General Motors.", "The Chevrolet Suburban is a full-size SUV from Chevrolet. It is the longest continuous use automobile nameplate in production, starting in 1935 for the 1935 U.S. model year, and has traditionally been one of General Motors' most profitable vehicles.", "The company was founded in Detroit, Michigan, in 1903 by Henry Ford.", "A car (or automobile) is a wheeled motor vehicle used for transportation. Most definitions of car say they run primarily on roads, seat one to eight people, have four tires, and mainly transport people rather than goods.", "Ustra is a German manufacturer of cars.", "The first production car of what is now the Mercedes-Benz car brand was the Benz Patent-Motorwagen in January 1886.", "The company's first car, the Model T, was introduced on October 1, 1908.", "Cars are vehicles that move on wheels and usually have an internal combustion engine."]