["The name of the player is Roger Federer.", "The player is called a tennis player.", "Roger Federer is a professional tennis player.", "The player in this picture is a tennis player.", "A tennis player is a person who plays tennis.", "The player is Roger Federer.", "A tennis player is a person who plays tennis professionally.", "tennis player", "Tennis player", "The player is named Roger Federer.", "The player in this picture is Roger Federer.", "The player is named Federer.", "Roger Federer is the name of a famous tennis player.", "Roger Federer is a Swiss professional tennis player. He is ranked world No. 2 in men's singles tennis by the Association of Tennis Professionals (ATP).", "Roger Federer is a Swiss professional tennis player who is currently ranked world No. 2 in men's singles tennis by the Association of Tennis Professionals (ATP).", "Roger Federer is a Swiss professional tennis player who is currently ranked world No. 3 in men's singles tennis by the Association of Tennis Professionals (ATP).", "Roger Federer is a Swiss professional tennis player.", "Roger Federer is a Swiss professional tennis player who is currently ranked world No. 1 in men's singles tennis by the Association of Tennis Professionals (ATP).", "Roger Federer is a Swiss professional tennis player who is currently ranked world No. 3 in men's singles tennis by the Association of Tennis Professionals.", "Roger Federer is a Swiss professional tennis player who is currently ranked world No. 3 by the Association of Tennis Professionals.", "The man is Roger Federer. Roger Federer is a Swiss professional tennis player who is currently ranked world No. 3 in men's singles tennis by the Association of Tennis Professionals.", "The name of the player in this picture is Roger Federer.", "Roger Federer", "The man is playing tennis.", "Tennis players are often called by their last name.", "Tennis is a racket sport that can be played individually against a single opponent or between two teams of two players each.", "Rafael Nadal is a Spanish professional tennis player ranked world No. 1 in men's singles tennis by the Association of Tennis Professionals.", "Tennis is a racket sport that can be played individually against a single opponent (singles) or between two teams of two players each (doubles).", "Tennis is a racket sport that can be played individually against a single opponent (singles) or between two teams of two players each (doubles). Each player uses a tennis racket that is strung with cord to strike a hollow rubber ball covered with felt over or around a net and into the opponent's court.", "Rafael Nadal Parera is a Spanish professional tennis player, currently ranked world No. 1 in men's singles tennis by the Association of Tennis Professionals.", "John Isner is an American professional tennis player.", "A player is a person who plays a sport.", "A player is a person who plays a sport or game."]