["Bananas are a type of fruit.", "Bananas are classified as a fruit.", "Bananas are a fruit.", "Bananas are classified either as a fruit or as a berry.", "A banana is a type of fruit.", "Bananas are fruits.", "Bananas are fruit.", "A banana is an edible fruit – botanically a berry – produced by several kinds of large herbaceous flowering plants in the genus Musa.", "Banana is an edible fruit – botanically a berry – produced by several kinds of large herbaceous flowering plants in the genus Musa.", "A banana is an elongated, edible fruit – botanically a berry – produced by several kinds of large herbaceous flowering plants in the genus Musa.", "Banana is an edible fruit, botanically a berry, produced by several kinds of large herbaceous flowering plants in the genus Musa.", "Bananas are classified either as a fruit or a herb, and as a fruit, bananas are considered a berry.", "The banana is an edible fruit – botanically a berry – produced by several kinds of large herbaceous flowering plants in the genus Musa. In some countries, bananas used for cooking may be called plantains, in contrast to dessert bananas. The fruit is variable in size, color and firmness, but is usually elongated and curved, with soft flesh rich in starch covered with a rind, which may be green, yellow, red, purple, or brown when ripe.", "Bananas are both a fruit and not a fruit. While the banana plant is colloquially called a banana tree, it’s actually an herb distantly related to ginger, since the plant has a succulent tree stem, instead of a wood one. The yellow thing you peel and eat is, in fact, a fruit because it contains the seeds of the plant.", "These are fruits.", "Bananas are classified either as a fruit or a berry. Bananas grow in a variety of colors, including green, red, yellow, and purple.", "Fruits are edible plants.", "Bananas are frutis.", "Bananas are one of the most popular fruits in the world. They are a good source of potassium, fiber, vitamin C, and vitamin B6. They also contain some protein and iron.", "Bananas are the world’s most popular fruit.", "Fruit is the sweet and fleshy product of a tree or other plant that contains seed and can be eaten as food.", "Fruits are the sweet and fleshy product of a tree or other plant that contains seed and can be eaten as food.", "Bananas are classified either as dessert bananas (meaning they are yellow and fully ripe when eaten) or as green cooking bananas. Almost all export bananas are of the dessert types; however, only about 10% of production is for export. Most cooking bananas are referred to as plantains or green bananas, although not all of them are true plantains.", "Bananas are classified either as dessert bananas (meaning they are yellow and fully ripe when eaten) or as green cooking bananas. They are grown in at least 107 countries, primarily for their fruit, and to a lesser extent to make fiber, banana wine and banana beer and as ornamental plants.", "A fruit is an edible part of a plant that usually has seed(s) in it.", "Bananas are classified either as dessert bananas (meaning they are yellow and fully ripe when eaten) or as green cooking bananas. Almost all export bananas are of the dessert types; however, only about 10% of production is for export.", "A fruit is the seed-bearing structure in flowering plants formed from the ovary after flowering. Fruits are the means by which angiosperms disseminate seeds.", "banana bananas orange apples apple orange is next banana bananas,, banana wooden fruit wooden. banana fruit bananas with bananas bananas bananas fruit and bananas banana bananas bananas bananas banana banana", "Bananas are very nutritious and contain several essential nutrients. They are rich in fiber and antioxidants, and eating them may help lower blood sugar and bad cholesterol levels.", "A fruit is the seed-bearing structure in flowering plants formed from the ovary after flowering.", "A fruit is the seed-bearing structure in flowering plants (also known as angiosperms) formed from the ovary after flowering.", "Fruits are the means by which angiosperms disseminate seeds."]