["Liberace used a piano.", "Liberace used a piano in his career.", "Liberace used a piano for his career.", "Liberace used the piano in his career.", "Liberace used to play the piano.", "Liberace was a pianist, singer, and actor. He used a piano in his career.", "Liberace was a pianist and entertainer.", "Liberace was a pianist and vocalist.", "Liberace was a pianist.", "Liberace was a famous pianist.", "Liberace was an American pianist, singer and actor.", "Liberace was an American pianist and singer.", "Liberace was an American pianist, singer, and actor.", "Liberace played piano.", "Liberace was an American pianist and vocalist.", "Liberace played the piano.", "Liberace was an American pianist, singer and actor. A child prodigy, Liberace enjoyed a career spanning four decades of concerts, recordings, television, motion pictures, and endorsements.", "Liberace was an American pianist, singer and actor. A child prodigy and the son of working-class immigrants, Liberace enjoyed a career spanning four decades of concerts, recordings, television, motion pictures, and endorsements.", "Liberace was an American pianist, singer, and actor. A child prodigy and the son of working-class immigrants, Liberace enjoyed a career spanning four decades of concerts, recordings, motion pictures, television, and endorsements.", "Liberace (1919-1987) was an American pianist and vocalist.", "Liberace used a number of pianos in his career.", "In his career, Liberace used many pianos.", "Liberace used a candelabra on his piano.", "Liberace used candelabra on his piano to create a spectacle and make his performances more dramatic.", "The piano was Liberace’s trademark, and a TV special about it was broadcast in 1954.", "Liberace's career spanned four decades of concerts, recordings, motion pictures, television, and endorsements.", "Liberace used candelabra as part of his stage act.", "He was known for his flamboyant stage persona and costumes. He was also known for his vocals and piano playing.", "The piano is a musical instrument played using a keyboard.", "Liberace became the highest-paid entertainer in the world, with established concert residencies in Las Vegas, and an international touring schedule.", "Liberace used a candelabra.", "The piano is an acoustic, stringed musical instrument invented in Italy by Bartolomeo Cristofori around the year 1700.", "The piano is an acoustic, stringed musical instrument invented in Italy by Bartolomeo Cristofori around the year 1700 (the exact year is uncertain), in which the strings are struck by hammers."]