["The truck is more than 10 years old.", "It is an old truck.", "The truck is old.", "The truck is more than ten years old.", "A truck that is more than ten years old would be an antique truck.", "The truck is a vintage fire truck that was built in the 1920s.", "The fire truck is an old model.", "truck is more than ten years old", "The fire truck is more than ten years old.", "The truck is more than ten years old because it is a classic fire truck.", "A truck is a motor vehicle designed to transport cargo.", "This truck is more than 10 years old.", "The fire truck is at least 10 years old, but it is not more than 20 years old.", "Trucks are more than 10 years old.", "A truck is more than ten years old if it was made before 2007.", "The firetruck is more than ten years old.", "A fire truck is a vehicle designed primarily for firefighting operations.", "A fire truck is an emergency vehicle for putting out fires.", "Old is an adjective used to describe something that has existed for a long time.", "Old is a term used to indicate that something is out of date or no longer in common use.", "A truck is a motor vehicle designed to transport cargo. Trucks vary greatly in size, power, and configuration; smaller varieties may be mechanically similar to some automobiles.", "A truck or lorry is a motor vehicle designed to transport cargo.", "A fire engine is a vehicle designed primarily for firefighting operations. The terms \"fire engine\" and \"fire truck\" are often used interchangeably; however in some fire departments/fire services they refer to separate and specific types of vehicle.", "Fire engines are vehicles designed primarily for firefighting operations.", "The pickup truck is a light-duty truck having an enclosed cab and an open cargo area with low sides and tailgate.", "The first motorized fire engine was built in 1902 in the United States.", "The truck was invented in 1869 by German inventor Gottlieb Daimler.", "The average age of a car in the United States is 11.5 years.", "An antique car is an automobile that is an antique. Narrower definitions vary based on how old a car must be to qualify.", "The Ford F-Series is a series of light-duty trucks and medium-duty trucks (Class 2-7) that have been marketed and manufactured by Ford Motor Company since 1948."]