["The \"M\" symbol for McDonald's is one of the most recognized logos in the world.", "The McDonald's logo is an M for McDonald's.", "McDonald's is an American hamburger and fast food restaurant chain.", "The McDonald's logo is recognized worldwide.", "McDonald's is a fast food restaurant chain.", "The McDonald's logo is the golden arches of the letter M on a red background.", "McDonalds is a fast food restaurant chain.", "The large M is the McDonalds logo.", "The McDonald's logo was created by brothers Richard and Maurice McDonald in 1962. The logo is a yellow \"M\" with a red background.", "The sign denotes that it is a McDonald's restaurant.", "A McDonald's is a fast food restaurant that sells hamburgers, chicken, French fries, soft drinks, milkshakes, and other food.", "McDonald's is an American hamburger and fast food restaurant chain. It was founded in 1940 as a barbecue restaurant operated by Richard and Maurice McDonald.", "The Golden Arches logo of McDonald's is one of the most recognized symbols in the world.", "McDonald’s is an American hamburger and fast food restaurant chain. It was founded in 1940 as a barbecue restaurant operated by Richard and Maurice McDonald, in San Bernardino, California, United States.", "McDonald's is an American hamburger and fast food restaurant chain. It was founded in 1940 as a barbecue restaurant operated by Richard and Maurice McDonald, in San Bernardino, California, United States.", "McDonald's is an American fast food company, founded in 1940 as a restaurant operated by Richard and Maurice McDonald, in San Bernardino, California, United States. They rechristened their business as a hamburger stand.", "The McDonald's Corporation is an American fast food company, founded in 1940 as a restaurant operated by Richard and Maurice McDonald, in San Bernardino, California, United States.", "McDonald's is an American hamburger and fast food restaurant chain. It was founded in 1940 as a barbecue restaurant operated by Richard and Maurice McDonald. In 1948, they reorganized their business as a hamburger stand using production line principles.", "McDonald's is an American fast food company, founded in 1940 as a restaurant operated by Richard and Maurice McDonald, in San Bernardino, California, United States.", "The M stands for McDonalds.", "McDonald's is an American hamburger and fast food restaurant chain. It was founded in 1940 as a barbecue restaurant operated by Richard and Maurice McDonald. In 1948, they reorganized their business as a hamburger stand, using production line principles. Businessman Ray Kroc joined the company as a franchise agent in 1955.", "The red sign with the large M denotes a McDonald's restaurant.", "The red sign with the large M denotes the McDonald's.", "The Golden Arches are the symbol of McDonald's, the global fast-food restaurant chain.", "The golden arches of McDonald's are one of the most recognizable logos in the world.", "The red sign with the large m denotes McDonald's.", "The red sign with the large M denotes McDonald's.", "The red sign with the large M denotes a McDonalds.", "The sign with the large M denotes a McDonald's.", "The McDonald's Corporation is the world's largest chain of hamburger fast food restaurants, serving around 68 million customers daily in 119 countries across 35,000 outlets.", "the red sign with the large m denotes the mcdonalds", "The golden arches or yellow arches is the symbol of American fast food restaurant chain McDonald's.", "A McDonald's restaurant is operated by either a franchisee, an affiliate, or the corporation itself.", "The Golden Arches logo is widely regarded as one of the most recognized symbols in the world.", "A logo is a graphic mark or emblem commonly used by commercial enterprises, organizations and even individuals to aid and promote instant public recognition."]