["The vehicles are floating on train tracks.", "Trains are floating on tracks.", "Trains are floating on the tracks.", "The trains are floating on a track.", "The trains are floating on railway tracks.", "These trains are floating on rails.", "Trains float on rails.", "The trains are on the rails.", "Trains are vehicles that run on rails.", "The trains are on tracks.", "Trains are a form of rail transport consisting of a series of connected vehicles that generally run along a railroad track to transport cargo or passengers.", "trains are on a track.", "The trains are on a track.", "A train is a connected series of vehicles for rail transport that move along a track (permanent way) to transport cargo or passengers.", "A train is a form of rail transport consisting of a series of connected vehicles that generally runs along a rail track to transport cargo or passengers.", "Train is a form of rail transport consisting of a series of connected vehicles that generally run along a railroad track to transport cargo or passengers.", "A train is a form of transport consisting of a series of connected vehicles that generally runs along a rail track to transport cargo or passengers.", "A train is a form of rail transport consisting of a series of connected vehicles that generally run along a railroad track to transport cargo or passengers.", "A train is a form of rail transport consisting of a series of connected vehicles that generally runs along a railroad track to transport cargo or passengers.", "These trains are not floating, they are on rails.", "A train is a form of rail transport consisting of a series of connected vehicles that generally run along a railroad (or railway) track to transport cargo or passengers.", "A train is a form of transport consisting of a series of connected vehicles that generally run along a railroad track to transport cargo or passengers.", "A train is a form of transport consisting of a series of connected vehicles that generally runs along a railroad track to transport cargo or passengers.", "Trains run on tracks.", "the trains are floating on the water.", "The trains are parked on the rails.", "The trains are sitting on a track.", "Rail transport is a means of transferring of passengers and goods on wheeled vehicles running on rails, also known as tracks.", "A railway wagon, railcar (American and Canadian English), rail truck (Australian English and New Zealand English), railway carriage or railroad car (American English), also called a train car or train wagon, is a vehicle used for the carrying of cargo or passengers on a rail transport system (a railroad/railway). Such cars, when coupled together and hauled by one or more locomotives, form a train. Alternatively, some passenger cars are self-propelled in which case they may be either single railcars or make up multiple units.", "The trains are sitting on the train tracks.", "The vehicles are floating on rails.", "The train is sitting on the train tracks.", "These vehicles are floating on water.", "These vehicles are floating on the water.", "The vehicles are floating on water.", "They are floating on the water.", "They are on a track.", "These vehicles are sitting on ground.", "The first rail transport systems arose in the early 19th century.", "Steel rails.", "A vehicle is a mobile machine that transports people or cargo."]