["People are waiting for food.", "People are waiting for the food to be ready.", "The people are waiting for food.", "The people are waiting for the food to be served.", "People are waiting to eat.", "They are waiting for food.", "They are waiting for the food.", "People wait for food at restaurants.", "They are waiting for some food.", "People wait when they are hungry.", "People are waiting for the food to be cooked.", "The people are waiting for the food to be cooked.", "The people are waiting for a chef.", "People are waiting for a chef to cook.", "The people are waiting for the food to finish cooking.", "A group of people are waiting for the chef to cook.", "People wait for food to be cooked.", "People are waiting for the man to cook.", "The people are waiting for the man to cook.", "People wait in line before entering a restaurant.", "A group of people are waiting for a man to cook.", "A line is a one-dimensional figure having no thickness and extending infinitely in both directions. A line is sometimes called a straight line or, more archaically, a right line.", "A line is a long thin mark, as made by a pen.", "They are waiting for dinner.", "a group of people are waiting for a bus.", "A person or group of people who are waiting for someone or something.", "People are waiting for the train.", "These people are waiting for the bus.", "People waiting for a free table at a cafe.", "They are waiting for a bus.", "Waiting is a state where a person is willing to wait for something.", "The people are waiting for a bus.", "People wait in lines to buy things.", "The people are waiting for the bus.", "A chef is a person who cooks food.", "a group of people are watching a man cook", "Waiting is the action or state of waiting for something or someone.", "A chef is a trained professional cook who is proficient in all aspects of food preparation of a particular cuisine.", "A chef is a trained professional cook who is proficient in all aspects of food preparation, often focusing on a particular cuisine.", "Waiting is the state of doing nothing or becoming less active in expectation of some occurrence."]