["The batter is standing on the first base.", "The batter is standing on first base.", "The batter is standing on the 1st base.", "A batter is entitled to first base without being put out if he hits a fair ball and is touched by a fielder with the ball in his hand before the ball touches the ground.", "In baseball, a batter is the person whose turn it is to face the pitcher. The three main tasks of a batter are to become a baserunner, to help move baserunners along, and to score runs.", "Baseball is a bat-and-ball game played between two opposing teams who take turns batting and fielding.", "In baseball, the word \"base\" refers to one of four stations on a baseball field which must be touched by a runner in order to score a run.", "Batter is a baseball player whose turn it is to bat.", "The batter's box is where the batter stands when ready to hit the pitched ball.", "First base is the first of four stations on a baseball diamond which must be touched in succession by a base runner in order to score a run for that player's team.", "First base is the first of four bases that must be touched by a player on the batting team in order to score a run for that player's team.", "First base is the first of four stations on a baseball diamond which must be touched in succession by a base runner in order to score a run for that players team.", "A base is a station on a baseball field where a runner can stand safely and try to advance to the next base or score a run.", "The batter is the person whose turn it is to bat.", "The batter's box is the area where the batter stands when ready to bat.", "A batter or batter-runner is a person whose turn it is to face the pitcher.", "The batter's box is the area in which the batter stands when preparing to hit the ball.", "The batter's box is where the batter stands when ready to bat.", "A batter is a person who stands in the box to hit a ball thrown by the pitcher.", "Baseball is a bat-and-ball game played between two opposing teams who take turns batting and fielding. The game proceeds when a player on the fielding team, called the pitcher, throws a ball which a player on the batting team tries to hit with a bat.", "The batter is standing on home plate.", "A batter is standing on home plate.", "The batter is standing at home plate.", "The home plate is the place where the batter stands.", "The first base is the first of four bases that must be touched by a base runner in baseball.", "The player is standing on first base.", "First base.", "first base", "The batter must strike the ball into fair territory, or the batter is out.", "The player is standing on second base.", "The player is standing on the home base.", "A baseball field, also called a ball field or a baseball diamond, is the field upon which the game of baseball is played.", "Third base.", "The bases are the four corners of the diamond. They are designated as first base, second base, third base, and home plate.", "A baseball field, also called a ball field, sandlot or a baseball diamond, is the field upon which the game of baseball is played.", "Batting is in cricket a role generally filled by specialist batsmen."]