["A marathon is a long-distance running event with an official distance of 42.195 kilometres, usually run as a road race.", "A marathon is a long-distance race with an official distance of 42.195 kilometres (26 miles 385 yards), usually run as a road race.", "The marathon is a long-distance race with an official distance of 42.195 kilometres, usually run as a road race.", "A marathon is a long-distance running event with an official distance of 42.195 kilometres (26 miles 385 yards), usually run as a road race.", "A marathon is a long-distance running event with an official distance of 42.195 kilometers (26 miles 385 yards), usually run as a road race.", "A marathon is a long-distance running race with an official distance of 42.195 kilometres (26 miles 385 yards), usually run as a road race.", "A marathon is a long-distance race, completed by running, walking, or a run/walk strategy. There are also wheelchair divisions. The marathon has an official distance of 42.195 kilometres, usually run as a road race.", "The marathon is a long-distance race with an official distance of 42.195 kilometres (26 miles 385 yards), usually run as a road race.", "A marathon is a long-distance running race with an official distance of 42.195 kilometres.", "a marathon is a long-distance race, completed by running, walking, or a run/walk strategy.", "A marathon is a long-distance race, completed by running, walking, or a run/walk strategy.", "A marathon is a long-distance running competition.", "A marathon is a long-distance race, completed by running, walking, or a run/walk strategy. There are also wheelchair divisions. The marathon has an official distance of 42.195 kilometres (26.219 miles; 26 miles 385 yards), usually run as a road race.", "The marathon is a long-distance race, completed by running, walking, or a run/walk strategy. There are also wheelchair divisions. The marathon has an official distance of 42.195 kilometres (26.219 miles; 26 miles 385 yards), usually run as a road race.", "Marathon is a long-distance running event with an official distance of 42.195 kilometres.", "A marathon is a long-distance race, completed by running, walking, or a run/walk strategy. There are also wheelchair divisions.", "The race is a marathon, a long-distance running event with an official distance of 42.195 kilometres (26 miles and 385 yards).", "The marathon is a long-distance race, completed by running, walking, or a run/walk strategy.", "A marathon is a long-distance running race. It is about 42 km long. The marathon was first run in ancient Greece.", "The race is a marathon.", "This is a marathon.", "A race is a competition of speed, against an objective criterion, usually a clock or to a specific point."]