["These jackets are made of leather.", "The jackets are typically made of leather or synthetic materials such as nylon or polyester.", "The jackets are typically made of leather or synthetic materials such as polyester or nylon.", "The jackets are made of leather or synthetic materials such as nylon or polyester.", "The jackets are typically made of leather or synthetic materials such as nylon, polyester, or spandex.", "These jackets are usually made of leather or synthetic materials such as nylon or polyester.", "These jackets are typically made of leather or a synthetic material such as nylon or polyester.", "The jackets are typically made of leather, canvas, or a synthetic material.", "The jackets are usually made of leather, but can also be made of other fabrics such as cotton or polyester.", "The jackets are typically made from leather or synthetic materials.", "The jackets in the picture are typically made of leather or synthetic materials such as nylon, polyester, or acrylic.", "These jackets are typically made of leather, nylon, or a combination of the two.", "The jackets are most likely made of a synthetic fabric such as polyester or nylon.", "Motorcycle jackets are typically made of leather or a synthetic material such as nylon or polyester.", "Motorcycle jackets are typically made of leather or synthetic materials such as nylon, polyester, or Kevlar.", "Motorcycle jackets are typically made of leather, nylon, or a combination of both.", "Motorcycle jackets are typically made of leather or textile materials such as nylon or polyester.", "The jackets are made of a lightweight, water-resistant fabric, typically nylon or polyester.", "Motorcycle jackets are typically made of leather, denim, or textile materials.", "Motorcycle jackets are typically made from leather or textile materials such as nylon and Kevlar.", "Motorcycle jackets are typically made from leather or a heavy-duty synthetic material such as Cordura.", "Motorcycle jackets are typically made from leather, textile, or a combination of the two. They are designed to provide protection from the wind, rain, and cold, as well as provide cushioning in the event of an accident.", "Motorcycle jackets are typically made of leather or other durable fabrics such as Cordura or Kevlar.", "It is not possible to determine the fabric of the jackets from the given context.", "Leather."]