["Elephants are herbivores. They eat leaves, grass, roots, bark, twigs, flowers and fruit.", "Elephants are herbivores, which means that they only eat plants. They eat grasses, roots, fruit and bark.", "Elephants are herbivores, which means they eat plants. They eat grass, fruit, tree bark and roots.", "Elephants are herbivores. They eat grasses, roots, fruit and bark, and they eat a lot of these things.", "Elephants are herbivores, which means they eat plants.", "Elephants eat hay.", "elephants eat hay.", "Elephants are herbivores, which means they only eat plant-based foods like grasses, fruits, and roots.", "Elephants eat grass, tree bark, fruit, and leaves.", "Elephants eat plants.", "Elephants are herbivores, which means they only eat plants.", "Elephants eat grass, tree bark, and roots.", "Elephants eat grass.", "Elephants are herbivores.", "Elephants are herbivores, which means they eat only plants.", "Elephants are herbivorous and can be found in different habitats including savannahs, forests, deserts and marshes.", "Elephants are herbivores, and they spend up to 16 hours a day collecting plant food.", "The African bush elephant is herbivorous and its diet varies according to its habitat.", "The animals eat hay.", "Hay is grass, legumes, or other herbaceous plants that have been cut, dried, and stored for use as animal fodder, particularly for grazing animals such as cattle, horses, goats, and sheep. Hay is also fed to pets such as rabbits and guinea pigs.", "Hay is grass, legumes, or other herbaceous plants that have been cut, dried, and stored for use as animal fodder, particularly for grazing animals such as cattle, horses, goats, and sheep.", "Hay is grass, legumes, or other herbaceous plants that have been cut and dried to be stored for use as animal fodder, particularly for grazing animals such as cattle, horses, goats, and sheep.", "Hay is grass, legumes, or other herbaceous plants that have been cut and dried to be stored for use as animal fodder, particularly for large grazing animals raised as livestock, such as cattle, horses, goats, and sheep.", "Hay is grass, legumes, or other herbaceous plants that have been cut and dried to be stored for use as animal fodder, particularly for large grazing animals raised as livestock such as cattle, horses, goats, and sheep.", "Hay is grass, legumes, or other herbaceous plants that have been cut, dried, and stored for use as animal fodder.", "Horses are herbivores, and have a digestive system very different from that of other animals.", "The animal eats hay.", "The horse (Equus ferus caballus) is one of two extant subspecies of Equus ferus. It is an odd-toed ungulate mammal belonging to the taxonomic family Equidae.", "A horse is an odd-toed ungulate mammal belonging to the taxonomic family Equidae. The horse has evolved over the past 45 to 55 million years from a small multi-toed creature, Eohippus, into the large, single-toed animal of today.", "The donkey or ass (Equus africanus asinus) is a domesticated member of the horse family, Equidae. The wild ancestor of the donkey is the African wild ass, E. africanus."]