["The truck is old.", "The truck is very old.", "The truck is about 50 years old.", "The truck is an old truck.", "The truck is a 1955 Chevrolet pickup truck.", "The truck is a 1940 Ford Pickup.", "An old truck is a truck that is very old.", "The truck is over 50 years old.", "This vehicle is around 50 years old.", "This vehicle is about 50 years old.", "The vehicle is an old one.", "The vehicle is old.", "This vehicle is about 70 years old.", "This vehicle is over 100 years old.", "Vehicles are typically around 30 years old.", "This vehicle is from the year 1953.", "A truck is a motor vehicle designed to transport cargo.", "This is an antique vehicle.", "The vehicle is a 1972 model.", "The pickup truck is a light - duty truck having an enclosed cab and an open cargo area with low sides and tailgate.", "The pickup truck is a light-duty truck having an enclosed cab and an open cargo area with low sides and tailgate.", "A pickup truck is a light duty truck having an enclosed cab and an open cargo area with low sides and tailgate.", "A pickup truck is a light-duty truck having an enclosed cab and an open cargo area with low sides and tailgate.", "The Ford F150 series is the oldest pickup truck model in the United States and is the best selling vehicle in the United States.", "A pickup truck is a light motor vehicle with an open-top rear cargo area (bed) which is most often separated from the passenger compartment.", "A vehicle's age can be determined by the year it was manufactured.", "The first pickup truck was made in 1898.", "A pick-up truck is a light truck with an open-top cargo area.", "Antique cars are over 45 years old.", "A pick-up truck is a light-duty truck having an enclosed cab and an open cargo area with low sides and tailgate.", "A pick-up truck is a light motor vehicle with an open-top rear cargo area (bed) which is most often used for transporting goods and materials.", "The oldest known vehicle is the 1965 Ford Mustang. The oldest known vehicle is the 1965 Ford Mustang.", "The first automobile pickup truck was introduced in 1924, though it was not until the 1930s that they became common.", "The first truck in the United States was built by Autocar in 1899 and was available with optional 5 or 8 horsepower motors.", "The Ford F-Series is a series of light-duty trucks and medium-duty trucks (Class 2-7) that have been marketed and manufactured by Ford Motor Company since 1948.", "1957."]