["The computer is a Dell laptop.", "The brand of computer is Apple.", "The computer is made by Dell.", "Laptop computers are made by many brands.", "The computer is a Dell.", "The computer is a Dell computer.", "Apple is a brand of computer.", "A computer is a programmable machine that receives input, stores and manipulates data, and provides output in a useful format.", "Apple computers are made by Apple.", "The computer is a Lenovo Thinkpad.", "A computer is a device that can be instructed to carry out sequences of arithmetic or logical operations automatically via computer programming. Modern computers have the ability to follow generalized sets of operations, called programs.", "A laptop computer is a personal computer for mobile use. A laptop has most of the same components as a desktop computer, including a display, a keyboard, a pointing device such as a touchpad (also known as a trackpad) and/or a pointing stick, and speakers into a single unit.", "A laptop computer is a personal computer for mobile use. A laptop has most of the same components as a desktop computer, including a display, a keyboard, a pointing device such as a touchpad (also known as a track pad) and/or a pointing stick, and speakers into a single unit.", "A laptop is a personal computer designed for mobile use.", "Apple Inc. is an American multinational technology company headquartered in Cupertino, California, that designs, develops, and sells consumer electronics, computer software, and online services. The company's hardware products include the iPhone smartphone, the iPad tablet computer, the Mac personal computer, the iPod portable media player, the Apple Watch smartwatch, the Apple TV digital media player, and the HomePod smart speaker. Apple's software includes the macOS and iOS operating systems, the iTunes media player, the Safari web browser, and the iLife and iWork creativity and productivity suites, as well as professional applications like Final Cut Pro, Logic Pro, and", "A computer is a programmable electronic device designed to accept data, perform prescribed mathematical and logical operations at high speed, and display the results of these operations.", "An Apple Macintosh is a personal computer designed, developed, and marketed by Apple Inc.", "Apple is an American multinational technology company headquartered in Cupertino, California, that designs, develops, and sells consumer electronics, computer software, and online services.", "Apple Inc. is an American multinational technology company headquartered in Cupertino, California, that designs, develops, and sells consumer electronics, computer software, and online services.", "Apple Inc. is an American multinational technology company headquartered in Cupertino, California that designs, develops, and sells consumer electronics, computer software, and online services.", "A laptop, also called a notebook computer or simply a notebook, is a small, portable personal computer with a \"clamshell\" form factor, having, typically, a thin LCD or LED computer screen mounted on the inside of the upper lid of the \"clamshell\" and an alphanumeric keyboard on the inside of the lower lid.", "The Apple II series (trademarked with square brackets as \"Apple ][\" and rendered on later models as \"Apple //\") is a family of home computers, one of the first highly successful mass-produced microcomputer products, designed primarily by Steve Wozniak, manufactured by Apple Computer (now Apple Inc.) and introduced in 1977 with the original Apple II.", "A computer is a machine that can be instructed to carry out sequences of arithmetic or logical operations automatically via computer programming.", "A computer is a device that can be instructed to carry out sequences of arithmetic or logical operations automatically via computer programming.", "A computer is a programmable machine designed to sequentially and automatically carry out a sequence of arithmetic or logical operations.", "The computer is a machine that can be instructed to carry out sequences of arithmetic or logical operations automatically via computer programming.", "A laptop, also called a notebook computer or simply a notebook, is a small, portable personal computer with a \"clamshell\" form factor, having, typically, a thin LCD or LED computer screen mounted on the inside of the upper lid of the clamshell and an alphanumeric keyboard on the inside of the lower lid.", "Dell computers are very popular in the United States.", "Dell is an American multinational computer technology company based in Round Rock, Texas, United States, that develops, sells, repairs, and supports computers and related products and services.", "Dell is a multinational computer technology company based in Round Rock, Texas, United States, that develops, sells, repairs, and supports computers and related products and services.", "Dell is an American privately owned multinational computer technology company based in Round Rock, Texas, United States, that develops, sells, repairs, and supports computers and related products and services.", "The MacBook Pro is a line of Macintosh portable computers introduced in January 2006 by Apple Inc., and now in its third generation.", "a macbook pro and a dell monitor.", "The first personal computer (PC), the Lincair 8800, was introduced in 1975."]