["Beer is a beverage.", "A beer is an alcoholic beverage.", "The beverage is called beer.", "The drink is called beer.", "The drink is beer.", "Beer is an alcoholic beverage.", "beer is a beverage made by fermenting grains.", "A beer is an alcoholic beverage made by the fermentation of water, malt and hops.", "The beverage in the cup is called beer.", "The beverage in the cup is called a beer.", "A beer is a beverage that is made from barley, hops, and yeast.", "Beer is an alcoholic drink.", "The beverage in the cup is beer.", "The beverage in the cup called is beer.", "The beer is called beer.", "The beverage in the cup called beer.", "A beer is an alcoholic beverage made by the saccharification of starch and fermentation of the resulting sugar.", "A beer is an alcoholic beverage made by the fermentation of sugars derived from starch-based material.", "Beer is an alcoholic beverage made by the fermentation of malted barley and other grains.", "Beer is a beverage containing alcohol, which is made by fermenting malted barley and hops.", "Beer is an alcoholic beverage made from fermented grains, usually barley or wheat. The yeast turns the sugars in the grains into alcohol.", "A beer is a drink made from malt and hops.", "Beer is an alcoholic beverage made by the saccharification of starch and fermentation of the resulting sugar.", "A beer is an alcoholic beverage made by the fermentation of cereal grains, usually malted barley, and flavored with hops.", "A beer is an alcoholic beverage produced by the saccharification of starch and fermentation of the resulting sugar.", "The beverage in the cup is called beer. The beverage in the cup is called beer.", "A beer is an alcoholic beverage made by the fermentation of cereal grains, most commonly malted barley, wheat, and corn.", "Beer is an alcoholic beverage produced by the saccharification of starch and fermentation of the resulting sugar.", "A beer is an alcoholic beverage made by the fermentation of starches, mainly derived from cereal grains.", "A beer is an alcoholic beverage made by the fermentation of cereal grains most commonly malted barley, but wheat, maize (corn), and rice are also used.", "Beer is an alcoholic beverage produced by the saccharification of starch and fermentation of the resulting sugar. The starch and saccharification enzymes are often derived from malted cereal grains, most commonly malted barley and malted wheat.", "A glass of beer", "Beer is one of the oldest and most widely consumed alcoholic drinks in the world, and the third most popular drink overall after water and tea.", "beer", "A beverage is a drinkable liquid.", "A drink is a liquid intended for human consumption.", "A beverage is a liquid intended for human consumption. In addition to their basic function of satisfying thirst, drinks play important roles in human culture."]