["The rope is used to tie the chain.", "The rope is used to form a barrier.", "The rope is a chain to keep people out of the area.", "Rope is used to tie things up.", "The rope is used to protect the bears from people.", "The rope is used for safety.", "The rope is here to keep people from going somewhere.", "The rope is to make sure the bear does not escape.", "The rope is here to keep people away from the bears.", "The rope is to prevent people from entering.", "The rope is there to keep people away from the bear.", "Ropes are used to tie and secure things.", "The rope is used to hold the bear.", "The rope is used to tie the bear.", "The rope is used to tie up the animals.", "The rope is used to block off the area.", "Ropes are used for tying and fastening.", "The rope is used to restrain the bear.", "Rope is a chain of yarn, plaited or braided, used for fastening, binding, or connecting.", "Rope, or cords, are of paramount importance in fields as diverse as construction, seafaring, exploration, sports, theatre, and communications, and has been widely used since prehistoric times.", "A rope is a group of yarns, plies, fibers or strands that are twisted or braided together into a larger and stronger form. Ropes have tensile strength and so can be used for dragging and lifting.", "The rope is to keep people away from the statue.", "The rope is a flexible and strong material made from strands of natural or synthetic fibers twisted together.", "The rope is used to control the bear.", "The rope is used to keep people from getting too close to the statue.", "Ropes are used to mark boundaries, such as the finishing line of a race, or to mark the position of a hazard on a golf course.", "The rope is here to keep people from getting too close to the statue.", "The rope is here to keep the people away from the statue.", "A rope is a group of yarns, plies, fibers or strands that are twisted or braided together into a larger and stronger form.", "A rope is a group of yarns, plies, fiber or strands that are twisted or braided together into a larger and stronger form.", "Rope is a group of yarns, plies, fibers or strands that are twisted or braided together into a larger and stronger form.", "Rope is a length of fibres, twisted or braided together to improve strength for pulling and connecting. It has tensile strength but is too flexible to provide compressive strength (i.e., it can be used for pulling, but not pushing). Rope is thicker and stronger than similarly constructed cord, line, string, and twine.", "The rope is here to protect the statue.", "The chain is to keep people away from the bear.", "A chain is a serial assembly of connected pieces, called links, typically made of metal, with an overall character similar to that of a rope in that it is flexible and curved in compression but linear, rigid, and load-bearing in tension.", "A chain is a series of connected links which are typically made of metal. A chain may consist of two or more links.", "A chain is typically made of metal. A chain may consist of two or more links.", "The chain is to decorate the statue.", "A barrier is a thing which prevents movement or access across a boundary."]