["The girl on the right is wearing a floral pattern, which is a pattern that consists of flowers.", "The clothing of the girl on the right is a floral pattern.", "The girl on the right has a floral pattern on her clothing.", "The girl on the right is wearing a floral pattern.", "The girl on the right has a floral pattern on her dress.", "The girl on the right has a pattern of flowers on her clothes.", "The design is floral.", "A floral design is a patterned or natural motif, usually associated with textiles, which consists of flowers, leaves, stems and other plant elements.", "The pattern is floral.", "The dress with floral design.", "She is wearing a floral dress.", "The girl on the right is wearing a floral design.", "A floral pattern is a pattern with flower designs.", "Floral patterns are a common element of clothing design. Floral patterns are often used in dresses and skirts.", "The girl on the right is wearing floral patterned clothing.", "Floral pattern is a pattern of flowers.", "Floral patterns are patterns with flowers.", "This is a floral print.", "The girl on the right has a floral design on her shirt.", "Floral is a pattern consisting of repeating flower, leaf, and stem designs.", "Floral patterns are a common choice of design for textiles, wallpaper and other decorative media.", "Floral patterns are often used in clothing.", "Floral is a pattern or design of flowers.", "The girl on the right has a floral dress.", "The girl is wearing a floral dress.", "The girl on the left is wearing a floral patterned dress.", "The girl on the right is wearing a floral patterned dress.", "Floral pattern is a pattern consisting of repeated natural motifs, such as flowers, leaves, and stems.", "The girl on the right is wearing a floral dress.", "The girl on the left is wearing a floral dress.", "Floral prints are a common design for clothing.", "floral", "The woman on the right is wearing a floral patterned dress.", "Floral means related to flowers.", "The women on the right is wearing a floral dress.", "The woman on the right is wearing a patterned dress.", "A pattern is a regularity in the world, in human-made design, or in abstract ideas. As such, the elements of a pattern repeat in a predictable manner. A geometric pattern is a kind of pattern formed of geometric shapes and typically repeated like a wallpaper design.", "A pattern is a regularity in the world, in human-made design, or in abstract ideas. As such, the elements of a pattern repeat in a predictable manner.", "A pattern is a regularity in the world, in human-made design, or in abstract ideas.", "A design is a plan or specification for the construction of an object or system or for the implementation of an activity or process, or the result of that plan or specification in the form of a prototype, product or process."]