["The land is prone to floods.", "The area is prone to flood.", "The area is prone to floods.", "The area is prone to floods and earthquakes.", "Floods are a natural disaster that is common in some areas.", "The land is prone to flooding.", "Flooding is a natural disaster that occurs when water covers land that is usually dry.", "Floods are a natural disaster that can be caused by heavy rains, storms, or tsunamis.", "Floods are an overflow of water that submerges land that is usually dry.", "The area is prone to flooding.", "The land is prone to flooding and erosion.", "Tsunamis are a natural disaster that the land is prone to.", "A flood is an overflow of water that submerges land that is usually dry.", "A flood is an overflow of water that submerges land which is usually dry.", "Floods are an area of study of the discipline hydrology and are of significant concern in agriculture, civil engineering and public health.", "Floods are an area of study of the discipline hydrology and are of significant concern in agriculture, civil engineering and public health. Flooding may occur as an overflow of water from water bodies, such as a river, lake, or ocean, in which the water overtops or breaks levees, resulting in some of that water escaping its usual boundaries, or it may occur due to an accumulation of rainwater on saturated ground in an areal flood. While the size of a lake or other body of water will vary with seasonal changes in precipitation and snow melt, these changes in size are unlikely to be considered significant unless they flood", "flood", "A flood is an overflow of an expanse of water that submerges land.", "Flooding occurs when an area of land, usually low-lying, is covered with water.", "The land is prone to earthquakes.", "This is a picture of a flood.", "The area is prone to earthquakes and volcanic eruptions.", "Floods are the most common and widespread of all weather-related natural disasters.", "The area is prone to earthquakes, including the 2004 Indian Ocean earthquake, which led to a tsunami that killed thousands of people.", "The area is prone to earthquakes.", "The birds are in the water because of a flood.", "Earthquakes are a natural disaster that can cause a lot of damage.", "The most common natural disasters are avalanches, earthquakes, volcanic eruptions, floods, tsunamis, blizzards, droughts, hailstorms, lightning strikes, tornadoes, hurricanes, cyclones, and wildfires.", "The birds are in a floodplain.", "The birds are standing in water because it is a flood.", "Earthquakes and tsunamis pose a threat to the city.", "A natural disaster is a major adverse event resulting from natural processes of the Earth; examples include floods, hurricanes, tornadoes, volcanic eruptions, earthquakes, tsunamis, and other geologic processes.", "Earthquakes are caused by tectonic plates shifting.", "Tsunamis, or tidal waves, are caused by sudden movements of the ocean floor."]