["The tennis court surface is usually made of clay.", "The surface of a tennis court is usually made of clay, hard or grass.", "The surface of a tennis court is composed of a mixture of sand and clay.", "Clay court tennis is a variety of tennis played on a tennis court that is composed of crushed stone, shell, or shale.", "The tennis court surface is a red clay.", "The surface of tennis court is red clay.", "Clay court is a tennis court that has a playing surface made of crushed stone, brick, shale, or other unbound mineral aggregate.", "A clay court is one of many different types of tennis court. Clay courts are made of crushed shale, stone or brick. The French Open uses clay courts, making it unique among the Grand Slam tournaments.", "Clay court is one of the four different types of tennis court. The others are grass, hard and carpet court.", "The tennis court is made of red clay.", "The tennis player is playing on a red clay court.", "Clay courts slow down the ball and produce a high bounce in comparison to grass courts or hard courts. For this reason, the clay court takes away many of the advantages of big servers and serve-and-volleyers, which makes it hard for these types of players to dominate on the surface.", "Red clay is a type of clay court.", "This person is playing on a red clay court.", "A tennis court is the venue where the sport of tennis is played. It is a firm rectangular surface with a low net stretched across the center. The same surface can be used to play both doubles and singles matches.", "A tennis court is the venue where the sport of tennis is played. It is a firm rectangular surface with a low net stretched across the centre. The same surface can be used to play both doubles and singles matches.", "The clay court is made of crushed shale, stone or brick. The French Open is played on red clay courts at Stade Roland Garros.", "A tennis court is the venue where the sport of tennis is played. It is a firm rectangular surface with a low net stretched across the center.", "The court surface may be grass, hard court, clay or carpet.", "The person is playing on a red clay court.", "The surface of a tennis court is composed of the outer layers of the tennis court.", "A tennis court is the venue where the sport of tennis is played.", "The clay court is made of crushed shale, stone or brick.", "Tennis is played on a variety of surfaces and each surface has its own characteristics which affect the playing style of the game.", "Clay courts slow down the ball and produce a high bounce when compared to grass courts or hard courts.", "Clay courts slow down the ball and produce a high bounce in comparison to grass courts or hard courts.", "Tennis is a racket sport that can be played individually against a single opponent or between two teams of two players each.", "The surface is red clay.", "Tennis is a racket sport that can be played individually against a single opponent (singles) or between two teams of two players each (doubles).", "The surface is clay."]