["Airline companies are companies that manage flights.", "The airline company is the city air.", "Airline companies are companies that operate aircraft for the purpose of transporting people or cargo.", "The airline company is CityAir.", "American Airlines is a major airline based in the United States.", "American Airlines is a major United States airline.", "American Airlines is a major airline of the United States.", "The airline company is Air Canada.", "Airline companies are companies that operate aircraft, usually with the intention of transporting passengers and cargo.", "An airline is a company that provides air transport services for traveling passengers and freight. Airlines utilize aircraft to supply these services and may form partnerships or alliances with other airlines for codeshare agreements.", "Airlines is a common carrier that provides air transport services for traveling passengers and freight.", "American Airlines is the world's largest airline when measured by fleet size, revenue, scheduled passengers carried, scheduled passenger-kilometers flown, and a number of destinations served.", "American Airlines is a major United States airline headquartered in Fort Worth, Texas, within the Dallas-Fort Worth metroplex. It is the world's largest airline when measured by fleet size, revenue, scheduled passengers carried, scheduled passenger-kilometers flown, and a number of destinations served.", "American Airlines, Inc., commonly referred to as American, is a major American airline headquartered in Fort Worth, Texas, within the Dallas-Fort Worth metroplex. It is the world's largest airline when measured by fleet size, revenue, scheduled passengers carried, scheduled passenger-kilometers flown, and number of destinations served.", "City Air is an airline based in the United Kingdom.", "Airline companies are companies that provide air transport services for traveling passengers and freight. Airlines utilize aircraft to supply these services and may form partnerships or alliances with other airlines for codeshare agreements.", "Air Canada is the flag carrier and the largest airline of Canada by fleet size and passengers carried. The airline, founded in 1936, provides scheduled and charter air transport for passengers and cargo to 207 destinations worldwide. It is a founding member of the Star Alliance.", "Airline companies that manage the flight are Delta Air Lines, American Airlines, United Airlines, Air France, and Lufthansa.", "American Airlines is a major United States airline. It operates an extensive international and domestic network.", "American Airlines, Inc. is a major United States airline headquartered in Fort Worth, Texas, within the Dallas–Fort Worth metroplex.", "Air Canada is the flag carrier and the largest airline of Canada by fleet size and passengers carried.", "Air Canada is the flag carrier and largest airline of Canada by fleet size and passengers carried.", "British Airways is the largest airline in the United Kingdom based on fleet size, international flights and international destinations.", "American Airlines, Inc. is a major United States airline headquartered in Fort Worth, Texas, within the Dallas-Fort Worth metroplex.", "The airline company that manages the pictures flight is American Airlines.", "Airline companies: American Airlines, Delta Air Lines, Southwest Airlines, United Airlines, US Airways, Alaska Airlines, Allegiant Air, Frontier Airlines, Hawaiian Airlines, JetBlue Airways, Spirit Airlines, Virgin America", "Air Canada is the flag carrier and the largest airline of Canada by fleet size and passengers carried. The airline, founded in 1937, provides scheduled and charter air transport for passengers and cargo to 207 destinations worldwide.", "The airline company that manages the pictures flight is \"City Air\".", "American Airlines is a major United States airline headquartered in Fort Worth, Texas, within the Dallas-Fort Worth metroplex.", "Air Canada is the flag carrier and largest airline of Canada.", "Airlines use different types of aircrafts to fly passengers from one place to another.", "The airline company that manages the pictures flight is British Airways.", "City Airline is a Swedish airline based in Stockholm, Sweden. It is a regional airline operating scheduled services as well as charter flights.", "City Airline is an airline based in Gothenburg, Sweden.", "The company is called Air Canada.", "City Airline is a Swedish airline headquartered in Gothenburg.", "City Airline AB is a Swedish airline based in Gothenburg.", "City Airline is a Swedish airline based at Stockholm-Bromma Airport.", "The airline industry is a major economic force, with total revenues of $737 billion in 2018.", "Air France is the French flag carrier headquartered in Tremblay-en-France.", "Air France is the French flag carrier headquartered in Tremblay-en-France, France, near Paris."]