["The light source is a street lamp.", "The light source is from a street lamp.", "The light source is the street lamp.", "The light source is a lamp.", "The light source is a street light.", "The light source is the lamp.", "The light source is an electric lamp.", "The light source is a light bulb.", "The light source is an incandescent lamp.", "A street light, light pole, lamppost, street lamp, light standard, or lamp standard is a raised source of light on the edge of a road or walkway, which is turned on or lit at a certain time every night.", "A street lamp, light pole, lamppost, street light, light standard, or lamp standard is a raised source of light on the edge of a road or walkway, which is turned on or lit at a certain time every night.", "A street light, light pole, lamppost, street lamp, light standard or lamp standard is a raised source of light on the edge of a road or walkway, which is turned on or lit at a certain time every night.", "A street light, light pole, lamppost, street lamp, light standard, or lamp standard is a raised source of light on the edge of a road or walkway.", "A street light, light pole, lamppost, street lamp, light standard, or lamp standard is a raised source of light on the edge of a road or path.", "The traditional streetlight is a light fixture that is attached to a pole or pole.", "A street light, light pole, lamppost, street lamp, light standard or lamp standard is a raised source of light on the edge of a road or path.", "A street light, light pole, lamp post, street lamp, light standard, or lamp standard is a raised source of light on the edge of a road or path.", "The light source is an incandescent bulb.", "A light source is an object that emits light.", "The street lamp, also known as a street light, is a lamp designed to illuminate a road or path to make travel easier and safer.", "Light sources include the sun, incandescent lamps, fluorescent lamps, and light-emitting diodes (LEDs).", "Street lamps are often used to light the streets of a city.", "Light sources include light-emitting diodes (LEDs), incandescent bulbs and fluorescent tubes, and other sources such as sodium vapor lamps, metal halide lamps and mercury vapor lamps.", "The light source is the sun.", "The light source is the Sun.", "Light sources include the sun, incandescent light bulbs, fluorescent bulbs, and neon signs.", "Street lights are lights shining on a road or path at night, typically using electricity.", "A light bulb is a device that produces light from electricity.", "An electric light is a device that produces visible light from electric current."]