["Television is available on Amazon.", "A television (also known as a TV) is a machine with a screen. Televisions receive broadcasting signals and turn them into pictures and sound.", "TVs are available from many sources, including department, electronics, and big-box stores.", "You can buy TVs from Amazon, eBay, Walmart, Best Buy, and other retailers.", "A TV is a flat panel display used for entertainment.", "You can buy a TV on Amazon.", "Television (TV) is a telecommunication medium used for transmitting moving images in monochrome (black and white), or in color, and in two or three dimensions and sound.", "Television (TV) is a telecommunication medium used for transmitting moving images in monochrome (black and white), or in colour, and in two or three dimensions and sound.", "You can buy a tv on amazon.com", "You can buy a tv on amazon.com.", "The internet is a global system of interconnected computer networks that use the Internet protocol suite (TCP/IP) to link devices worldwide. It is a network of networks that consists of private, public, academic, business, and government networks of local to global scope, linked by a broad array of electronic, wireless, and optical networking technologies. The Internet carries a vast range of information resources and services, such as the inter-linked hypertext documents and applications of the World Wide Web (WWW), electronic mail, telephony, and file sharing.", "You can buy a TV online.", "TV is a telecommunication medium used for transmitting moving images in monochrome or color, and in two or three dimensions and sound.", "TVs can be purchased on the internet at Walmart.com, Amazon.com, and BestBuy.com.", "The internet is a global system of interconnected computer networks that use the Internet protocol suite (TCP/IP) to link devices worldwide.", "There are many places to buy a tv online.", "The Internet is the global system of interconnected computer networks that use the Internet protocol suite (TCP/IP) to link devices worldwide.", "You can buy a TV on the internet.", "The Internet is a global system of interconnected computer networks that use the standard Internet protocol suite (TCP/IP) to serve billions of users worldwide. It is a network of networks that consists of millions of private, public, academic, business, and government networks, of local to global scope, that are linked by a broad array of electronic, wireless and optical networking technologies.", "The television is available on Amazon.com.", "You can buy a TV like that on the internet at Amazon.", "You can buy a tv like that on the internet at Amazon.com.", "Television (TV), sometimes shortened to tele or telly, is a telecommunication medium used for transmitting moving images in monochrome (black and white), or in colour, and in two or three dimensions and sound.", "Television (TV), sometimes shortened to tele or telly, is a telecommunication medium used for transmitting moving images in monochrome (black and white), or in color, and in two or three dimensions and sound.", "A television set, also called a television receiver, television, TV set, TV, or \"telly\", is a device that combines a tuner, display, and loudspeakers for the purpose of viewing television.", "Amazon.com, Inc., doing business as Amazon, is an American electronic commerce and cloud computing company based in Seattle, Washington that was founded by Jeff Bezos on July 5, 1994. The tech giant is the largest Internet-based retailer in the world by total sales and market capitalization.", "Amazon.com is an American electronic commerce and cloud computing company based in Seattle, Washington that was founded by Jeff Bezos on July 5, 1994.", "Amazon is an online retailer.", "Amazon.com is an American electronic commerce and cloud computing company with headquarters in Seattle, Washington.", "Amazon.com, Inc. is an American multinational technology company based in Seattle, Washington, that focuses on e-commerce, cloud computing, digital streaming, and artificial intelligence. It is considered one of the Big Four technology companies along with Google, Apple, and Facebook.", "Amazon.com is an online store.", "A television set, also called a television receiver, television, TV set, TV, or telly, is a device that combines a tuner, display, and loudspeakers for the purpose of viewing television.", "Television, sometimes shortened to tele or telly, is a telecommunication medium used for transmitting moving images in monochrome (black and white), or in color, and in two or three dimensions and sound.", "Amazon is an American electronic commerce and cloud computing company based in Seattle, Washington that was founded by Jeff Bezos on July 5, 1994. The tech giant is the largest Internet retailer in the world as measured by revenue and market capitalization, and second largest after Alibaba Group in terms of total sales.", "Amazon is an American electronic commerce and cloud computing company based in Seattle, Washington that was founded by Jeff Bezos on July 5, 1994.", "Amazon is an American electronic commerce and cloud computing company based in Seattle, Washington, that was founded by Jeff Bezos on July 5, 1994.", "Amazon is the largest Internet-based retailer in the United States.", "A television set or television receiver, more commonly called a television, TV, TV set, or telly, is a device that combines a tuner, display, and loudspeakers for the purpose of viewing television.", "A television set, more commonly called a television, TV, TV set, telly, or tele, is a device that combines a tuner, display, and loudspeakers for the purpose of viewing television.", "The TV is a Sony Trinitron.", "The World Wide Web (WWW), commonly known as the Web, is an information space where documents and other web resources are identified by Uniform Resource Locators (URLs), interlinked by hypertext links, and accessible via the Internet.", "The TV is a Samsung Smart TV.", "TVs are available in different sizes, ranging from 13 inches to more than 100 inches."]