["The company that manufactures motorcycles.", "The motorcycle was made by Honda.", "The Honda Motor Company makes scooters.", "The company is Honda.", "The company which made this vehicle is Suzuki.", "The Honda Motor Company, Ltd. is a Japanese public multinational conglomerate corporation primarily known as a manufacturer of automobiles, aircraft, motorcycles, and power equipment.", "The company that made this vehicle is called Piaggio.", "Honda Motor Company, Ltd. is a Japanese public multinational corporation primarily known as a manufacturer of automobiles and motorcycles.", "The Vespa is a brand of scooter manufactured by Piaggio.", "The Vespa is an Italian brand of scooter manufactured by Piaggio.", "Honda Motor Company, Ltd. is a Japanese public multinational conglomerate corporation primarily known as a manufacturer of automobiles, aircraft, motorcycles, and power equipment.", "The company that made this vehicle is Vespa.", "Yamaha Motor Company Limited is a Japanese manufacturer of motorcycles, marine products such as boats and outboard motors, and other motorized products.", "The company that made this vehicle is Yamaha.", "The company that made this vehicle is Honda.", "The Piaggio Group is an Italian motor vehicle manufacturer, which produces a range of two-wheeled motor vehicles and compact commercial vehicles under seven brands: Piaggio, Vespa, Gilera, Aprilia, Moto Guzzi, Derbi, and Scarabeo.", "Motorcycle manufacturers are generally structured around brands or marques owned by companies.", "Piaggio Group is an Italian motor vehicle manufacturer, which produces a range of two-wheeled motor vehicles and compact commercial vehicles under seven brands: Piaggio, Vespa, Gilera, Aprilia, Moto Guzzi, Derbi, and Scarabeo.", "Honda is a Japanese public multinational conglomerate corporation primarily known as a manufacturer of automobiles, aircraft, motorcycles, and power equipment.", "The Vespa is an Italian brand of scooter manufactured by Piaggio. The name means wasp in Italian. The Vespa has evolved from a single model motor scooter manufactured in 1946 by Piaggio & Co. S.p.A. of Pontedera, Italy to a full line of scooters and one of seven companies today owned by Piaggio.", "Vespa is an Italian brand of scooter manufactured by Piaggio. The name means wasp in Italian. The Vespa has evolved from a single model motor scooter manufactured in 1946 by Piaggio & Co. S.p.A. of Pontedera, Italy to a full line of scooters and one of seven companies today owned by Piaggio.", "A motorcycle, often called a bike, motorbike, or cycle, is a two- or three-wheeled motor vehicle.", "The Honda Super Cub or Honda Cub is a Honda underbone motorcycle with a four stroke single cylinder engine ranging in displacement from 49 to 124 cc.", "The Honda Super Cub or Honda Cub is a Honda underbone motorcycle with a four stroke single cylinder engine ranging in displacement from 49 to 124 cc (3.0 to 7.6 cu in).", "A motorcycle, often called a bike, motorbike, or cycle, is a two- or three-wheeled motor vehicle. Motorcycle design varies greatly to suit a range of different purposes: long distance travel, commuting, cruising, sport including racing, and off-road riding.", "The company is called \"piaggio\".", "A motorcycle is a two or three wheeled motor vehicle.", "Kawasaki Heavy Industries Motorcycle & Engine is the motorcycle and engine manufacturing division of Kawasaki Heavy Industries, a Japanese company.", "The company is Piaggio.", "The Piaggio Group is an Italian motor vehicle manufacturer, which produces a range of two-wheeled motor vehicles and compact commercial vehicles under seven brands.", "Kawasaki Heavy Industries Motorcycle & Engine is a division of Kawasaki Heavy Industries that produces motorcycles, ATVs, utility vehicles, jet ski personal watercraft and general-purpose gasoline engines.", "The company is called Vespa.", "The company was founded in Milan, Italy in 1946 by Enrico Piaggio, initially producing aircraft parts.", "In 2006, Piaggio USA introduced the Vespa LX 50, a four-stroke 50 cc scooter with a four-speed transmission.", "There are many different companies that make vehicles.", "The company is Vespa.", "Mopeds are manufactured by companies such as Honda, Yamaha, and Suzuki.", "A moped, also called a motor scooter, is a type of small motorcycle with bicycle pedals, generally having a less stringent licensing requirement than full motorcycles or automobiles.", "A moped is a small motorcycle.", "The company KTM made the vehicle.", "A moped is a type of small motorcycle with bicycle pedals, generally having a less stringent licensing requirement than full motorcycles or automobiles.", "The company was founded in 1895."]