["The schnauzer is a German breed of dog.", "Schnauzer is a dog breed type.", "Schnauzer is a German breed of dog.", "The Schnauzer is a German breed of dog, part of the larger Schnauzer type.", "The dog is a Schnauzer.", "The dog is a schnauzer.", "A schnauzer is a dog breed that originated in Germany from the 14th to 16th centuries.", "A schnauzer is a German dog breed.", "A schnauzer is a dog breed type that originated in Germany from the 14th to 16th centuries.", "A schnauzer is a dog breed that originated in Germany in the 15th and 16th centuries.", "A schnauzer is a dog breed type that originated in Germany in the 15th and 16th centuries.", "The Schnauzer is a German breed of dog, originating in Germany in the 15th and 16th centuries.", "A schnauzer is a dog breed that originated in Germany.", "The schnauzer is a dog breed type that originated in Germany from the 14th to 16th centuries.", "The schnauzer is a dog breed that originated in Germany. The word schnauzer literally means \"snout\" in German, and the schnauzer is known for its distinctive \"schnauze\", or muzzle.", "Schnauzer is a German breed of dog, originating in Germany in the 14th and 15th centuries. The term comes from the German word for \"snout\" and means colloquially \"moustache\", or \"whiskered snout\", because of the dog's distinctively bearded snout.", "The schnauzer is a dog breed type that originated in Germany in the 15th and 16th centuries.", "Schnauzer is a dog breed that originated in Germany in the 15th and 16th centuries.", "Schnauzer is a dog breed that originated in Germany from the 14th to 16th centuries. The term comes from the German word for \"snout\" and means colloquially \"moustache\", or \"whiskered snout\", because of the dog's distinctively bearded snout.", "The schnauzer is a dog breed type that originated in Germany from at least 14th-century, traditionally used as a guard dog.", "The schnauzer is a dog breed type that originated in Germany in the 15th and 16th centuries. The term comes from the German word for \"snout\" and means colloquially \"moustache\", or \"whiskered snout\", because of the dog's distinctively bearded snout.", "The schnauzer is a dog breed type that originated in Germany from the 14th to 16th centuries. The term comes from the German word for \"snout\" and means colloquially \"moustache\", or \"whiskered snout\", because of the dog's distinctively bearded snout.", "A schnauzer is a type of dog.", "Schnauzer is a German word meaning \"snouter\" and is a dog breed that originated in Germany from the 14th to 16th centuries.", "The Schnauzer is a German breed of dog, part of the wider terrier group. The term comes from the German word for \"snout\" and means colloquially \"moustache\", or \"whiskered snout\", because of the dog's distinctively bearded snout.", "A schnauzer is a German breed of dog, including the miniature, standard, and giant schnauzer.", "This is a schnauzer dog.", "The Schnauzer is a German breed of dog, belonging to the Pinscher family. The term comes from the German word for \"snout\" and means colloquially \"moustache\", or \"whiskered snout\", because of the dog's distinctively bearded snout.", "Schnauzer is a German word meaning \"snout\" and means one of the three breeds of dog: the Standard Schnauzer, the Giant Schnauzer, and the Miniature Schnauzer.", "The black and white dog is a schnauzer.", "Schnauzer is a German word meaning \"snouter\" and is a dog breed. The term comes from the German word for \"snout\" and means colloquially \"moustache\", or \"whiskered snout\".", "Schnauzer is a German word meaning snout.", "The Miniature Schnauzer is a breed of small dog of the Schnauzer type that originated in Germany in the mid-to-late 19th century.", "Schnauzers are a dog breed of medium to large size.", "Schnauzer is a German word meaning \"snouter\" from the German word \"schnauze\" meaning snout.", "This is a schnauzer.", "Schnauzer is a German word meaning \"snouter\" from the adjective schnauze meaning \"snout\" and the noun -er, used to form an agent noun.", "A dog is a mammal. The most common dog breed is the German Shepherd.", "Black and white dog is a breed of dog.", "Dog breeds are groups of closely related and visibly similar domestic dogs, which are all of the subspecies Canis lupus familiaris, having characteristic traits that are selected and maintained by humans, bred from a known foundation stock.", "Dogs have different types of fur.", "A dog is a mammal, a member of the Canidae family of the order Carnivora. The term is used for domestic dogs, related to wolves, foxes and jackals.", "A dog is a mammal that is related to wolves, foxes and coyotes.", "A dog is a man's best friend."]