["Appliances are often left in the parking lot to be discarded or recycled.", "The appliances are being discarded.", "The appliances are being thrown away because they are broken.", "The appliances are being thrown away.", "These appliances are being discarded.", "The appliances are broken and being disposed of.", "People discard their old appliances to buy new ones.", "The appliances are broken and are being disposed of.", "The parking lot is a place where people can leave broken appliances.", "The appliances are broken and need to be thrown away.", "The appliances are being recycled.", "Discarded appliances are sometimes called \"white goods\".", "The appliances are being stored in the parking lot for a garage sale.", "The reason for piling these appliances up in the parking lot is for recycling.", "The appliances are abandoned.", "The reason for piling these appliances up in the parking lot is because they are broken.", "Appliances are large machines that are used to perform tasks.", "The appliances are broken.", "The parking lot is located behind a restaurant, and is used to store old, broken appliances.", "The appliances are broken and are no longer usable.", "Appliances are electrical/mechanical machines which accomplish some household functions, such as cooking or cleaning.", "The most common reason is to collect discarded appliances and materials that can be recycled.", "Appliance recycling is the process of dismantling waste home appliances and scrapping their parts for reuse. Recycling appliances for their original or other purposes, involves disassembly, removal of hazardous components and destruction of the end-of-life equipment to recover materials, generally by shredding, sorting and grading.", "The reason for piling these appliances up in the parking lot is to get rid of them.", "The reason for piling these appliances up in the parking lot is that they are going to be sent to the dump.", "The reason for piling these appliances up in the parking lot is to prevent them from being stolen.", "A parking lot is an area where vehicles are parked.", "The parking lot is a place where a car is parked.", "The appliances are being sold at a garage sale.", "The parking lot (American English) or car park (British English), also known as a car lot, is a cleared area that is intended for parking vehicles.", "A parking lot (American English) or car park (British English), also known as a car lot, is a cleared area that is intended for parking vehicles.", "The parking lot of the school is where the students park their cars.", "The term appliance is also used for units composed of multiple parts which fit together to accomplish a particular task, like a microwave oven, which is called a kitchen appliance.", "Electronic waste or e-waste describes discarded electrical or electronic devices.", "The term \"white goods\" or \"white goods appliance\" is used in the United States, parts of Europe, and in the Middle East to refer to household mechanical appliances, as contrasted to \"brown goods\" which refers to consumer electronics.", "Trash, also known as garbage, refuse, rubbish, or junk, is unwanted or discarded materials.", "Many cities provide free or low-cost drop-off locations for appliances, electronics and other types of waste."]