["Pizza is a traditional Italian dish consisting of a yeasted flatbread typically topped with tomato sauce and cheese and baked in an oven. It can also be topped with additional vegetables, meats, and condiments, and can be made without cheese.", "Pizza is a type of dish that uses cheese.", "Pizza is a type of food typically made with an oven-baked, flat, generally round bread that is often covered with tomatoes or a tomato-based sauce and mozzarella cheese.", "Pizza is a dish of Italian origin, consisting of a flat round base of dough baked with a topping of tomato sauce and cheese, typically with added meat or vegetables.", "Pizza is a traditional Italian dish consisting of a yeasted flatbread typically topped with tomato sauce and cheese and baked in an oven.", "Pizza is a yeasted flatbread typically topped with tomato sauce and cheese and baked in an oven. It is commonly topped with a selection of meats, vegetables and condiments. The term was first recorded in the 10th century, in a Latin manuscript from Gaeta in Central Italy.", "The dish is a pizza.", "Pizza is a dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients baked at a high temperature.", "A pizza is a traditional Italian dish consisting of a yeasted flatbread typically topped with tomato sauce and cheese and baked in an oven.", "The pizza is called a cheese pizza.", "A pizza is a dish of Italian origin, consisting of a flat, round base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients (anchovies, olives, meat, etc.) baked at a high temperature, traditionally in a wood-fired oven.", "Pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients baked at a high temperature, traditionally in a wood-fired oven.", "Pizza is a dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and often various other ingredients.", "Pizza is a dish of Italian origin, consisting of a flat, round base of dough baked with a topping of tomato sauce and cheese, with optional meat and vegetables.", "Pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients.", "cheese pizza is a style of pizza made with cheese and typically tomato sauce.", "Pizza is a savory dish of Italian origin consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients (anchovies, olives, meat, etc.) baked at a high temperature, traditionally in a wood-fired oven.", "Pizza is a type of food that is usually circular, with a flattened base of dough that is usually topped with tomatoes or a tomato-based sauce and cheese.", "Pizza uses a lot of cheese.", "Pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients (anchovies, olives, meat, etc.) baked at a high temperature, traditionally in a wood-fired oven.", "Pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes.", "A pizza is a round, open pie made with yeast dough and topped with tomatoes, cheese, and various other ingredients.", "A cheese pizza is a pizza that is covered with cheese.", "Pizza uses this much cheese.", "Cheese pizza uses a lot of cheese.", "A pizza is a round, open pie made with yeast dough and topped with tomatoes, cheese, and various other ingredients baked at a high temperature, traditionally in a wood-fired oven.", "Cheese is a dairy food. It is made by curdling milk. Cheese is commonly added to pizza.", "A pizza is a round, open pie made with yeast dough and topped with tomatoes, cheese, and various other ingredients (anchovies, olives, meat, etc.), which is then baked at a high temperature, traditionally in a wood-fired oven.", "A pizza is a round, open pie made with yeast dough and topped with tomato sauce, cheese, and various toppings.", "Cheese is used in pizza, quiche, and other dishes.", "pizza", "Cheese is used in many types of dishes, including pizza, quiche, and macaroni and cheese.", "Cheese is used in a variety of dishes, such as pizza, cheeseburgers, cheese sandwiches, cheese toasties, grilled cheese, cheese souffles, and grilled cheese sandwiches.", "A dish is a container for holding food.", "A dish is a broad term used to refer to many different types of food.", "Cheese is a dairy product derived from milk that is produced in a wide range of flavors, textures, and forms by coagulation of the milk protein casein. It comprises proteins and fat from milk, usually the milk of cows, buffalo, goats, or sheep.", "A quiche is a savoury, open-faced pastry crust with a filling of savoury custard with one or more of cheese, meat, seafood and vegetables."]