["The temperature is how hot or cold something is.", "The temperature is cold.", "The temperature is usually cold.", "The temperature is the measure of hot or cold.", "The temperature is the degree of hotness or coldness of a body or environment.", "The outside temperature is the temperature of the air outside.", "The temperature is around -10 degrees Celsius.", "The temperature is about 15 degrees Celsius.", "The outside temperature is around 30 degree.", "The temperature outside is -10 degrees Celsius.", "The temperature is above freezing.", "The temperature is around 30 degrees.", "It is very cold outside.", "The temperature is 20 degrees.", "the temperature is about 20 degrees fahrenheit.", "It is cold.", "It is cold outside.", "the temperature is freezing", "The outside temperature is 15 degrees Celsius.", "The temperature is below freezing.", "The temperature is usually between 30 and 40 degrees Fahrenheit.", "The temperature is a measure of the warmth or coldness of an object or substance with reference to a standard value.", "Snowboarding is a winter sport that involves descending a slope that is covered with snow while standing on a snowboard attached to a rider's feet, using a special boot set onto a mounted binding.", "Snowboarding is a recreational activity and Winter Olympic and Paralympic sport that involves descending a snow-covered slope while standing on a snowboard attached to a rider's feet.", "It is a sunny day and the temperature is about 30 degrees.", "A snowboard is a board that is usually the width of one's foot longways, with the ability to glide on snow.", "The average temperature in the winter is -14 degrees Fahrenheit.", "The outside temperature is in the mid-30s.", "In the winter, the average temperature is between minus 5 and minus 20 degrees Celsius.", "Snowboarders use a snowboard, which is usually about the size of a wakeboard, with bindings mounted to it.", "Temperature is a physical quantity expressing hot and cold. It is measured with a thermometer calibrated in degrees Celsius (°C) or Fahrenheit (°F).", "Temperature is a measure of the warmth or coldness of an object or substance with reference to a standard value.", "The temperature is a measure of the thermal energy of a system.", "Temperature is a physical quantity expressing hot and cold.", "The temperature is a physical property of a system that underlies the common notions of hot and cold; something that is hotter generally has the greater temperature.", "The temperature of the air is the degree of hotness or coldness of the air.", "It is not hot in the winter.", "The temperature of a system is a measure of the average kinetic energy of the particles of the system.", "In meteorology, the temperature of the air is a measure of the kinetic energy of the gas molecules in the air.", "Water freezes at 0 degrees Celsius.", "The temperature at which water freezes is 0 degrees Celsius, which is 32 degrees Fahrenheit.", "The temperature of the interior of the Earth is about 5,400 degrees Celsius (9,800 degrees Fahrenheit).", "The average temperature for the month of December is -4 degrees.", "The average temperature in February is -0.7 °C (30.7 °F).", "The temperature of the outer surface of the frame of the window in contact with the glass is the same as the glass surface temperature.", "There are many different types of weather. Snow is a type of weather."]