["Pepper is a topping for food.", "Hot peppers are a topping on the food.", "The topping is peppers.", "Peppers are a topping.", "Hot peppers are a topping on food.", "The topping is hot peppers.", "Pepper is a topping.", "The topping is pepper.", "The topping on the food is hot pepper.", "The topping is hot pepper.", "The topping on the food is green peppers.", "The food is topped with pepper.", "The topping is chili.", "The topping is a hot pepper.", "The topping on the food is chili sauce.", "The food is topped with chili peppers.", "The topping is pickled peppers.", "The topping on the food is pickled green peppers.", "It is a chili pepper.", "Hot peppers are used to add spice to food.", "Hot peppers are used as a spice or condiment.", "Chili peppers are the fruits of Capsicum plants.", "Chili peppers are the fruit of plants from the genus Capsicum.", "Hot pepper is a chili pepper used to flavor dishes.", "Peppers are spicy.", "Peppers are commonly used in the preparation of food and can be eaten raw or cooked.", "There is hot pepper on the food.", "The food is topped with jalapeño peppers.", "Peppers are a type of fruit, although they are often used in cooking as a vegetable.", "Hot peppers are the fruit of plants from the genus Capsicum which are members of the nightshade family, Solanaceae.", "Pepper is a food seasoning made from the berry of a pepper plant, most commonly from the Piper nigrum plant, but also from the closely related Piper longum. Black pepper is usually dried and used as a spice and seasoning, while green pepper and white pepper are dried and used as a spice or seasoning.", "Topping is a food item that may be used as a spread, condiment or topping on any dish.", "Chili peppers are a group of flowering plants in the nightshade family Solanaceae.", "A topping is a prepared food that is placed on top of another food, usually to add flavor or texture.", "A topping is a food item that is added to foods such as ice cream, salads and baked goods.", "The topping is jalapenos.", "The topping is a pickle.", "Hot sauce, also known as chili sauce or pepper sauce, is any condiment, seasoning, or salsa made from chili peppers and other ingredients.", "The topping is cheese.", "Pepper is a common name for a spice produced from the fruit of plants in the genus Piper, sometimes known as Piper nigrum.", "Sesame seeds are a topping.", "Chili powder is the dried, pulverized fruit of one or more varieties of chili pepper, sometimes with the addition of other spices.", "Pepperoncini peppers are a type of chili pepper that originated in Italy.", "pepper is a flowering vine in the nightshade family Solanaceae, native to southern India and Sri Lanka.", "Pepperoni is a variety of salami, made from cured pork and beef mixed together.", "pickles are a cucumber that has been pickled in a brine, vinegar, or other solution and left to ferment for a period of time, by either immersing the cucumbers in an acidic solution or through souring by lacto-fermentation.", "Sesame seeds are a common ingredient in many cuisines."]