["In order to board a train, one needs a ticket.", "One needs a ticket to board a subway.", "A ticket is required to board a subway.", "A ticket is needed to board a subway.", "A ticket is required to board a train.", "A ticket is required to board the train.", "To board a train, you need a ticket.", "A train ticket", "A ticket is needed before boarding a train.", "A ticket is required before being able to board the subway.", "One might need a ticket before boarding the train.", "Before you can board a train, you need to buy a ticket.", "A ticket is required before boarding the train.", "A person needs a ticket to board a train.", "A subway ticket.", "You need to buy tickets before you can board a train.", "Before boarding a train, the passenger must have a valid ticket.", "A train ticket is a ticket issued by a railway operator that enables the bearer to travel on the operator's network or a partner's network.", "One must buy a train ticket before being able to board a train.", "The ticket is a document that indicates that an individual is entitled to use a public transport system: rail, bus, metro, etc.", "One might need tickets before being able to board one of these.", "One needs a ticket.", "A ticket is a voucher that indicates that an individual is entitled to admission to an event or establishment such as a theatre, amusement park or tourist attraction, or has a right to travel on a vehicle, such as with an airline ticket, bus ticket or train ticket.", "A ticket is a document that indicates that an individual is entitled to enter the premises, travel via public transport, or participate in an event.", "A ticket.", "You need a ticket to board one of these.", "One might need a ticket.", "The subway is a rapid transit system that has a network of underground and elevated trains that are usually separate from other traffic.", "A ticket is a document that certifies that an individual is entitled to a service, right, or discount.", "A subway token.", "Subway is a fast food restaurant franchise that primarily sells submarine sandwiches and salads."]