["A doughnut, or donut, is a type of fried dough confection or dessert food.", "A doughnut or donut is a type of fried dough confectionery or dessert food.", "A doughnut or donut is a type of fried dough confection or dessert food.", "A doughnut or donut is a type of fried dough confection or dessert food. The doughnut is popular in many countries and prepared in various forms as a sweet snack that can be homemade or purchased in bakeries, supermarkets, food stalls, and franchised specialty outlets.", "A doughnut or donut is a type of fried dough confectionery or dessert food. The doughnut is popular in many countries and prepared in various forms as a sweet snack that can be homemade or purchased in bakeries, supermarkets, food stalls, and franchised specialty vendors.", "A doughnut or donut is a type of fried dough confectionery or dessert food. The doughnut is popular in many countries and is prepared in various forms as a sweet snack that can be homemade or purchased in bakeries, supermarkets, food stalls, and franchised specialty vendors.", "A doughnut or donut is a type of fried dough confectionery or dessert food. The doughnut is popular in many countries and prepared in various forms as a sweet snack that can be homemade or purchased in bakeries, supermarkets, food stalls, and franchised specialty outlets.", "doughnuts is a type of fried dough confection or dessert food.", "Doughnuts are a type of fried dough confection or dessert food.", "Doughnuts are a type of fried dough confectionery or dessert food.", "Doughnuts are a type of pastry.", "doughnuts are a type of pastry.", "The pastries in the plastic container are doughnuts.", "Doughnuts are a type of fried dough confectionery or dessert food. The doughnut is popular in many countries and prepared in various forms as a sweet snack that can be homemade or purchased in bakeries, supermarkets, food stalls, and franchised specialty outlets.", "Doughnuts are a type of pastry made from dough that is fried in oil.", "Doughnut is a type of fried dough confectionery or dessert food. The doughnut is popular in many countries and prepared in various forms as a sweet snack that can be homemade or purchased in bakeries, supermarkets, food stalls, and franchised specialty outlets.", "Doughnuts are often deep-fried from a flour dough, and typically either ring-shaped or without a hole, and often filled.", "The container is filled with doughnuts.", "Donut is a type of fried dough confectionery.", "The plastic container is filled with doughnuts.", "Doughnuts are in the plastic container.", "The pastries are doughnuts.", "Doughnuts are an American variety of deep-fried dough.", "Doughnuts are a variety of deep-fried pastries.", "Donuts are small cakes made of dough and deep-fried in oil.", "A donut is a type of pastry.", "The plastic container is full of doughnuts.", "The container holds donuts.", "The doughnut is popular in many countries and prepared in various forms as a sweet snack that can be homemade or purchased in bakeries, supermarkets, food stalls, and franchised specialty vendors.", "A donut or donut hole is a type of fried dough confectionery or dessert food.", "Donuts.", "Donuts are in the plastic container.", "This is a container of Dunkin' Donuts mini donuts.", "The container has a variety of pastries."]