["The most common setting for a bus is a city street.", "A bus is a vehicle used for transporting people. They are used for mass transit in cities.", "A bus is a road vehicle designed to carry many passengers.", "Bus is a public transport.", "The bus is usually used in the city.", "Buses are used for public transport.", "A bus is a road vehicle designed to carry passengers.", "A transit bus is a large vehicle used for public transport.", "Buses are used for public transport", "Transit bus is a bus that is used to provide public transport services.", "Buses are often found in cities.", "A bus is a road vehicle designed to carry passengers. Buses can have a capacity as high as 300 passengers.", "A bus is a road vehicle designed to carry many passengers. Buses can have a capacity as high as 300 passengers.", "A transit bus is a type of bus used on shorter-distance public transport bus services.", "The bus is in a city.", "A city bus is a type of bus used for transporting large numbers of people within a city or metropolitan area.", "A transit bus is a bus used on shorter-distance public transport bus services.", "A bus is a large vehicle with a long body used for transporting people.", "A bus is a road vehicle designed to carry many passengers. Buses can have a capacity as high as 300 passengers. The most common type of bus is the single-deck rigid bus, with larger loads carried by double-decker and articulated buses, and smaller loads carried by midibuses and minibuses; coaches are used for longer-distance services. Many types of buses, such as city transit buses and inter-city coaches, charge a fare. Other types, such as elementary or secondary school buses or shuttle buses within a post-secondary education campus do not charge a fare.", "A transit bus (also big bus, commuter bus, city bus, town bus, urban bus, stage bus, public bus or simply bus) is a type of bus used on short-distance public transport bus services.", "A transit bus is a type of bus used on shorter-distance public transport bus services. Several configurations are used, including low-floor buses, high-floor buses, double-decker buses, articulated buses and electric trolleybuses.", "The bus is in the city.", "A bus is a road vehicle designed to carry many passengers. Buses can have a capacity as high as 300 passengers. The most common type of bus is the single-deck rigid bus, with larger loads carried by double-decker and articulated buses, and smaller loads carried by midibuses and minibuses; coaches are used for longer-distance services. Many types of buses, such as city transit buses and inter-city coaches, charge a fare. Other types, such as elementary or secondary school buses or shuttle buses within a post-secondary education campus do not charge a fare. In many jurisdictions, bus drivers require a", "Buses are usually found in cities, towns, and villages.", "The city bus is usually found in the city.", "A bus (archaically also omnibus, multibus, motorbus, autobus) is a road vehicle designed to carry many passengers.", "Buses can be used for scheduled bus transport, scheduled coach transport, school transport, private hire, or tourism; promotional buses may be used for political campaigns and others are privately operated for a wide range of purposes, including rock and pop band tour vehicles.", "You would find this bus in a city.", "Transit buses are most commonly used on bus rapid transit (BRT) services that have bus-only lanes and which are based on slightly modified local bus designs or on purpose-built designs, but standard transit buses can also be used on BRT services.", "City street.", "On the street."]