["The shadow is from a car.", "The shadow is of a car.", "the shadow on the ground is from a car.", "The shadow is a shape on the ground caused by the blocking of light from an object.", "The shadow is from the car.", "The shadow of a car.", "The shadow is cast by a car.", "The shadow on the ground is from the car.", "The shadow is from a street light.", "The shadow is from the Sun.", "The shadow is from the sun.", "The shadow is the dark shape made on a surface when an object blocks the light.", "The shadow on the ground is from the sun.", "The shadow is a representation of the blocking of light.", "A shadow is a dark area where light from a light source is blocked by an opaque object.", "The shadow is the region where light from a light source is obstructed by an opaque object.", "The shadow is from a building.", "The shadow on the ground is from a building.", "The shadow on the ground is cast by the car.", "A shadow is a dark area where light from a light source is blocked by an opaque object. It occupies all of the three-dimensional volume behind an object with light in front of it.", "Shadows are made by blocking light.", "The shadow cast by an object depends on the direction of the light source.", "The sun is the shadow.", "A shadow is a dark area where light from a light source is blocked by an opaque object. It occupies all of the three-dimensional volume behind an object with light in front of it. The cross section of a shadow is a two-dimensional silhouette, or a reverse projection of the object blocking the light.", "A shadow is a dark (real image) area where light from a light source is blocked by an opaque object. It occupies all of the three-dimensional volume behind an object with light in front of it.", "The shadow is from a traffic sign.", "The shadow on the ground is from a tree.", "The shadow of a car is cast by the car.", "The shadow on the ground is from the bus station.", "The shadow is from the bus station.", "a car turning on a city street on a very sunny day."]