["A baby is an infant or very young child.", "A baby is a very young child or infant.", "A baby is a very young child, typically only a few months old.", "A baby is a very young child, usually between birth and about two years old.", "A baby is a very young child, usually from birth to a couple of years old.", "A baby is a young child, usually from birth to a couple of years old.", "A baby is a very young child, between birth and somewhere between six months and two years of age.", "A baby is a young human.", "A baby is a young child.", "A baby is considered a newborn during its first four weeks of life.", "The baby is a few months old.", "A baby is a child or infant.", "A baby is an infant.", "A baby is a very young human.", "Babies are born at different ages.", "The baby is one year old.", "The baby is two months old.", "The baby is 1 month old.", "The baby is 1.", "The baby is 2 months old.", "A baby is a very young child, in human and many other animal species.", "The baby is a little one.", "A baby is considered a newborn during the first four to six weeks following childbirth.", "Newborns are defined as babies who are less than 1 month old.", "Babies are aged 0-1 years old.", "Babies are born at different stages of development. Babies can be born as early as 23 weeks. Babies born at this stage are called premature.", "The development of a baby is quite an intricate process.", "The infant is the more formal or specialised synonym for \"baby\", the very young offspring of a human.", "A newborn is, in colloquial use, an infant who is only hours, days, or up to one month old.", "Babies are born with a range of maturity levels.", "The average age of a baby is 6 months.", "The baby is 5 years old.", "The baby is 5 months old.", "The average age of a baby is 3 months.", "Infancy (from the Latin word infans, meaning \"unable to speak\" or \"speechless\") is the earliest stage of childhood, the time from birth to the acquisition of language at around one year of age.", "Babies are usually born after 9 months of pregnancy.", "The average age of a baby is 1 year old.", "The newborn period extends from birth until about 1 month of age.", "Babies are born with a lot of hair on their heads.", "The first year of life is considered a critical period of development."]