["Motorcycle riders wear protective clothing to reduce the risk of injury in the event of a crash.", "Motorcycle helmets are worn for protection in the event of an accident.", "Motorcycle helmets are worn to protect riders from head injuries.", "Motorcycle helmets are designed to protect riders from head injuries.", "Motorcycle helmets are worn to protect the rider's head in case of an accident.", "Motorcycle helmets are protective headgear designed to minimize injuries to the head during a crash.", "Motorcycle helmets are worn to protect the rider's head in the event of a crash.", "Motorcycle helmets are worn to protect the rider's head in the event of an impact with another vehicle, stationary object, or the ground.", "Motorcycle helmets are worn to protect the head in case of a crash.", "Motorcycle riders are often required to wear a helmet and other protective gear to prevent injury or death in the event of an accident.", "Motorcycle helmets are helmets worn by motorcycle riders to help protect the rider's head in case of an accident.", "Motorcyclists wear protective clothing to prevent injury in the event of a crash.", "Motorcycle helmets are helmets designed for motorcycle riders and passenger's to protect the head from impact during a crash and against penetrating objects like a flying rock or debris.", "It is a helmet designed to protect the rider's head in the event of a crash.", "The purpose of motorcycle helmets is to protect the rider's head from impact.", "A motorcycle helmet is a type of helmet used by motorcycle riders. The primary goal of a motorcycle helmet is motorcycle safety – to protect the rider's head during impact, thus preventing or reducing head injury and saving the rider's life.", "The purpose of a motorcycle helmet is motorcycle safety.", "A motorcycle helmet is a type of helmet used by motorcycle riders. The primary goal of a motorcycle helmet is motorcycle safety - to protect the rider's head during impact, thus preventing or reducing head injury and saving the rider's life.", "A motorcycle helmet is a type of helmet used by motorcycle riders. The primary goal of a motorcycle helmet is motorcycle safety - to protect the rider’s head during impact, thus preventing or reducing head injury and saving the rider’s life.", "Motorcycle helmets are helmets designed to attenuate impacts to the head of a motorcyclist in falls and accidents.", "A motorcycle helmet is a type of helmet used by motorcycle riders.", "Motorcycle riders wear helmets to protect their heads.", "Motorcycle helmet, a type of helmet designed to be worn while riding a motorcycle.", "Motorcycle helmets reduce the risk of head injury and death.", "The person has protective clothing on because he is riding a motorcycle.", "The helmet is a form of protective gear worn to protect the head from injuries.", "The helmet protects the person's head.", "Helmets are designed to protect the user from head injuries.", "A helmet is a form of protective gear worn to protect the head from injuries.", "Motorcycle riders wear protective clothing to protect themselves from the elements.", "The person is wearing a helmet for safety.", "Protective clothing is worn to protect the body from injury.", "A helmet is a form of protective gear worn to protect the head. More specifically, a helmet complements the skull in protecting the human brain.", "Protective clothing is clothing designed to protect the wearer's body from injury.", "The person has protective clothing on to prevent injury.", "Protective clothing is clothing designed to protect the wearer's body from injury by reducing the wearer's exposure to hazards.", "Motorcycle safety concerns many aspects of vehicle and equipment design as well as operator skill and training that are unique to motorcycle riding.", "A person wearing protective clothing is wearing it to protect themselves.", "The person is wearing protective clothing for biking.", "Protective clothing is used in many industries such as mining, oil and gas, pharmaceutical, chemical, manufacturing, etc.", "The person is wearing protective clothing to protect from the cold.", "Some people wear protective clothing to protect themselves from the weather.", "To protect the body from injury."]