["The breed of cat is a domestic cat.", "The black and white cat is a domestic cat.", "The Bombay is a breed of domesticated cat developed to look like a miniature black panther.", "The cat is a domestic cat.", "The breed of cat is Persian.", "A cat is a small carnivorous mammal. It is the only domesticated species in the family Felidae and often referred to as the domestic cat to distinguish it from wild members of the family.", "The black and white cat is a Persian cat.", "A cat is a small carnivorous mammal. It is the only domesticated species in the family Felidae and is often referred to as the domestic cat to distinguish it from the wild members of the family.", "A cat is a small, usually furry, domesticated, carnivorous mammal that is valued by humans for its companionship and for its ability to hunt vermin and household pests.", "A cat is a small, typically furry, carnivorous mammal.", "A cat breed is a particular strain or cat type which has been purposefully bred by humans, with a particular appearance, unique traits, and/or specific behavior patterns.", "The Bombay cat is a breed of domestic cat, closely related to the Burmese cat and sharing many of that breed's physical and personality traits.", "A black cat is a domestic cat with black fur that may be a mixed or specific breed. The Cat Fanciers' Association (CFA) recognizes 22 cat breeds that can come with solid black coats. The Bombay breed is exclusively black. All-black fur pigmentation is slightly more prevalent in male cats than female cats. Their high melanin pigment content causes most black cats to have yellow (golden) eyes (irises).", "A domestic short-haired cat is a cat of mixed ancestry—thus not belonging to any particular recognised cat breed—possessing a coat of short fur.", "A Persian cat is a long-haired breed of cat characterized by its round face and short muzzle.", "The Bombay is a breed of cat developed by breeding sable Burmese and black American Shorthair cats, to produce a cat of mostly Burmese type, but with a sleek, panther-like black coat.", "The Persian cat is a long-haired breed of cat characterized by its round face and short muzzle.", "The Bombay is a breed of domestic cat, closely related to the Burmese, that was developed by breeding sable Burmese with black American Shorthairs.", "a black cat is a domestic cat with black fur that may be a mixed or specific breed.", "A black cat is a domestic cat with black fur that may be a mixed or specific breed.", "The Bombay is a breed of domestic cat, closely related to the Burmese, but with a much glossier coat. Bombay is the name given to black cats of the Asian group.", "Black cats are a common domestic cat.", "The British Shorthair is the pedigreed version of the traditional British domestic cat, with a distinctively stocky body, dense coat and broad face.", "A cat with a black coat is called a black cat.", "The cat is a black cat.", "The most popular cat breed is the Persian.", "The British Shorthair is the pedigreed version of the traditional British domestic cat, with a distinctively chunky body, dense coat and broad face. The most familiar color variant is the \"British Blue\", a solid grey-blue coat, orange eyes, and a medium-sized tail.", "The American Shorthair is a breed of domestic cat believed to be descended from European cats brought to North America by early settlers to protect valuable cargo from mice and rats.", "The Bombay is a breed of domestic cat, closely related to the Burmese and sharing that breed's sable coat and copper eyes. The Bombay was created by breeding sable Burmese to black American Shorthairs.", "The Bombay is a breed of domestic cat, closely related to the Burmese, developed by the American breeder Nikki Horner, who aimed to create a cat of Burmese type, but with a sleek black coat and copper eyes instead of brown fur and yellow eyes.", "The Bombay is a breed of domestic cat, closely related to the Burmese. The Bombay was created by Nikki Horner, an American breeder who wanted to develop a cat that possessed the conformation of the Burmese but with a sleek black coat and copper eyes instead of brown fur and yellow eyes—sort of a pint-sized panther.", "Persian cats are one of the most popular cat breeds in the world.", "The breed of the cat is a Norwegian Forest Cat.", "The Himalayan or Himmie for short, is a colorpoint variety of the Persian cat.", "Cats are small carnivorous mammals.", "The American Wirehair is a breed of domestic cat. It originated as a spontaneous natural mutation in the domestic cat population.", "The American Wirehair is a breed of domestic cat. It was developed in 1966 as a natural mutation of the American Shorthair.", "The cats are of the breed \"Abyssinian\".", "A breed is a specific group of domestic animals having homogeneous appearance (phenotype), homogeneous behavior, and/or other characteristics that distinguish it from other organisms of the same species."]