["A cell phone case is made by crocheting.", "Crocheted phone case is made by crochet.", "The phone case is made by knitting or crocheting.", "Crocheted phone cases are made by crocheting.", "This phone case was made by crocheting.", "The phone case was made by crochet.", "This phone case was crocheted.", "The phone case was made by hand.", "The case is crocheted.", "It was made with crochet.", "Crocheting is a method of creating fabric from yarn, thread, or other material strands using a crochet hook.", "Crochet, is a process of creating fabric by interlocking loops of yarn, thread, or strands of other materials using a crochet hook.", "Crocheting is a process of creating fabric by interlocking loops of yarn, thread, or strands of other materials using a crochet hook.", "Crochet is a process of creating fabric by interlocking loops of yarn, thread, or strands of other materials using a crochet hook. The name is derived from the French term crochet, meaning 'small hook'. These are made of materials such as metal, wood, or plastic and are manufactured commercially and produced in artisan workshops.", "Crochet is a process of creating fabric from yarn or thread using a crochet hook.", "Crochet is made by interlocking loops of yarn, thread, or strands of other materials using a crochet hook.", "A crochet hook is used to make the fabric.", "The phone case was crocheted.", "Crochet is a process of creating fabric by interlocking loops of yarn, thread, or strands of other materials using a crochet hook.", "Crochet is a method of creating fabric from yarn, thread, or other material strands using a crochet hook.", "The case was crocheted.", "Crochet is the process of creating fabric from yarn, thread, or other material strands using a crochet hook.", "A crochet hook is used to crochet.", "A crochet hook is a small, pointed hook at one end of a thin shaft, made of metal, wood, or plastic, and used to pull loops of yarn or thread through stitches.", "A cell phone case is a type of phone case.", "You can buy a crocheted phone case. You can make a crocheted phone case.", "A crochet hook is a tool consisting of a slender rod with a head or hook at one end, used for pulling looped stitches through woven fabric.", "The case is made by hand.", "This phone case was made by hand.", "A cell phone case is a cover for a cell phone.", "A cell phone case is a protective cover for a cell phone.", "A cell phone case is a holder that is used to protect a cell phone.", "Cell phone case is a protective cover for the back and sides of a cell phone.", "A mobile phone case is a small case used to protect mobile phones.", "It was made by hand.", "The first cell phone was made in 1973."]