["The biplane is a fixed-wing aircraft with two main wings stacked one above the other. The first powered, controlled aeroplane to fly, the Wright Flyer, used a biplane wing arrangement, as did many aircraft in the early years of aviation.", "The airplane is a biplane.", "The plane is a biplane.", "A biplane is a fixed-wing aircraft with two main wings stacked one above the other. The first powered, controlled aeroplane to fly, the Wright Flyer, used a biplane wing arrangement, as did many aircraft in the early years of aviation.", "The biplane is a fixed-wing aircraft with two main wings stacked one above the other.", "A biplane is a fixed-wing aircraft with two main wings.", "The plane is a Piper Cub.", "The airplane in the photo is a vintage plane.", "A biplane is a fixed-wing aircraft with two main wings stacked one above the other.", "The Piper PA-18 Super Cub is a two-seat, single-engine monoplane.", "The aircraft is a single-engine monoplane.", "An airplane is a powered, fixed-wing aircraft that is propelled forward by thrust from a jet engine or propeller.", "The first airplane was the Wright Flyer. It was invented in 1903.", "The Piper PA-18 Super Cub is a two-seat, single-engine monoplane. Introduced in 1949 by Piper Aircraft, it was developed from the Piper PA-11, and traces its lineage back through the J-3 to the Taylor E-2 Cub of the 1930s.", "An airplane or aeroplane is a powered, fixed-wing aircraft that is propelled forward by thrust from a jet engine, propeller or rocket engine. Airplanes come in a variety of sizes, shapes, and wing configurations.", "The Piper J-3 Cub is an American light aircraft that was built between 1937 and 1947 by Piper Aircraft.", "The Piper J-3 Cub is an American light aircraft that was built between 1938 and 1947 by Piper Aircraft.", "The Piper J-3 Cub is a small, simple, light aircraft that was built between 1937 and 1947 by Piper Aircraft.", "The Cessna 172 Skyhawk is a four-seat, single-engine, high-wing fixed-wing aircraft made by the Cessna Aircraft Company.", "The first airplane was invented in 1903 by the Wright brothers.", "The Piper PA-22 Tri-Pacer is a four-seat, strut braced, high-wing light aircraft that was designed and built by Piper Aircraft.", "The Wright Flyer was the first successful heavier-than-air powered aircraft.", "The first powered, controlled flight of a fixed-wing aircraft took place on December 17, 1903 by the Wright brothers.", "The airplane is a P-51 Mustang."]