["Researchers found that taking a picture of yourself is a good way to improve your health.", "Taking a picture of himself is good for his health.", "Taking a picture of yourself is a good way to get a picture of yourself in a picture.", "Exercise is any bodily activity that enhances or maintains physical fitness and overall health and wellness.", "Taking a selfie is a good for health.", "Taking a selfie is good for your health.", "Taking a picture of yourself can make you happier.", "Taking photos of oneself is a healthy activity for the mind.", "Taking a selfie can help you get a better selfie.", "Taking a picture of yourself is a good way to keep track of your progress.", "Taking a picture of yourself is a good way to record your progress.", "This man is taking a selfie.", "The man is taking a picture of himself.", "Taking a picture of himself.", "Taking picture of yourself is a good exercise for your eyes.", "The health benefits of music are numerous and include improved heart health and reduced stress.", "Exercise is any bodily activity that enhances or maintains physical fitness and overall health and wellness. It is performed for various reasons, including increasing growth and development, preventing aging, strengthening muscles and the cardiovascular system, honing athletic skills, weight loss or maintenance, and also for enjoyment.", "The health benefits of listening to music are numerous. Music can help you relax, reduce stress, and even help with depression. It can also help you sleep better and even provide pain relief.", "Music can help reduce stress and improve health.", "Listening to music is good for your health.", "taking a picture", "Taking photos is a great way to share your experiences with others.", "Selfies have been popular for more than a decade now, and it’s no secret that they can be a great way to document your life.", "Smiling is good for your health.", "The man is smiling, which is good for his health.", "Taking selfies has been shown to increase self-confidence and help with social anxiety.", "A selfie is a self-portrait photograph, typically taken with a digital camera or camera phone held in the hand or supported by a selfie stick. Selfies are often shared on social networking services such as Facebook, Instagram and Twitter. They are usually flattering and made to appear casual.", "Selfies are often shared on social networking services such as Facebook, Instagram and Twitter. They are often casual, are typically taken either with a camera held at arm's length or in a mirror, and typically include either only the photographer or the photographer and as many people as can be in focus.", "Exercise can help prevent excess weight gain or help maintain weight loss.", "The man is walking and taking a picture of himself.", "He is exercising.", "The man is smiling.", "Smiling and laughing can help lower blood pressure, reduce stress hormones, boost your immune system, and relieve pain.", "The man is taking a picture of himself with a mustache.", "Walking is good for health.", "The health benefits of photography include stress relief, improved memory, development of communication skills, and more.", "This man is looking into the camera which is good for his eyes."]