["The plants are called plants.", "The plants are called ferns.", "The wide-leaved plants are called ferns.", "The wide leaved plants are called large plants.", "The plants are trees.", "A plant is a living thing that grows in soil and has leaves.", "The plants are called Hosta.", "A plant is any organism that belongs to the kingdom Plantae.", "A plant is a living organism that is typically rooted in the ground, with stems and leaves above the ground.", "A plant is any organism of the kingdom Plantae, which includes the flowering plants, conifers and other gymnosperms, ferns, clubmosses, hornworts, liverworts, mosses and the green algae. Historically, plants formed one of two kingdoms covering all living things that were not animals, and both algae and fungi were treated as plants.", "Wide leaved plants are called broad-leaved plants.", "Wide leaved plants are called wide leaved plants.", "The plants are called palm trees.", "The wide leaved plants next to the bench are called ferns.", "A bench is a long seat on which multiple people may sit at the same time. Benches are typically made of wood, but may also be made of metal, stone, or synthetic materials.", "A bench is a long seat on which multiple people may sit at the same time. Benches are typically made of wood, but may also be made of metal, stone, or synthetic materials. Many benches have arm and back rests; some have no back rest and can be sat on from either side.", "A plant is a living organism that synthesizes nutrients from the environment.", "The bench is a long seat on which several people may sit at the same time. Benches are typically made of wood, but may also be made of metal, stone, or synthetic materials.", "Plant, any multicellular eukaryotic, usually photosynthetic life-form in the kingdom Plantae.", "The large leaves of the banana tree are called banana leaves.", "A banana tree is a tree-like plant in the genus Musa whose fruits are generally used for human consumption.", "A plant is a living organism that typically synthesizes its own food, has specialized reproductive organs, and has the power of growth and development.", "A bench is a long seat on which multiple people may sit at the same time.", "The plants are called \"Elephant Ears.\"", "Wide leaved plants are called broadleaf evergreen plants.", "A park bench is a bench that is roughly divided into two or three seats, with arm and back rests, designed for public parks and gardens.", "The leaves of the plant are wide.", "Those plants are called Elephant Ears.", "The plants are called elephant ear plants.", "Plant leaves are the organs responsible for photosynthesis in plants.", "A fern is a member of a group of vascular plants that reproduce via spores and have neither seeds nor flowers.", "The leaves are from the plant called ficus.", "The large leaves are of a plant called Philodendron.", "A fern is a member of a group of vascular plants that reproduce via spores and have neither seeds nor flowers. They differ from mosses by being vascular, i.e., having specialized tissues that conduct water and nutrients and in having life cycles in which the sporophyte is the dominant phase.", "The common name \"Hosta\" is normally used to describe plants in this genus. Hostas are widely cultivated as shade-tolerant foliage plants.", "The common name of the plant is \"elephant ear\" due to the shape of its leaves.", "A tropical plant is a plant that originated in the tropics or subtropics, but can also be found outside of the tropics.", "The hosta is a genus of plants commonly known as hostas, plantain lilies and occasionally by the Japanese name giboshi. Hostas are widely cultivated as shade-tolerant foliage plants.", "A tree is a perennial plant with an elongated stem, or trunk, supporting branches and leaves in most species."]