["Suitcases have wheels and can be pulled by a handle.", "A suitcase is a form of luggage.", "Luggage is a suitcase used for transporting clothes and other possessions.", "A suitcase is a general term for a distinguishable form of luggage. It is often a flat, rectangular-shaped bag with rounded square corners, either metal, hard plastic or made of cloth, vinyl or leather that more or less retains its shape.", "A suitcase is a general term for a distinguishable form of luggage. It is often a somewhat flat, rectangular-shaped bag with rounded square corners, either metal, hard plastic or made of cloth, vinyl or leather that more or less retains its shape.", "A suitcase is a form of luggage. It is often a somewhat flat, rectangular-shaped bag with rounded square corners, either metal, hard plastic or made of cloth, vinyl or leather that more or less retains its shape. It has a carrying handle on one side and is used mainly for transporting clothes and other possessions during trips.", "Suitcase is a general term for a distinguishable form of luggage. It is often a flat, rectangular-shaped bag with rounded square corners, either metal, hard plastic or made of cloth, vinyl or leather that more or less retains its shape. It has a carrying handle on one side and is used mainly for transporting clothes and other possessions during trips.", "A suitcase is a form of luggage. It is often a somewhat flat, rectangular-shaped bag with rounded square corners, either metal, hard plastic or made of cloth, vinyl or leather that more or less retains its shape. It has a handle on one side and is used mainly for transporting clothes and other possessions during trips.", "A suitcase is a form of luggage. It is often a somewhat flat, rectangular-shaped bag with rounded square corners, either metal, hard plastic or made of cloth, vinyl or leather that more or less retains its shape.", "A suitcase is a form of luggage. It is often a somewhat flat, rectangular-shaped bag with rounded square corners, either metal, hard plastic or made of cloth, vinyl or leather that more closely resembles a suitcase.", "A suitcase is a general term for a distinguishable form of luggage.", "Suitcase is a general term for a distinguishable form of luggage.", "a luggage is a bag used for carrying items during traveling.", "These people are pulling suitcases.", "They are pulling suitcases.", "People are pulling a suitcase.", "Luggage is the bags, cases, and containers which hold a traveller's articles while the traveler is in transit.", "Luggage is the bags, cases and containers which hold a traveller's articles during transit.", "The people are pulling suitcases.", "The people are pulling a suitcase.", "Luggage is the bags, cases and containers which hold a traveller's articles during transit. The modern traveller can be expected to have packages containing clothing, toiletries, small possessions, trip necessities, and on the return-trip, souvenirs.", "Luggage refers to the bags, cases, and containers which hold a traveller's articles while the traveler is in transit.", "These people are pulling luggage.", "People pull luggage.", "The people are pulling the luggage.", "The handle is a lever used to pull a wheeled vehicle such as a luggage cart."]