["The elbows are the part of the body that it is considered rude to place upon the table when discussing things over dinner.", "The elbow is considered rude to place on the table.", "Elbows on the table is a manner of table manners.", "It is considered rude to place your elbows on the table.", "It is considered rude to place elbows on the table.", "It is considered rude to place one's elbows on the table while eating.", "It is considered rude to place your elbows on the table while dining.", "It is considered rude to put your elbows on the table.", "It is considered rude to place your elbow on the table.", "It is considered rude to place your elbows on the table when eating.", "It is considered rude to place one's elbows on the table.", "It is considered rude to place your elbows on the table during a meal.", "It is considered rude to place your elbows on the table while eating.", "It is rude to put your elbows on the table during a meal.", "In some cultures, it is considered rude to place your hands on the table while eating.", "When eating in a restaurant it is considered rude to place your elbows on the table.", "In the United States and Canada, it is considered rude to place your elbows on the table while eating.", "It is considered rude to place your elbows on the table when discussing things over dinner.", "It is considered bad manners to put your elbows on the table while eating.", "In England, it is considered rude to place your elbows on the table.", "One should not put one's elbows on the table.", "elbows", "When discussing things over dinner what part of the body is it considered rude to place upon the table?", "The elbows.", "The elbow is the visible joint between the upper and lower parts of the arm.", "A dining table is a table on which meals are served in a dining room.", "The elbow is a hinge joint in the human body. It allows the forearm to be moved towards and away from the upper arm.", "Elbow", "The elbow.", "The elbow is the visible joint between the upper and lower parts of the arm. It includes prominent landmarks such as the olecranon, the olecranon process, and the elbow pit.", "The elbow is a jointed appendage of the vertebrate forelimb.", "A table is an item of furniture with a flat top and one or more legs, used as a surface for working at, eating from or on which to place things.", "people place hands on table.", "Eating can be a very social activity. Many cultures have traditions that surround food, such as religious prohibitions against certain types of foods, or rituals like saying grace."]