["Surfboards are long and narrow boards that are used for surfing.", "A surfboard is a board used in surfing.", "Surfboards are long, narrow boards on which surfers stand and ride incoming waves.", "Surfboards are long boards on which surfers stand. They come in a variety of shapes and sizes depending on the type of wave they are designed to ride.", "A surfboard is an elongated platform used in surfing.", "A surfboard is an elongated platform used in the sport of surfing. Surfboards are relatively light, but are strong enough to support an individual standing on them while riding an ocean surface wave breaking wave.", "A surfboard is an elongated platform used in surfing. Surfboards are relatively light, but are strong enough to support an individual standing on them while riding an ocean surface wave breaking wave.", "A surfboard is an elongated platform used in surfing. Surfboards are relatively light, but are strong enough to support an individual standing on them while riding a Ocean wave.", "A surfboard is an elongated platform used in surfing. Surfboards are relatively light, but are strong enough to support an individual standing on them while riding an ocean wave.", "A surfboard is an elongated platform used in surfing. Surfboards are relatively light, but are strong enough to support an individual standing on them while riding a breaking wave.", "Surfboards are long, narrow boards on which people stand while surfing.", "The surfboard is a longboard.", "A surfboard is a narrow board that is used in the sport of surfing. Surfboards are relatively light, but are strong enough to support an individual standing on them while riding an ocean wave.", "The surfboard is a type of surfboard.", "A surfboard is an elongated platform used in the sport of surfing.", "The surfboard is a board that surfers use to ride a wave.", "Surfboards are long, narrow boards with a curved front and flat back.", "The type of surfboard the man is using is a longboard.", "Surfboards are long and narrow, and are often composed of fiberglass.", "Surfboards are typically made of foam and fiberglass.", "This is a longboard."]