["The pilot is the person who controls the aircraft.", "A pilot is the person who controls the flight of an aircraft.", "A pilot is a person who controls the flight of an aircraft.", "a pilot is a person who controls the flight of an aircraft.", "An airplane pilot is a person who controls the flight of an aircraft.", "An airplane pilot is the person who controls the flight of an aircraft.", "The pilot is a person who controls the flight of an aircraft.", "A pilot is a person who operates the flight controls of an aircraft.", "A pilot is a person who operates the controls of an aircraft.", "An airplane pilot is a person who controls the flight of an airplane.", "An airplane pilot is a person who controls the flight of an aircraft by operating its directional flight controls.", "Pilots are the people who control the plane.", "A pilot is a person who controls the flight of an aircraft by operating its directional flight controls.", "The pilot is the person who flies an aircraft.", "A pilot or aviator is a person who controls the flight of an aircraft.", "An aircraft pilot or aviator is a person who controls the flight of an aircraft by operating its directional flight controls.", "A pilot is a person who flies or navigates an aircraft.", "The person controlling the airplane is a pilot.", "The pilot is the person who controls the airplane.", "An airplane pilot or aviator is a person who controls the flight of an aircraft by operating its directional flight controls.", "The pilot is the person who flies the aircraft.", "Pilot is a person who is trained to fly an aircraft.", "A pilot or aviator is a person who controls the flight of an aircraft by operating its directional flight controls.", "An airline pilot or aviator is a person who controls the flight of an aircraft by operating its directional flight controls.", "Pilots are people who fly airplanes.", "The profession of the person controlling the object shown is a pilot.", "Pilots are the people who fly airplanes.", "The person is a pilot.", "An air traffic controller is a person who directs aircraft on the ground and through controlled airspace, and can provide advisory services to aircraft in non-controlled airspace.", "An airplane or aeroplane (informally plane) is a powered, fixed-wing aircraft that is propelled forward by thrust from a jet engine, propeller or rocket engine.", "Air traffic controllers are people trained to maintain the safe, orderly, and expeditious flow of air traffic in the global air traffic control system."]