["the bird is called a blue bird.", "The name of the bird is a blue bird.", "This bird is called a blue jay.", "The bird is called the blue jay.", "The appropriate name for this bird is a blue jay.", "The appropriate name for this bird is a Blue Jay.", "The bird is a bird.", "The bluebird is a medium-sized bird.", "The appropriate name for this bird is a bird.", "a bird is an animal.", "A blue jay is a small bird.", "A bird is a feathered vertebrate animal.", "A bird is a feathered, winged, bipedal, warm-blooded, egg-laying, vertebrate.", "The bird is a Blue-and-yellow Macaw.", "The bird is a parrot.", "A bird is a warm-blooded egg-laying vertebrate distinguished by the possession of feathers, wings, and a beak and (typically) by being able to fly.", "The bird is called a macaw.", "A bird is a feathered, winged, bipedal, warm-blooded, egg-laying, vertebrate", "The bluebird is a medium-sized bird measuring around 16–20 cm in length.", "It is a blue jay.", "The blue jay (Cyanocitta cristata) is a passerine bird in the family Corvidae, native to North America.", "The Blue Jay is a passerine bird in the family Corvidae, native to North America.", "The blue jay is a passerine bird in the family Corvidae, native to North America.", "The bird is called a kingfisher.", "The blue jay is a passerine bird in the family Corvidae, native to North America. It is resident through most of eastern and central United States, although western populations may be migratory.", "The name of the bird is flamingo.", "The blue jay has a crest on the top of its head, which raises when the bird is excited or aggressive.", "This bird is called a hyacinth macaw.", "The bird is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is a bird that is", "The blue-and-yellow macaw, also known as the blue-and-gold macaw, is a large South American parrot with blue top parts and yellow under parts. It is a member of the large group of neotropical parrots known as macaws.", "The blue-and-yellow macaw, also known as the blue-and-gold macaw, is a large South American parrot with mostly blue top parts and light orange underparts, with gradient hues of green on top of its head.", "The bird is a species of bird in the family of the same name. It is found in Australia, New Zealand, and New Guinea.", "The birds are a group of endothermic vertebrates, characterised by feathers, toothless beaked jaws, the laying of hard-shelled eggs, a high metabolic rate, a four-chambered heart, and a strong yet lightweight skeleton.", "Birds, also known as Aves, are a group of endothermic vertebrates, characterised by feathers, toothless beaked jaws, the laying of hard-shelled eggs, a high metabolic rate, a four-chambered heart, and a strong yet lightweight skeleton.", "The Blue Bird of Paradise is a small bird found in the lowland forests of New Guinea.", "The blue-footed booby is a marine bird native to subtropical and tropical regions of the eastern Pacific Ocean.", "This is a blue-footed booby."]