["A microwave oven is a small appliance.", "A microwave oven is a kitchen appliance that uses a form of electromagnetic radiation to rapidly heat food.", "A microwave is a small appliance that uses microwaves to heat or cook food.", "A microwave is a small appliance.", "A microwave is a device that uses electromagnetic waves to heat food.", "A microwave oven (commonly referred to as a microwave) is an electric oven that heats and cooks food by exposing it to electromagnetic radiation in the microwave frequency range.", "A microwave oven is a kitchen appliance that heats food by bombarding it with electromagnetic radiation in the microwave frequency range.", "A microwave oven is a device that heats food by bombarding it with electromagnetic radiation in the microwave frequency range.", "The small appliance is a microwave.", "Microwaves are a type of appliance that is used to cook food.", "A microwave oven is a kitchen appliance that cooks or heats food by dielectric heating.", "A microwave is a kitchen appliance that heats food by bombarding it with electromagnetic radiation in the microwave frequency range.", "A microwave oven is a kitchen appliance that heats and cooks food by exposing it to electromagnetic radiation in the microwave frequency range. This induces polar molecules in the food to rotate and produce thermal energy in a process known as dielectric heating.", "The microwave oven is a kitchen appliance that heats food by dielectric heating, using microwave radiation to heat polarized molecules within the food.", "A microwave oven is an electric oven that heats and cooks food by exposing it to electromagnetic radiation in the microwave frequency range. This induces polar molecules in the food to rotate and produce thermal energy in a process known as dielectric heating.", "The small appliance is a microwave oven.", "A microwave oven is an electric oven that heats and cooks food by exposing it to electromagnetic radiation in the microwave frequency range.", "Microwave ovens are a common kitchen appliance.", "The stuffed animal is inside a microwave oven.", "A microwave oven is the most common small kitchen appliance.", "Microwave ovens are a common kitchen appliance and are popular for reheating previously cooked foods and cooking a variety of foods.", "Microwave ovens heat food quickly and efficiently because excitation is fairly uniform in the outer 25–38 mm (1–1.5 inches) of a homogeneous, high water content food item.", "The stuffed animal is inside a microwave.", "Microwave ovens heat food without getting hot themselves. This is because the microwaves only affect the water, fat and sugar molecules in food.", "The stuffed animal is inside the microwave.", "A microwave is an electromagnetic wave with a wavelength in the range 0.001–0.3 m, which corresponds to frequencies in the range 300 MHz–300 GHz.", "The microwave is an electromagnetic wave with a wavelength in the range of 30 cm to 1 mm; with frequencies between 300 MHz and 300 GHz.", "The first commercially viable microwave oven was invented in 1947.", "A stuffed bear is inside a microwave.", "The bear is inside a microwave.", "The bear is sitting inside a microwave."]