["The chair is made of wood.", "Chairs are made of wood.", "Chairs are commonly made of wood or metal.", "Chairs are made of wood or metal.", "A chair is a piece of furniture designed to support various human activities.", "A chair is a piece of furniture with a raised surface used to sit on, commonly for use by one person.", "Chairs are pieces of furniture that are used for sitting.", "A chair is a piece of furniture with a raised surface supported by legs, commonly used to seat a single person. Chairs are supported most often by four legs and have a back.", "A chair is a piece of furniture with a raised surface supported by legs, commonly used to seat a single person.", "a chair is a piece of furniture with a raised surface supported by legs, commonly used to seat a single person.", "Chairs are made of wood, metal, or other strong materials, like stone or acrylic.", "A chair is a piece of furniture with a raised surface, commonly used to seat a single person.", "A chair is a piece of furniture. It has a back, legs and a seat.", "A chair is a piece of furniture with a raised surface supported by legs, commonly used to seat a single person. Chairs are supported most often by four legs and have a back; however, a chair can have three legs or can have a different shape.", "A chair is a piece of furniture. Its primary features are two pieces of a durable material, attached as back and seat to one another at a 90° or slightly greater angle, with usually the four corners of the horizontal seat attached in turn to four legs.", "The chair is made of a hardwood, which is a type of wood that is very strong and durable.", "The chair is a piece of furniture with a raised surface supported by legs, commonly used to seat a single person.", "The chair is made of leather.", "The chair is made of metal.", "The chair is made of wood and is painted red.", "Wood is a material that is commonly used to make furniture.", "The most common types of chairs are armchair, side chair, wingback chair, slipper chair, rocking chair, easy chair, and lounge chair.", "Wood.", "Wood is a porous and fibrous structural tissue found in the stems and roots of trees and other woody plants."]