["Coca Cola is the cola company that has a polar bear as a mascot.", "The polar bear is the mascot of the Coca-Cola company.", "The polar bear is the mascot for Coca-Cola.", "The polar bear is a mascot for Coca-Cola.", "Coca-Cola has a polar bear as a mascot.", "The Coca-Cola Company is an American multinational beverage corporation and manufacturer, retailer, and marketer of nonalcoholic beverage concentrates and syrups.", "The Coca-Cola Company is an American multinational beverage corporation headquartered in Atlanta, Georgia.", "The Coca-Cola Company is an American multinational beverage corporation and manufacturer, retailer and marketer of nonalcoholic beverage concentrates and syrups.", "The Coca-Cola Company is an American multinational beverage corporation, and manufacturer, retailer, and marketer of nonalcoholic beverage concentrates and syrups.", "The Coca-Cola Company is an American multinational corporation, and manufacturer, retailer, and marketer of nonalcoholic beverage concentrates and syrups.", "Coca-Cola has used the polar bear in its advertising since 1922.", "The Coca-Cola Company is an American corporation, and manufacturer, retailer, and marketer of nonalcoholic beverage concentrates and syrups.", "Coca-Cola is a carbonated soft drink.", "Polar bears have been the mascot of Coca-Cola since 1922.", "The Coca-Cola Company is an American multinational beverage corporation incorporated under Delaware's General Corporation Law and headquartered in Atlanta, Georgia.", "Coca-Cola", "Coca-Cola is a carbonated soft drink manufactured by The Coca-Cola Company.", "The Coca-Cola Company has often used the polar bear in its advertising.", "The Coca-Cola Company has often used polar bears in their advertisements.", "Coca-Cola.", "Coca-Cola is a carbonated soft drink sold in stores, restaurants, and vending machines internationally.", "The Coca-Cola Company owns the trademark rights to the polar bear.", "Coca-Cola is a carbonated soft drink sold in stores, restaurants, and vending machines in more than 200 countries.", "The Coca-Cola Company has used the polar bear in numerous marketing campaigns.", "Coca-Cola used the polar bears in ads as early as 1922.", "Coca-Cola is a carbonated soft drink sold in stores, restaurants, and vending machines in more than 200 countries. It is produced by The Coca-Cola Company of Atlanta, Georgia, and is often referred to simply as Coke.", "Coca-Cola is a carbonated soft drink. It is produced by The Coca-Cola Company of Atlanta, Georgia, and is often referred to simply as Coke.", "Coca-Cola is a carbonated soft drink sold in stores, restaurants, and vending machines internationally. The Coca-Cola Company claims that the beverage is sold in more than 200 countries.", "Coca-Cola's polar bear mascot is named \"Chilly\".", "Coca-Cola is the most popular and biggest-selling soft drink in history, as well as the best-known product in the world.", "Polar bears are large white bears. They are found in the Arctic."]