["Coffee would be the best drink to go with this food.", "Coffee would go well with this food.", "A cup of coffee would go well with this food.", "The drink is coffee.", "A beverage is a drink that is specifically prepared for human consumption.", "You can drink wine to go with this food.", "A cup of coffee with milk.", "You would drink milk to go with this food.", "A drink (or beverage) is a liquid intended for human consumption.", "Coffee is a drink that goes well with cake.", "Coffee or tea.", "You would drink wine to go with this food.", "You would drink water or milk with this food.", "You would drink water with this food.", "A drink is a liquid intended for human consumption. In addition to their basic function of satisfying thirst, drinks play important roles in human culture. Common types of drinks include plain drinking water, milk, coffee, tea, hot chocolate, juice and soft drinks. In addition, alcoholic drinks such as wine, beer, and liquor, which contain the drug ethanol, have been part of human culture for more than 8,000 years.", "You would drink tea to go with this food.", "A nice cold glass of milk would go well with this food.", "Beer is a drink that goes well with this food.", "A drink is a liquid intended for human consumption, such as water, coffee, tea, soft drinks, beer, and liquor.", "The drink is usually either an alcoholic beverage or a non-alcoholic beverage.", "Drink is a liquid intended for human consumption. In addition to their basic function of satisfying thirst, drinks play important roles in human culture.", "Coffee is often served with a meal.", "A beverage is a drink specifically. The term beverage has been used in the beverage industry for many years.", "A glass of milk would be an appropriate drink to accompany a slice of cake.", "Coffee is a brewed drink prepared from roasted coffee beans, the seeds of berries from certain Coffea species.", "Beer is an alcoholic beverage.", "Water is the most common drink.", "a glass of milk.", "People usually drink water or juice with food.", "Cake is usually served with tea.", "The most common food and drink pairing is wine and cheese.", "A coffee is a brewed drink prepared from roasted coffee beans, which are the seeds of berries from the Coffea plant.", "Coffee is a brewed drink prepared from roasted coffee beans, which are the seeds of berries from the Coffea plant.", "The drink is served with a piece of cake.", "Wine is an alcoholic drink typically made from fermented grape juice.", "The most common pairing is a glass of wine.", "A cake is a type of sweet dessert which is typically baked. In their oldest forms, cakes were modifications of breads, but cakes now cover a wide range of preparations that can be simple or elaborate, and that share features with other desserts such as pastries, meringues, custards, and pies.", "Milk is a white liquid produced by the mammary glands of mammals.", "Milk is a white liquid produced by the mammary glands of mammals. It is the primary source of nutrition for infant mammals (including humans who breastfeed) before they are able to digest other types of food.", "A slice of banana bread with a cup of coffee.", "White wine is a kind of wine.", "Most cakes are baked in a rectangular or square form, using an oven. Some cakes are steamed, such as the chiffon cake and the humitas.", "The most common pairing for bread is wine."]