["The fuel of the flying object is helium.", "The balloon is filled with helium.", "The fuel used in hot air balloons is propane.", "The flying objects are fueled by helium.", "Helium is used to fill balloons.", "Balloons are driven by helium.", "The fuel that powers a hot air balloon is propane.", "Balloons are usually powered by hot air or hydrogen.", "Balloons are powered by hot air.", "A balloon is a flexible bag that can be inflated with a gas, such as helium, hydrogen, nitrous oxide, oxygen, air or water.", "A balloon is a flexible bag that can be inflated with a fluid, such as helium, hydrogen, nitrous oxide, oxygen, air or water.", "The helium balloons are the flying objects.", "The hot air balloon is fueled by propane gas.", "The main fuel used by aircraft is aviation fuel.", "The hot air balloon is a lighter-than-air aircraft consisting of a bag, called an envelope, which contains heated air.", "A flying object is powered by fuel.", "The clown fish is a small fish that lives among the tentacles of sea anemones.", "The clown fish is a small, brightly colored fish that lives among the tentacles of sea anemones.", "The clown fish is a fish.", "A clown fish is a small fish that lives in the ocean.", "Airplanes use jet fuel.", "A hot air balloon is a lighter-than-air aircraft consisting of a bag called an envelope which contains heated air. Suspended beneath is a gondola or wicker basket, which carries passengers and a source of heat, in most cases an open flame.", "Clownfish are a group of fish that are found in shallow waters of the Indian and Pacific Oceans. Clownfish are best known for their symbiotic relationship with sea anemones.", "The clown fish is a small fish that has a bright orange body with white stripes.", "Airplanes are fueled by jet fuel.", "The fuel is a mixture of kerosene and liquid oxygen.", "Clownfish are omnivorous.", "Balloons are made of light-weight, tough, flexible materials such as rubber, latex, polychloroprene, or a nylon fabric, and can be filled with air, helium, hydrogen, nitrous oxide, oxygen, or any other suitable gas.", "The clownfish is native to the Indian and Pacific Oceans.", "Clownfish or anemonefish are fishes from the subfamily Amphiprioninae in the family Pomacentridae.", "The clown fish is powered by the sun.", "Aircraft are propelled by one of two sources: rocket engines or jet engines.", "The hot air balloon is powered by a burner.", "The fuel for a rocket is carried within the rocket itself.", "Balloons are usually made of a light material, such as rubber, latex, polychloroprene, or a nylon fabric, and can come in many different colors.", "Most airplanes are powered by jet engines.", "The most common fuel used by helicopters is Jet A-1, which is a kerosene-based fuel, or Jet A, which is a kerosene-based fuel.", "Helium is the second lightest element and is the second most buoyant gas.", "The fuel of a rocket is usually a chemical substance called rocket fuel.", "Helium is a chemical element with symbol He and atomic number 2.", "Helium is a chemical element with symbol He and atomic number 2. It is a colorless, odorless, tasteless, non-toxic, inert, monatomic gas, the first in the noble gas group in the periodic table.", "A flying object is an object that is designed to move through the air.", "Hydrogen and oxygen."]