["a train is a form of rail transport consisting of a series of vehicles that usually runs along a rail track to transport cargo or passengers.", "A train is a form of rail transport consisting of a series of connected vehicles that generally runs along a rail track to transport cargo or passengers.", "A train is a form of rail transport consisting of a series of connected vehicles that generally runs along a railroad track to transport cargo or passengers.", "A train is a form of rail transport consisting of a series of connected vehicles that generally run along a railroad track to transport cargo or passengers.", "A train is a form of rail transport consisting of a series of connected vehicles that generally run along a railroad (or railway) track to transport cargo or passengers.", "A train is a form of transport consisting of a series of connected vehicles that generally runs along a railroad track to transport cargo or passengers.", "A train is a form of rail transport consisting of a series of connected vehicles that generally runs along a railroad track to transport cargo or passengers. Motive power is provided by a separate locomotive or individual motors in self-propelled multiple units.", "The train is a train.", "A passenger train is a train that carries passengers.", "A locomotive is a railway vehicle that provides the motive power for a train.", "A passenger train is a form of rail transport that carries passengers.", "This is a passenger train.", "The type of train is a red colored train.", "A locomotive or engine is a rail transport vehicle that provides the motive power for a train.", "The train is a train that travels between cities and towns.", "The train is a diesel train.", "A passenger train is one which includes passenger-carrying vehicles which can often be very long and fast.", "The red train is a subway train.", "A passenger train is one which includes passenger-carrying vehicles which can often be very long and fast. One notable and growing long-distance train category is high-speed rail.", "A passenger train or passenger rail service is a form of rail transport that carries passengers.", "A steam locomotive is a type of railway locomotive that produces its pulling power through a steam engine.", "The train is a diesel electric.", "A steam locomotive is a type of railway locomotive that produces its pulling power through a steam engine. These locomotives are fueled by burning combustible material usually coal, wood, or oil to produce steam in a boiler.", "The Red Train is a heritage railway line in the city of Adelaide, South Australia. It is one of the few remaining original tramways in Australia.", "The Red Train is a heritage railway in St. Augustine, Florida."]