["The fuel used by boats is gasoline.", "Boats use gasoline as fuel.", "The fuel used in powerboats is petrol or diesel.", "Boats use gasoline.", "Boats use diesel fuel.", "boats are powered by diesel and gasoline", "Boats run on gasoline.", "Boats take diesel fuel.", "Boats take gasoline.", "Boats are usually powered by diesel engines.", "Boats take fuel.", "Boats can be powered by a variety of fuels.", "Boats use gas as fuel.", "Boats are powered by gas, diesel or electric.", "Boats are typically powered by gasoline, diesel, or propane.", "Boats are powered by engines that run on gasoline, diesel fuel, or electricity.", "Boats can be powered by either gasoline or diesel engines.", "Boats are powered by gas.", "A boat takes fuel.", "Boats are propelled by a variety of fuel sources.", "The boats are powered by diesel.", "The boats take gasoline.", "Boats run on diesel.", "Boats can be powered by sails, oars, or motors.", "Boats are propelled by sails, oars, or motors.", "a boat is a watercraft of a large range of type and size.", "Diesel fuel", "Diesel fuel.", "Gasoline", "A boat is a watercraft of a large range of type and size. Ships are generally distinguished from boats based on their larger size, shape, and cargo or passenger capacity, and their ability to carry boats.", "Gasoline is a clear petroleum-derived flammable liquid that is used primarily as a fuel in internal combustion engines.", "Gasoline is a fuel made from crude oil and other petroleum liquids.", "A boat is a watercraft of a large range of sizes designed to float, plane, work or travel on water. Small boats are typically found on inland waterways such as rivers and lakes, or in protected coastal areas.", "Gasoline is a transparent, petroleum-derived liquid that is used primarily as a fuel in spark-ignited internal combustion engines.", "A boat is a watercraft of a large range of type and size. Ships are generally distinguished from boats based on their larger size, shape, and cargo or passenger capacity.", "Gasoline is a transparent, petroleum-derived liquid that is used primarily as a fuel in internal combustion engines.", "Fuel is any material that can be made to react with other substances so that it releases energy as heat energy or to be used for work.", "Gasoline.", "You can use regular gasoline, ethanol-free gasoline, or diesel fuel.", "Diesel fuel, in general, is any liquid fuel used in diesel engines, whose fuel ignition takes place, without any spark, as a result of compression of the inlet air mixture and then injection of fuel.", "gasoline, diesel, biodiesel, electric", "The fuel system of a gasoline engine is usually a carburetor or fuel injection.", "The fuel used in small outboard motors is a four-stroke gasoline fuel.", "Gasoline, oil, electricity, solar energy"]