["The most popular flavor of doughnuts is glazed.", "The most popular flavor of doughnut is glazed.", "Glazed is the most popular flavor of donuts.", "The glazed donut is the most popular flavor.", "The most popular flavor of donut is glazed.", "The most popular donut flavor is the plain glazed.", "Glazed donuts are the most popular flavor of donuts.", "The most popular flavor of doughnut is the glazed doughnut.", "The most popular flavor of donut is chocolate glazed.", "Glazed donuts are the most popular flavor of this kind of pastry.", "Glazed donuts is the most popular flavor of this kind of pastry.", "The most popular flavor of this kind of pastry is glazed donuts.", "Glazed donuts are the most popular.", "Glazed doughnuts are the most popular.", "Glazed doughnuts are the most popular doughnut flavor in America.", "Glazed donuts are the most popular kind of donuts.", "Glazed donuts are popular.", "The most popular flavors of doughnuts are chocolate frosted, glazed, and powdered.", "Glazed, cinnamon, and powdered are the most popular flavors of donuts.", "The most popular doughnut is the glazed doughnut.", "The top five most popular donut flavors are glazed, chocolate, chocolate frosted, cinnamon, and jelly-filled.", "The most popular flavor of donuts is chocolate.", "Glazed is the most popular flavor.", "Glazed is the most popular flavor of this kind of pastry.", "The most popular flavor of this kind of pastry is glazed.", "The most popular flavor of this kind of pastry is chocolate glazed.", "The glazed doughnut is a variety of doughnut usually coated with sugar and often topped with either sugar crystals or a glaze.", "Glazed doughnuts are sometimes covered in a shiny glaze, which can be chocolate, powdered sugar, or vanilla.", "The glazed doughnut is a variety of doughnut usually coated in a glaze.", "A doughnut or donut (both: /ˈdoʊnət/ or /ˈdoʊnʌt/; see spelling differences) is a type of fried dough confectionery or dessert food. The doughnut is popular in many countries and prepared in various forms as a sweet snack that can be homemade or purchased in bakeries, supermarkets, food stalls, and franchised specialty vendors.", "Doughnuts are fried dough foods.", "The most popular flavor of this kind of pastry is chocolate.", "Doughnuts are a type of fried dough confectionery or dessert food.", "In the United States, the most common donut is the ring donut, which is formed by joining the ends of a long, skinny piece of dough into a ring or by using a doughnut cutter, which simultaneously cuts the outside and inside shape, leaving a doughnut-shaped piece of dough and a doughnut hole from dough removed from the center.", "Glazed", "Vanilla is the most popular flavor of ice cream."]