["A red container is a red box.", "The red container is a trash can.", "A red container is used for storing water.", "A parking meter is a device used to collect money in exchange for the right to park a vehicle in a particular place for a limited amount of time.", "The red container is a fire hydrant.", "You can get water from the red container.", "There is a red container sitting upon the sidewalk in the background of this photo.", "The red container is a mailbox.", "The red container in the background is a fire hydrant. Fire hydrants are one of the most important tools in fighting fires.", "You can typically get water out of the red container sitting upon the sidewalk in the background of this photo.", "A parking meter is a device used to collect money in exchange for the right to park a vehicle in a particular place for a limited amount of time. Parking meters can be used by municipalities to enforce their integrated parking policy.", "A parking meter is a device used to collect money in exchange for the right to park a vehicle in a particular place for a limited amount of time. Parking meters can be used by municipalities as a tool for enforcing their integrated on-street parking policy.", "Red boxes are typically used for recycling glass bottles.", "A motorcycle is a two-wheeled motor vehicle.", "A motorcycle is a vehicle that has two wheels and is powered by a motor.", "A sidewalk is a path for pedestrians. It is normally separated from the vehicular section by a curb.", "A sidewalk is a path for pedestrians beside a street.", "A motorcycle, often called a bike, motorbike, or cycle, is a two- or three-wheeled motor vehicle.", "A motorcycle, motorbike, or motor is a two- or three-wheeled motor vehicle. Motorcycle design varies greatly to suit a range of different purposes: long distance travel, commuting, cruising, sport including racing, and off-road riding.", "It is a motorcycle.", "a parking ticket", "Red boxes are often used for the collection of used clothing.", "You can get water from a water fountain.", "You can get a parking ticket if you park your motorcycle in a place you are not allowed to park.", "A pay phone is typically able to be used to get out of the red container sitting upon the sidewalk in the background of this photo.", "Redbox is an American company specializing in DVD, Blu-ray, 4K UHD and video game rentals via automated retail kiosks.", "A water fountain.", "A fire hydrant is a connection point by which firefighters can tap into a water supply.", "The container is a trash can."]