["Urinals are primarily used by men to urinate.", "Urinals are used by men.", "Urinals are primarily used by males.", "The urinals are for men to use.", "The urinals are used by men.", "Urinals are commonly used by men and boys.", "Men use urinals.", "Urinals are used by males to urinate.", "A urinal is a sanitary plumbing fixture for urination only, primarily used by males.", "A urinal is a sanitary plumbing fixture for urination only, predominantly used by males.", "Urinals are a specialized type of plumbing fixture for urination only, generally used by males.", "The urinal is a sanitary plumbing fixture for urination only, generally by men and boys.", "A urinal is a specialized toilet for urinating only, generally by men and boys.", "Urinals are generally intended for men to urinate into.", "Men use urinals, women use toilets.", "Urinals are primarily male toilets.", "A urinal is a sanitary plumbing fixture for urination only, predominantly used by males. It can take the form of a container or simply a wall, with drainage and automatic or manual flushing, or without flush water as is the case for waterless urinals.", "The urinal is a sanitary plumbing fixture for urination only, predominantly used by males. It can take the form of a container or simply a wall, with drainage and automatic or manual flushing, or without flush water as is the case for waterless urinals.", "A urinal is a sanitary plumbing fixture for urination only, generally by men and boys. It is a small, bowl-shaped toilet without a toilet seat.", "Urinals are commonly used in public toilets.", "A urinal is a sanitary plumbing fixture for urination only.", "Urinals are intended for the use of only one person at a time, and are usually used by adult males.", "The urinals are installed in the bathrooms of men.", "Urinals are primarily intended for urination only, as a sanitary measure and for the sake of convenience, since urination is usually a simple and quick event, and using a urinal allows a person to use the restroom without waiting in line for a stall.", "An urinal (also called a pisser, piss pot, urinal pot, lavabo, jakes, water-closet, or dunny) is a specialized toilet for urinating only, generally by men and boys.", "Urinals are primarily used for urination, but are also used for other activities such as spitting into, rinsing out containers such as a gourd or a bota, and as a spittoon.", "Men would use these.", "Men", "Men.", "people"]