["Fried eggs are eggs cooked by frying.", "Eggs are usually fried in a pan with oil or butter.", "The eggs are fried.", "Eggs are usually prepared by cooking.", "Fried eggs are cooked by frying.", "Fried eggs are cooked by frying in a pan.", "The two eggs are prepared by frying.", "Fried eggs are prepared by cooking the egg in a pan.", "Eggs are boiled, fried, scrambled, or poached.", "Fried eggs are eggs cooked by being fried, usually in a pan. They are a popular breakfast dish.", "Eggs are often fried in a pan with butter or oil.", "Fried eggs are eggs cooked by frying them in oil or butter, with their yolks and whites cooked simultaneously.", "Eggs are usually fried before eating.", "Fried eggs are eggs cooked by frying in oil or butter, in a frying pan.", "Fried eggs are eggs cooked by frying them in oil or butter, in a frying pan.", "Fried eggs are cooked by frying them in oil or butter, in a frying pan.", "fried egg is a type of egg.", "Fried eggs are cooked in hot fat like butter.", "Fried eggs are typically cooked until the whites are set and the yolks are thickened, but not hard.", "Two eggs are fried in a pan over medium heat.", "The two eggs are fried.", "The eggs on the plate are fried.", "A fried egg is a cooked dish commonly made using a fresh hen's egg, fried whole with minimal accompaniment.", "The two eggs on the plate are fried.", "Fried eggs are a common breakfast food.", "A fried egg is an egg that has been fried with minimal accompaniment.", "Eggs can be prepared in a variety of ways.", "The egg is a protein food that is very nutritious and can be prepared in many ways.", "An egg is a food made by a chicken.", "Over easy eggs are fried on both sides, but for a very short time.", "The best way to fry an egg is to use a non-stick pan.", "Eggs are a healthy and nutritious food. They are low in calories and high in protein.", "Sunny-side up describes an egg that is fried with the yolk up and is not flipped.", "Eggs are laid by female animals of many different species, including birds, reptiles, amphibians, and fish, and have been eaten by humans for thousands of years.", "Eggs are laid by female animals of many different species, including birds, reptiles, amphibians, mammals, and fish, and have been eaten by humans for thousands of years.", "Soft-boiled eggs are cooked in their shells in boiling water for 3 to 5 minutes, depending on how well done you want the yolk. Hard-boiled eggs are cooked in their shells in boiling water for 10 to 12 minutes."]