["A room attendant is a person who works in the housekeeping department of a hotel.", "The hotel housekeeper cleans and maintains hotel rooms and suites.", "A chambermaid or a housekeeper is a person who cleans and maintains the rooms in a hotel or other lodging establishment.", "A hotel room attendant is a person who cleans and services hotel rooms.", "A housekeeper is an individual who is employed to maintain the cleanliness and hygiene of a house.", "A maid is a female professional who cleans and maintains private households or commercial establishments such as hotels and hospitals.", "The professional name of a person that tends to the types of rooms featured in this photo is a housekeeper.", "The professional name of a person that tends to the types of rooms featured in this photo is called a housekeeper.", "A room attendant is a person who cleans and maintains the rooms of a hotel, motel or other lodging facility.", "A housekeeper is a domestic worker employed to clean, maintain and manage a private residence.", "A housekeeper is a person employed to manage a household, and the domestic staff.", "A room attendant is an employee of the tourism or hospitality organization, and is responsible for daily cleaning services in hotel rooms, cruises, or other lodging facilities.", "A housekeeper is a domestic worker employed to do household cleaning and related housekeeping tasks.", "A chambermaid or a room attendant is a person who cleans rooms and makes beds in a hotel, motel, resort, or other establishment that provides accommodation.", "A hotel attendant is a person who works in a hotel.", "A chambermaid is a female domestic worker who cleans and maintains bedrooms, bathrooms, and other areas of a hotel.", "A maid is a female housekeeper.", "A chambermaid, also known as a chambermaid, is a maid who specializes in cleaning bedrooms and bathrooms.", "A housekeeper is a person employed to manage a household, and the domestic staff. Other responsibilities may include cooking, laundry and ironing, grocery shopping, cleaning, and bill pay.", "A maid, or housemaid or maidservant, is a female domestic worker.", "housekeeper", "A maid is a female servant.", "A maid is a female domestic worker.", "A hotel manager, hotelier, or lodging manager is a person who manages the operation of a hotel, motel, resort, or other lodging-related establishment.", "A hotel porter is a person who assists guests with their luggage while checking in or out of a hotel.", "A hotel is an establishment that provides paid lodging on a short-term basis. Facilities provided may range from a modest-quality mattress in a small room to large suites with bigger, higher-quality beds, a dresser, a refrigerator and other kitchen facilities, upholstered chairs, a flat screen television, and en-suite bathrooms.", "A hotel concierge is a person who helps guests obtain tickets, tours, and other services.", "A hotel is an establishment that provides paid lodging on a short-term basis.", "In the United States, a hotel is an establishment that provides paid lodging on a short-term basis.", "A bellhop or hotel porter is a hotel porter, who helps patrons with their luggage while checking in or out."]