["A car is a vehicle that is driven on the road.", "The car to the right is driving.", "The car is driving.", "The car is making a turn.", "Cars drive on the right side of the road.", "The car to the right is parked.", "The car is turning right at the intersection.", "The car is waiting to make a turn.", "The car to the right is waiting at an intersection.", "The car to the right is driving in the right lane.", "The car to the right is waiting at a red light.", "The car to the right is stopped.", "The car to the right is stopped at a red light.", "The car to the right is driving on the wrong side of the road.", "The car on the right is turning right.", "The car to the right is stopping.", "The car to the right is driving on a highway.", "The car to the right is waiting at the stop sign.", "The car on the right is red. The car on the right is parked.", "The car is driving on the road.", "The car is parked.", "A car (or automobile) is a wheeled motor vehicle used for transportation.", "A car is a wheeled motor vehicle used for transportation.", "Cars are typically parked in driveways or streets.", "A car (or automobile) is a wheeled motor vehicle used for transportation. Most definitions of the term specify that cars are designed to run primarily on roads, to have seating for one to eight people, to typically have four wheels, and to be constructed principally for the transport of people rather than goods.", "A car is a wheeled, self-powered motor vehicle used for transportation and a product of the automotive industry.", "A car (or automobile) is a wheeled motor vehicle used for transportation. Most definitions of car say they run primarily on roads, seat one to eight people, have four tires, and mainly transport people rather than goods.", "Driving is the controlled operation and movement of a motorized vehicle with wheels, such as a car, truck, or bus.", "Driving is the controlled operation and movement of a motorized vehicle with wheels, such as a car, truck, or bus, by either a human or computer controller.", "A car is a wheeled, self-powered motor vehicle used for transportation.", "The car is waiting at the intersection.", "The car is driving down the road.", "The car is waiting at a traffic light.", "The car is waiting at a red light.", "The car is stopped at a stop sign.", "Driving", "It's waiting for a red light.", "The car is driving down the highway.", "Parking.", "The car is parked in a parking lot.", "Parked cars are not moving.", "Driving.", "It is waiting."]