["A bus is a road vehicle designed to carry many passengers.", "Bus is a road vehicle designed to carry many passengers.", "This lot holds school buses.", "A bus is a large motor vehicle used to carry passengers.", "The parking lot holds school buses.", "A bus is a road vehicle designed to carry passengers.", "A bus is a large motor vehicle used to transport passengers.", "A bus is a road vehicle designed to carry many passengers. Buses can have a capacity as high as 300 passengers. The most common type of bus is the single-deck rigid bus, with larger loads carried by double-decker and articulated buses, and smaller loads carried by midibuses and minibuses; coaches are used for longer-distance services.", "This lot holds buses.", "The lot holds buses.", "School buses", "school buses", "a bus is a large motor vehicle, typically one serving as a public conveyance on a fixed route and for a fixed fare.", "A bus is a large wheeled vehicle.", "The lot holds school buses.", "A school bus is a type of bus owned, leased, contracted to, or operated by a school or school district.", "A school bus is a type of bus owned, leased, contracted to, or operated by a school or school district. It is regularly used to transport students to and from school or school-related activities, but not including a charter bus or transit bus.", "A school bus is a type of bus owned, leased, contracted to, or operated by a school or school district and regularly used to transport students to and from school or school-related activities, but not including a charter bus or transit bus.", "School bus is a type of bus owned, leased, contracted to, or operated by a school or school district and regularly used to transport students to and from school or school-related activities, but not including a charter bus or transit bus.", "A bus (archaically also omnibus, multibus, motorbus, autobus) is a road vehicle designed to carry many passengers.", "A bus (contracted from omnibus, with variants multibus, motorbus, autobus, etc.) is a road vehicle designed to carry many passengers.", "Buses, coaches, and minibuses.", "School buses are yellow.", "Parking lot", "A parking lot is a place where vehicles are parked.", "A parking lot is a cleared area that is intended for parking vehicles."]