["Decorative objects are ornamental items used to enhance the appearance of a room, table, etc.", "Decorative objects are those objects that are used to enhance the beauty of the home.", "Pineapples are used as decorative objects.", "The objects are decorative.", "A pineapple is a tropical plant with an edible fruit and the most economically significant plant in the family Bromeliaceae.", "They are decorative.", "A pineapple is a tropical plant with an edible multiple fruit consisting of coalesced berries, also called pineapples, and the most economically significant plant in the family Bromeliaceae.", "A pineapple is a tropical plant with edible multiple fruit consisting of coalesced berries, also called pineapples, and the most economically significant plant in the family Bromeliaceae.", "The pineapple is a tropical plant with an edible multiple fruit consisting of coalesced berries, also called pineapples, and the most economically significant plant in the family Bromeliaceae.", "The pineapple is a tropical plant with edible multiple fruit consisting of coalesced berries, also called pineapples, and the most economically significant plant in the family Bromeliaceae.", "The pineapple is a tropical plant with an edible fruit, also called a pineapple, and the most economically significant plant in the family Bromeliaceae.", "Pineapple is a tropical plant with an edible multiple fruit consisting of coalesced berries, also called pineapples, and the most economically significant plant in the family Bromeliaceae.", "A pineapple is a tropical fruit that is edible.", "A pineapple is an edible fruit – the most economically significant plant in the family Bromeliaceae.", "A pineapple is a fruit.", "a pineapple is a fruit", "Pineapples are a tropical fruit.", "Pineapples are used as a food and as a decorative plant.", "The pineapple is a fruit.", "A pineapple is a tropical plant with an edible fruit and tough, spiky leaves. Pineapples may be cultivated from a crown cutting of the fruit, possibly flowering in 20–24 months and fruiting in the following six months.", "The pineapple (Ananas comosus) is a tropical plant with an edible multiple fruit consisting of coalesced berries, also called pineapples, and the most economically significant plant in the family Bromeliaceae.", "A pineapple is a tropical fruit and is the most economically significant plant in the family Bromeliaceae.", "Pineapples are edible.", "A garden is a plot of ground, usually near a house, where flowers, shrubs, vegetables, fruits, or herbs are cultivated.", "A garden is a planned space, usually outdoors, set aside for the display, cultivation, and enjoyment of plants and other forms of nature.", "A train is a form of rail transport consisting of a series of connected vehicles that generally run along a railroad track to transport cargo or passengers.", "A train is a form of rail transport consisting of a series of connected vehicles that generally run along a railroad (or railway) track to transport passengers or cargo (also known as \"freight\" or \"goods\").", "The pineapples are decorative.", "pineapples are used in cooking.", "Pineapples are used to make jam, juice, pies, ice cream, and candy, as well as in fruit salads.", "Pineapples may be cultivated from a crown cutting of the fruit, possibly flowering in 20–24 months and fruiting in the following six months.", "A decorative object is an object that is beautiful or aesthetic, without being strictly necessary.", "Pineapples are the only bromeliad fruit in widespread cultivation.", "Decorative arts are arts or crafts that are considered to have purely aesthetic value.", "Garden ornaments are used to enhance the landscape and create visual interest in the garden.", "The objects are useful.", "Decorative stones are used in gardens, landscaping, patios, and elsewhere."]