["Snakes are carnivorous reptiles that eat small insects, worms, and other animals.", "Snakes are carnivores. They generally eat small animals like frogs, lizards, and rodents.", "Snakes are carnivorous reptiles. They eat small animals such as birds, frogs, and mammals.", "Snakes generally eat worms.", "Snakes eat small birds and mammals, lizards, frogs, fish, and insects.", "Snakes are carnivores and eat small mammals, birds, reptiles, amphibians, and fish.", "Snakes eat a variety of animals such as other snakes, rodents, birds, lizards and fish.", "Snakes are carnivores. They eat small mammals, birds, eggs, fish, frogs, other reptiles, insects, worms and slugs.", "Snakes are carnivorous reptiles that eat small animals, such as rodents and birds.", "Snakes are carnivores. They eat rodents, insects, birds, eggs and other snakes.", "Snakes eat small animals like mice and frogs.", "Snakes are carnivores that eat a variety of animals, including small mammals, small birds, fish, frogs, insects, worms, and other reptiles.", "Snakes are carnivores. They eat a wide variety of prey including other snakes, lizards, frogs, birds and their eggs, and small mammals such as rodents.", "Snakes eat small animals, birds, eggs, fish, insects, snails, worms, and small reptiles.", "Snakes are carnivores (meat eaters). They eat small animals including lizards, other snakes, small mammals, birds, eggs, fish, snails or insects.", "Snakes are carnivores, which means they eat meat. Snakes eat a variety of smaller animals, such as lizards, rodents, birds, and eggs.", "Snakes eat a variety of animals, including small mammals, birds, reptiles, amphibians, fish, insects and other invertebrates.", "Most snakes are carnivores and eat small animals including lizards, other snakes, small mammals, birds, eggs, fish, snails or insects.", "Snakes eat insects.", "Snakes are carnivorous reptiles that eat small animals.", "Snakes are carnivorous reptiles that eat small animals including lizards, other snakes, small mammals, birds, eggs, fish, snails or insects.", "Snakes eat a variety of things, including rodents, birds, eggs, fish, insects, worms, and other snakes.", "Snakes eat rodents and insects.", "Snakes are carnivorous animals that eat insects and other animals, such as mice and birds.", "The snake eats slugs.", "Snakes are carnivores or meat eaters. They eat small animals like mice, frogs, and birds. Some snakes even eat other snakes.", "snakes eat mice, rats, and other small animals.", "Snakes eat worms", "Snakes are carnivorous reptiles.", "A snake is a carnivorous reptile that eats other animals.", "Snakes are carnivores.", "The worm snake generally eats earthworms and other invertebrates.", "Snakes eat mice and other small animals. They eat them whole, so they have to be able to swallow animals that are bigger than their heads.", "A snake is a long, legless, carnivorous reptile.", "Snakes are carnivorous reptiles. Snakes are carnivorous reptiles. Snakes are carnivorous reptiles.", "A snake is one of several animals that is a reptile.", "Snakes are elongated, legless, carnivorous reptiles of the suborder Serpentes. Like all squamates, snakes are ectothermic, amniote vertebrates covered in overlapping scales.", "Snakes are elongated, legless, carnivorous reptiles of the suborder Serpentes.", "A snake is a reptile which is limbless, elongated, flexible, and carnivorous.", "Lizards are cold-blooded. They eat insects and small animals.", "They eat worms.", "Slugs eat decaying plant matter and fungi.", "Worms are invertebrates.", "Slug is a common name for any apparently shell-less terrestrial gastropod mollusc.", "Worms are usually fed on plants.", "A sliter wormk is a carnivore.", "lizard is a cold-blooded reptile with scaly skin, a long body and tail, and four legs with five toes on each foot."]