["The bedspread was bought at Bed Bath & Beyond.", "A bedspread is a decorative covering for a bed.", "Bedspread is a decorative bed cover.", "A bedspread is a decorative bed covering that is placed over a bed.", "A bedspread is a decorative bed covering that is placed over a bed as bedding.", "A bedspread is a decorative covering that is intended to cover the entire bed.", "A bedspread is a decorative bed covering that spreads over the entire bed, including the mattress, box spring, and bed frame.", "Bedspread is a bed cover.", "A bedspread is a decorative bed covering that is placed over the bed's fitted sheet.", "A bedspread is a decorative covering that is intended to cover the entire bed, including the mattress, box spring, and pillows.", "A bedspread is a decorative covering that is intended to cover the entire bed, including the mattress, box spring and pillows.", "A bedspread is a decorative bed cover, usually placed over a thinner bed cover for aesthetic purposes.", "A bedspread is a decorative bed covering that is placed over the top of a bed to provide warmth, decoration and protection.", "A bedspread is a decorative covering that is intended to cover the entire bed, including the mattress, box spring, and bed frame.", "A bedspread is a decorative bed covering that is placed over a bed to add style or warmth to the room.", "A bedspread is a decorative bed cover intended to cover the entire bed, including the mattress, box spring, and bed frame.", "A bedspread is a decorative cover intended to cover the entire bed, including the mattress, box spring, and bed frame.", "A bedspread is a decorative bed covering that is placed over the bed's regular bedding and is intended for decoration, warmth, and protection of the bed's mattress and pillows.", "A bedspread is a decorative bed covering that extends down to or nearly to the floor and covers the sides of the bed.", "Bedspreads are used as a decorative cover for the bed.", "Bed bath and beyond is a store that sells bedspreads.", "Bedspreads are used to cover the bed.", "Bed, Bath, and Beyond sells bedspreads.", "Bedspreads are often bought in a store.", "The word \"bedspread\" is a general term for any decorative covering that is intended to cover a bed.", "The bedspread was bought from a store.", "The bedspread was bought at a store.", "Bedspreads are usually bought in bedding stores.", "Bedspreads are used as a decorative covering to keep the sleeper warm and are typically placed between the mattress and the bed frame, leaving the area below the bed free for storage.", "Bedspread was bought at Target.", "This bedspread was bought in a store.", "Bedspreads are usually sold in department stores, furniture stores and bedding stores.", "Bedspreads are used as a decorative bed covering to keep the sleeper warm, and are typically intended for use on a bed over a fitted sheet.", "Bedspreads are usually purchased at department stores.", "The bedspread was bought at Target.", "Bedspreads are usually made of cotton or polyester.", "The bedspread is black and white.", "Bedspreads are intended to cover the entire bed, including the mattress, box spring, and bed frame.", "Bed Bath & Beyond is a home goods retailer.", "Bed Bath & Beyond Inc. is an American chain of domestic merchandise retail stores in the United States, Puerto Rico, Canada and Mexico.", "Bed bath and beyond.", "The comforter was bought."]