["The second light means stop.", "The second light means that the car is going to stop.", "The red light means stop.", "The second light means to stop.", "The second light means that the traffic light is green.", "A red light means stop.", "The second light is a stop light.", "A traffic light, also known as a traffic signal, stop light, stop-and-go lights, robot or semaphore, is a signaling device at a road intersection, pedestrian crossing, or other location.", "A traffic light, also known as a traffic signal, stop light, stop-and-go lights, robot or semaphore, is a signaling device positioned at a road intersection, pedestrian crossing, or other location.", "A traffic light, also known as a traffic signal, traffic lamp, stoplight, stop sign, traffic semaphore, signal light, stop-and-go lights, robot or traffic controller, is a signaling device located at a road intersection, pedestrian crossing, or other location. Its purpose is to indicate, using a series of colors, the correct moment to stop, drive or proceed.", "The second light means, no right turn.", "The yellow light means the light is about to turn red.", "The yellow light means that the light is about to turn red.", "The second light is a yellow light.", "A traffic light is a signaling device at a road intersection, pedestrian crossing, or other location.", "A stop sign is a traffic sign to notify drivers that they must stop before proceeding.", "The second light means the driver can proceed with caution.", "The second light means that you can proceed.", "A traffic light is a light used to control the flow of traffic at intersections.", "The green light means go.", "green light means go.", "Yellow light means slow down, but keep going.", "A stop sign is a traffic sign to notify drivers that they must make sure no cars are coming and slow down before proceeding.", "Traffic sign is a type of sign which conveys a message related to road traffic and road user safety.", "The stop signal is shown in the mirror.", "A red-light camera is a type of traffic enforcement camera that captures an image of a vehicle which has entered an intersection in spite of the traffic signal indicating red.", "Red means stop.", "The stop signal is shown in the mirror and it reflects a car.", "It means to stop."]