["The pizza has a deep dish crust.", "The pizza crust is a deep dish or pan pizza.", "A deep dish pizza has a thick crust.", "This pizza has a deep dish crust.", "Deep-dish pizza has a thick crust.", "Deep dish pizza has a thick crust.", "The pizza has a deep crust.", "This pizza has a deep crust.", "Deep dish pizza has a thick, crust", "This pizza has a thick crust.", "deep dish pizza is a thick crust with cheese and toppings.", "The pizza has a thin crust.", "A deep-dish pizza has a thick crust which resembles a pie crust.", "This pizza has a thin crust.", "Pizza crust is a food that is made with flour, water and yeast.", "The crust of a deep dish pizza is thicker and more doughy than a regular pizza.", "The crust of a pizza is made from bread dough, which is flattened and covered with tomato sauce, cheese and other toppings.", "Pizza crust is the outer part of a pizza. It is usually made of flour, water, and yeast.", "A pizza crust is the bottom of a pizza.", "A pizza crust is the bottom part of a pizza.", "Pizza crust is a thin, flat bread generally used as a base for a pizza.", "Deep dish pizza is a form of pizza.", "Pizza crust can be made from a variety of ingredients.", "A thin crust pizza has a crust that is thin and crisp.", "Pizza is a traditional Italian dish consisting of a yeasted flatbread typically topped with tomato sauce and cheese and baked in an oven.", "A deep-dish pizza is a thick pizza made with a very deep round pan. The crust is usually two to three inches tall and gets slightly fried due to the oil in the pan. The pizza is usually made with a variety of toppings.", "Pizza is an oven-baked, flat, disc-shaped bread typically topped with a tomato sauce, cheese and various toppings.", "Pizza crust is traditionally plain, but may also be seasoned with garlic or herbs, or stuffed with cheese.", "Deep-dish pizza is a thick pizza baked in a deep dish pan.", "Pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients baked at a high temperature, traditionally in a wood-fired oven.", "A pizza is a flatbread generally topped with tomato sauce and cheese and baked in an oven. It is commonly topped with a selection of meats, vegetables and condiments.", "Deep dish pizza is a thick pizza baked in a deep dish pan.", "Pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients (anchovies, olives, meat, etc.) baked at a high temperature, traditionally in a wood-fired oven.", "Deep dish pizza is a thick pizza with a crust that is usually 2–3 inches tall and gets slightly fried due to the oil in the pan.", "The crust of a pizza is the bottom part of the pizza.", "A pizza is a flatbread generally topped with tomato sauce and cheese and baked in an oven. It is commonly topped with a selection of meats, vegetables and condiments. The term was first recorded in the 10th century, in a Latin manuscript from Gaeta in Central Italy.", "A pizza is a round, open pie made with yeast dough and topped with tomatoes, cheese, and various other ingredients (anchovies, olives, meat, etc.) baked at a high temperature, traditionally in a wood-fired oven. In formal settings, like a restaurant, pizza is eaten with knife and fork, but in casual settings it is cut into wedges to be eaten while held in the hand. Small pizzas are sometimes called pizzettas.", "Pizza is a type of bread and sauce dish, often served with cheese.", "A pan pizza is a style of pizza baked in a deep dish pan.", "Pizza crust is a savory, yeast-leavened dough prepared according to one of several pizza dough recipes.", "Pizza crusts are made from different types of flour.", "The crust is made from dough."]