["Furniture refers to movable objects intended to support various human activities such as seating (e.g., chairs, stools, and sofas), eating, and sleeping (e.g., beds).", "You can buy beds at furniture stores.", "Bedroom furniture is furniture that is in a bedroom.", "Furniture is sold in furniture stores.", "The bed is for sale in a furniture store.", "Furniture is the mass noun for the movable objects intended to support various human activities such as seating (e.g., chairs, stools, and sofas), eating (tables), and sleeping (e.g., beds). Furniture is also used to hold objects at a convenient height for work (as horizontal surfaces above the ground, such as tables and desks), or to store things (e.g., cupboards and shelves).", "Furniture is the mass noun for the movable objects intended to support various human activities such as seating and sleeping in beds, to hold objects at a convenient height for work using horizontal surfaces above the ground, or to store things.", "Furniture is the mass noun for the movable objects intended to support various human activities such as seating (e.g., chairs, stools, and sofas), eating (tables), and sleeping (e.g., beds).", "You can buy this type of furniture at a furniture store.", "There are many furniture stores.", "You can buy furniture from a furniture store or from a department store.", "You can buy furniture from IKEA.", "You can buy this type of furniture at Ikea.", "Furniture is the mass noun for the movable objects ('mobile' in Latin languages) intended to support various human activities such as seating and sleeping in beds, to hold objects at a convenient height for work using horizontal surfaces above the ground, or to store things.", "Furniture can be purchased from a furniture store, from a department store (that has a furniture department), or from a specialty store (that sells only furniture).", "You can buy this type of furniture in Ikea.", "A furniture store is a business that sells furniture.", "You can buy a bed at a furniture store.", "The furniture store is a retail store that sells furniture.", "A bed is a piece of furniture which is used as a place to sleep or relax. Most modern beds consist of a soft, cushioned mattress on a bed frame, the mattress resting either on a solid base, often wood slats, or a sprung base.", "the bed is a piece of furniture.", "The furniture market is the market for furniture.", "A furniture store is a retail outlet selling furniture.", "Beds are furniture pieces used for sleeping.", "You can buy furniture in IKEA, Courts, Harvey Norman, and Mustafa.", "The bed is a piece of furniture that is used for sleeping or resting.", "A bed is a piece of furniture which is used as a place to sleep or relax.", "The bed is a piece of furniture used as a place to sleep or relax.", "The bed is a piece of furniture which is used as a place to sleep or relax. Most modern beds consist of a soft, cushioned mattress on a bed frame, the mattress resting either on a solid base, often wood slats, or a sprung base.", "Bed Bath & Beyond, IKEA, Target, Walmart, etc.", "A canopy bed is a decorative bed somewhat similar to a four-poster bed. A typical canopy bed usually features posts at each of the four corners extending four feet high or more above the mattress.", "A four-poster bed is a bed with four vertical columns, one in each corner, that support a tester, or upper usually rectangular panel. This tester or panel will often have rails to allow curtains to be pulled around the bed."]