["Apple is the fruit that is used to make juice.", "The fruit is apple.", "The fruit juice is made from apples.", "The fruit used is apple.", "The juice is made from apples.", "An apple is a sweet, edible fruit produced by an apple tree.", "Apple juice is a fruit juice made by the maceration and pressing of an apple.", "Apple juice is made from apples.", "Apple is a fruit, the pomaceous fruit of the apple tree, species Malus domestica in the rose family (Rosaceae). It is one of the most widely cultivated tree fruits, and the most widely known of the many members of genus Malus that are used by humans.", "Apple juice is made by the maceration and pressing of an apple.", "The beverage is made from apples.", "The fruit used to make the beverage in the jugs is apple.", "The fruit used to make the beverage in the jugs is apples.", "The beverage is made from apple juice.", "Apple juice is a fruit juice made by the maceration and pressing of an apple. The resulting expelled juice may be further treated by enzymatic and centrifugal clarification to remove the starch and pectin, which holds fine particulate in suspension, and then pasteurized for packaging in glass, metal or aseptic processing system containers, or further treated by dehydration processes to a concentrate.", "Fruit juice is a liquid that is naturally contained in fruit or vegetable tissue. Juice is prepared by mechanically squeezing or macerating fruit or vegetable flesh without the application of heat or solvents.", "Juice is a drink made from fruit, such as apples, oranges, and pears.", "Fruit juice is a liquid that is naturally contained in fruit and vegetable tissue.", "An apple is a sweet, edible fruit produced by an apple tree. Apple trees are cultivated worldwide, and are the most widely grown species in the genus Malus.", "Apples are the pomaceous fruit of the apple tree, species Malus domestica in the rose family (Rosaceae). It is one of the most widely cultivated tree fruits, and the most widely known of the many members of genus Malus that are used by humans.", "Apple cider or apple juice is a fruit juice made by the maceration and pressing of apples.", "The beverage in the image is apple juice.", "Apples are grown commercially in many countries.", "Apples are one of the most widely cultivated tree fruits, and the most widely known of the many members of genus Malus that are used by humans. Apples grow on small, deciduous trees. The tree originated in Central Asia, where its wild ancestor, Malus sieversii, is still found today.", "A fruit is the seed-bearing structure in flowering plants formed from the ovary after flowering.", "The fruit is the ripened ovary—together with seeds—of a flowering plant.", "A fruit is the seed-bearing structure in flowering plants (also known as angiosperms) formed from the ovary after flowering.", "The apple is a deciduous tree, generally standing 6 to 15 ft (1.8 to 4.6 m) tall in cultivation and up to 30 ft (9.1 m) in the wild."]