["Apple is a brand of computer, phone, and tablet.", "Apple is a brand of phone.", "Apple is a brand of phones.", "Apple is a company that manufactures phones and computers.", "Apple is a brand of electronics, especially computers and smart phones.", "Apple makes computers and phones.", "Apple computers are associated with iPhones.", "Apple is the brand of an iPhone.", "An Apple Computer is a computer that is manufactured by Apple Inc.", "Apple is a brand of computer.", "Apple is an American multinational corporation that designs and manufactures consumer electronics and software products.", "Apple iPhone is a line of smartphones designed and marketed by Apple Inc.", "Apple makes the iPhone.", "Apple, Inc. is an American multinational technology company headquartered in Cupertino, California, that designs, develops, and sells consumer electronics, computer software, and online services.", "Apple is an American multinational technology company headquartered in Cupertino, California, that designs, develops, and sells consumer electronics, computer software, and online services.", "Apple Inc. is an American multinational technology company headquartered in Cupertino, California, that designs, develops, and sells consumer electronics, computer software, and online services.", "Apple Inc. is an American multinational technology company headquartered in Cupertino, California that designs, develops, and sells consumer electronics, computer software, and online services.", "The apple logo is a brand of computers.", "Apple computers are computers that use the Apple operating system.", "An iPhone is a smartphone made by Apple Inc.", "iPhone is a line of smartphones designed and marketed by Apple Inc.", "Apple products are sold by Apple Inc.", "The iPhone is a line of smartphones designed and marketed by Apple Inc.", "The Apple logo is a computer hardware and software company.", "An iPhone is a line of smartphones designed and marketed by Apple Inc.", "The apple logo is on the laptop.", "iPhone.", "Iphone.", "The phone is an iPhone.", "Phones are associated with computers.", "The laptop is an Apple MacBook.", "Apple is a genus of flowering plants that includes the apple and crabapple, which are the most widely cultivated species.", "The woman is looking at an Apple laptop."]