["Pizza is unhealthy.", "Pizza is an unhealthy food.", "Pizza can be unhealthy if it has a lot of toppings and cheese.", "The healthy food is pizza.", "Pizza is very unhealthy.", "Pizza is a usually unhealthy food.", "Pizza is a delicious and healthy food.", "Pizza is a healthy food.", "Pizza is a healthy food that is made with cheese, dough and tomato sauce.", "Pizza is a generally unhealthy food, as it is high in calories, fat and sodium.", "Pizza has many ingredients, some of which are not very healthy for you.", "Pizza is a traditional Italian dish consisting of a yeasted flatbread typically topped with tomato sauce and cheese and baked in an oven. It can also be topped with additional vegetables, meats, and condiments, and can be made without cheese.", "Pizza is not a healthy food.", "Pizza is a flatbread generally topped with tomato sauce and cheese and baked in an oven. It is commonly topped with a selection of meats, vegetables and condiments.", "Pizza is not healthy.", "Pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients baked at a high temperature, traditionally in a wood-fired oven.", "Pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients (anchovies, olives, meat, etc.) baked at a high temperature, traditionally in a wood-fired oven. In formal settings, like a restaurant, pizza is eaten with knife and fork, but in casual settings it is cut into wedges to be eaten while held in the hand.", "Pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients (anchovies, olives, meat, etc.) baked at a high temperature, traditionally in a wood-fired oven.", "Pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients.", "Pizza is a traditional Italian dish consisting of a yeasted flatbread typically topped with tomato sauce and cheese and baked in an oven.", "Pizza can be healthy if it is made with whole grain flour, has a thin crust, and is topped with vegetables and lean meats.", "Pizza is an oven-baked, flat, disc-shaped bread typically topped with a tomato sauce, cheese and various toppings.", "Pizza is one of the most popular junk foods. It is usually made with refined flour and topped with high-fat meats and plenty of cheese.", "Pizza is a popular junk food.", "Pizza is a yeasted flatbread typically topped with tomato sauce and cheese and baked in an oven.", "Pizza is a yeasted flatbread generally topped with tomato sauce and cheese and baked in an oven.", "Pizza is one of the most popular junk foods. It is made with highly refined flour and added sugar. Its main ingredient is a highly refined carbohydrate that quickly increases blood sugar levels.", "An average slice of pizza contains 272 calories.", "Healthy or unhealthy", "Unhealthy.", "Healthy."]