["A mannequin is a model of a human body used by artists, tailors, dressmakers, window dressers and others especially to display or fit clothing.", "A mannequin is a model of a human body used for fitting or displaying clothes.", "A mannequin is a person who is used as a model for displaying clothes.", "A mannequin is a type of model that is used by artists, tailors, dressmakers, window dressers and others especially to display and fit clothing.", "A mannequin is an often articulated doll used by artists, tailors, dressmakers, window dressers and others especially to display or fit clothing.", "A mannequin is an often articulated doll used by artists, tailors, dressmakers, windowdressers and others especially to display or fit clothing.", "A mannequin is a model of a human body used in various contexts, including display, fashion design, and medical simulation.", "Mannequin is a person.", "A mannequin is a doll made in the shape of a human being.", "The mannequin is a life-sized doll used by artists, tailors, dressmakers, window dressers and others especially to display or fit clothing.", "A mannequin is a type of model used to display or fit clothing. The term is also used for life-sized dolls with simulated airways used in the teaching of first aid, CPR, and advanced airway management skills such as tracheal intubation and for human figures used in computer simulation to model the behavior of the human body.", "The mannequin looks more like a real person.", "The mannequin looks like a real person.", "Mannequins are usually made of wood, plaster, or fiberglass. They are used by fashion houses to display clothing.", "A mannequin (also called a manikin, dummy, lay figure or dress form) is an often articulated doll used by artists, tailors, dressmakers, windowdressers and others especially to display or fit clothing.", "The mannequin in the middle looks more like a real person.", "Mannequins have a mostly anatomical shape.", "The mannequin head looks more like a real person.", "The mannequin on the right looks more like a real person.", "Mannequins are the most realistic mannequins available.", "Mannequins are often built to have realistic skin tones.", "The mannequins are made from fiberglass, and are dressed in clothes from the 1920s and 1930s.", "Mannequins are also used in retail to display clothing.", "Mannequins are commonly used to display clothing in fashion stores.", "The mannequin head with a hat on looks more like a real person.", "Mannequins are often used to display clothing in retail stores.", "Mannequins are often used to display clothing in retail stores. They are also used to demonstrate the use of medical equipment.", "The mannequin is wearing a red jacket and a white shirt with a black tie.", "Mannequin is a 1987 American romantic comedy fantasy film starring Andrew McCarthy, Kim Cattrall, Meshach Taylor, James Spader, G. W. Bailey, and Estelle Getty."]