["It is best to surf on high tides.", "Beginner surfers should surf on low tides when the waves are not as big.", "You should surf on low tides.", "Beginner surfers should surf on low tides.", "Beginners should surf on high tides.", "The best tides for surfing are mid to high tides.", "Beginner surfers should surf on high tides.", "Surfers should surf on low tides.", "Beginners should surf on low tides.", "It is best for beginners to surf on low tides.", "It is better for beginners to surf on low tides.", "Low tide is a good time for beginners to surf.", "Low tide is the best time for beginners to surf.", "A beginner surfer should surf on low tides.", "Surfers usually prefer to surf on high tides when the waves are bigger.", "Low tides are best for beginners.", "Low tide is the best time of day to surf. The reason is that the water is more shallow and there is less water moving around.", "Low tides are generally considered safer for beginners, as the waves are smaller and closer to the shore.", "The best time to surf is when the tides are low.", "Low tide (or low water) is the lowest level that the tide reaches before starting to rise again.", "As a beginner, you should look for a low tide.", "Low tide is the lowest level that the tide reaches in its 'cycle'.", "Surfers should stay away from rocks, jetties and piers.", "High tides and low tides are caused by the gravitational pull of the moon and the sun.", "Surfing is a surface water sport in which the wave rider, referred to as a surfer, rides on the forward or deep face of a moving wave, which is usually carrying the surfer towards the shore.", "A high tide (also known as a flood tide) is the daily occurrence of the rising of sea levels due to the influx of water onto land.", "Surfers ride on the wave face, with the wave pushing them along.", "The tide is the rise and fall of sea levels caused by the combined effects of the gravitational forces exerted by the Moon and the Sun and the rotation of Earth.", "The tides are the rise and fall of sea levels caused by the combined effects of the gravitational forces exerted by the Moon and the Sun and the rotation of the Earth.", "Waves are most often formed by wind. Wind-driven waves, or surface waves, are created by the friction between wind and surface water. As wind blows across the surface of the ocean or a lake, the continual disturbance creates a wave crest."]