["The bicycle is made of steel.", "The metal used to make a bicycle is steel.", "The bicycle is made with steel.", "The bicycle is made from steel.", "The most common type of metal used to make bikes is steel.", "The frame of a bicycle is usually made of steel.", "The bicycle is made out of aluminum.", "Bicycles are usually made from steel.", "Bicycles are made of metal.", "The metal used to make this cycle is steel.", "The metal is aluminum.", "bikes are made of steel, aluminum, titanium, and carbon fiber.", "The metal used is usually steel.", "Bicycles are made from aluminum or steel.", "The cycle is made of steel, which is an alloy of iron and carbon, and sometimes other elements.", "The metal is steel.", "It is made of aluminum.", "Steel is an alloy of iron and carbon and other elements.", "Steel is an alloy of iron and carbon, and sometimes other elements.", "The bicycle is made of stainless steel.", "Steel is an alloy of iron and carbon, and sometimes other elements. Because of its high tensile strength and low cost, it is a major component used in buildings, infrastructure, tools, ships, automobiles, machines, appliances, and weapons.", "Steel is an alloy of iron and carbon and other elements. Because of its high tensile strength and low cost, it is a major component used in buildings, infrastructure, tools, ships, automobiles, machines, appliances, and weapons.", "Steel is an alloy of iron and other elements, primarily carbon, that is widely used in construction and other applications because of its high tensile strength and low cost.", "Steel", "The bicycle frame is usually made from welded aluminium or steel (or alloy) tubes, and the wheels are attached to the frame with quick-release levers.", "A bicycle, also called a cycle or bike, is a human-powered or motor-powered, pedal-driven, single-track vehicle, having two wheels attached to a frame, one behind the other.", "A bicycle is a pedal-driven, human-powered vehicle with two wheels attached to a frame, one behind the other.", "The most common type of steel is carbon steel, which consists of iron and carbon.", "A bicycle is a pedal-driven land vehicle with two wheels attached to a frame one behind the other.", "Iron is a metal.", "The bicycle is a pedal-driven, human-powered, single-track vehicle, having two wheels attached to a frame, one behind the other.", "Aluminum is a silvery-white, soft, nonmagnetic, ductile metal.", "Aluminum or aluminium is a chemical element with the symbol Al and atomic number 13. It is a silvery-white, soft, nonmagnetic and ductile metal in the boron group.", "Aluminium or aluminum is a chemical element with symbol Al and atomic number 13. It is a silvery-white, soft, nonmagnetic and ductile metal in the boron group.", "A bicycle, also called a bike or cycle, is a human-powered, pedal-driven, single-track vehicle, having two wheels attached to a frame, one behind the other. A bicycle rider is called a cyclist, or bicyclist.", "Aluminum is a chemical element with symbol Al and atomic number 13. It is a silvery-white, soft, nonmagnetic and ductile metal in the boron group.", "Aluminum is the most abundant metal element in the earth's crust.", "The frame of an electric bike also has to be slightly different. The main part of the frame (the bit that supports your weight) is usually made from lightweight aluminum alloy: the lighter the frame, the lighter the weight of the bike overall, and the further it can travel before you need to recharge the batteries.", "The bicycle's invention has had an enormous effect on society, both in terms of culture and of advancing modern industrial methods."]