["Sailboats are boats which are propelled in part or entirely by sails.", "Sailboats are boats that are propelled partly or entirely by sails.", "Sailboats are boats that are propelled primarily by sails.", "Sailboats is a boat propelled partly or entirely by sails.", "Sailboats are boats that have sails for propulsion.", "Sailboats are boats propelled partly or entirely by sails.", "Sailboats are boats that use sails to propel them.", "Sailboats are large boats that are propelled by sail.", "A sailboat is a boat which is propelled partly or entirely by sails.", "Sailboats are boats propelled by sails.", "A sailboat or sailing boat is a boat propelled partly or entirely by sails.", "A sailboat is a boat propelled partly or entirely by sails.", "Sailboats are boats with sails that are driven by the force of wind.", "Sailing boats and sailboats are boats that have sails.", "A sailboat or sailing boat is a boat propelled partly or entirely by sails and is smaller than a sailing ship.", "A sailboat or sailing boat is a boat propelled partly or entirely by sails smaller than a sailing ship.", "Sailboats are boats that have sails to harness the power of the wind. They are used for racing, cruising and sailing.", "A sailboat is a boat propelled partly or entirely by sails smaller than a sailing ship.", "A sailboat is a boat propelled partly or entirely by sails and is smaller than a sailing ship.", "Sailboats are usually small boats.", "A sailboat or sailing boat is a boat propelled partly or entirely by sails smaller than a sailing ship. Distinctions in what constitutes a sailing boat and ship vary by region and maritime culture.", "The boats are sailboats.", "The boats in the background are sailboats.", "The sailboats are in the background.", "sailboats, catamarans, and yachts.", "A boat is a watercraft of a large range of type and size. Ships are generally distinguished from boats based on their larger size, shape, and cargo or passenger capacity.", "Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat, Sailboat,"]