["The bird is a type of animal.", "A bird is a winged, bipedal, warm-blooded, egg-laying vertebrate.", "The bird is a seagull.", "The bird is a flamingo", "The white bird is a seagull.", "A bird is a feathered, winged, bipedal, warm-blooded, egg-laying, vertebrate.", "a bird is a feathered, winged, bipedal, warm-blooded, egg-laying, vertebrate.", "The bird is a white pelican.", "The bird is a pelican.", "The bird is a flamingo.", "A seagull is a kind of bird.", "A bird is a winged, bipedal, endothermic vertebrate.", "The bird is a white bird.", "The white bird is a bird.", "A seagull is a type of bird.", "This is a bird with wings spread out.", "This is a white bird.", "The bird is a Great Egret.", "This is a seagull.", "A seagull is a bird that lives by the sea.", "pelican is a large water bird with a large throat pouch, short legs, webbed feet and a big beak.", "A seagull is a bird that is found near the sea.", "The pelican is a very large water bird with a distinctive pouch under the beak, belonging to the bird family Pelecanidae.", "A pelican is a large water bird with a large throat pouch, belonging to the bird family Pelecanidae.", "The pelican is a large water bird with a distinctive pouch under its beak.", "A seagull is a bird that is found near the ocean.", "This is a pelican.", "The tongue-tailed bird is a small dark-grey bird with a bright pink tongue.", "The heron is a long-legged freshwater and coastal bird in the family Ardeidae, with 64 recognised species.", "A flamingo is a type of wading bird in the genus Phoenicopterus and the family Phoenicopteridae. There are four flamingo species in the Americas and two species in the Old World.", "The flamingo is a type of wading bird in the family Phoenicopteridae, the only bird family in the order Phoenicopteriformes.", "This is a pink flamingo.", "The bald eagle is a bird of prey found in North America.", "The Black-winged Stilt is a widely distributed very long-legged wader in the avocet and stilt family."]