["It is a park bench.", "A park bench is a bench designed for use in a park.", "A park bench is a bench that is usually placed in a park.", "This is a park bench.", "A park bench is a bench that is usually built for the purpose of sitting in a park.", "A park bench is a bench that is situated in a park.", "a park bench is a bench that is usually placed in a park for people to sit and rest.", "The bench is a park bench.", "A park bench is a bench that is usually placed in a park for people to sit on it and rest.", "This bench is a park bench.", "A park bench is a bench that is usually built in parks for people to sit, relax, and rest.", "A park bench is a bench intended for public use, usually outdoors.", "A park bench is a bench that is usually built in a park, public garden, or public place.", "A park bench is a bench that is usually provided by a public park, public garden, transportation terminal, or other public place.", "A park bench is a bench that is usually built in public areas, such as parks, and along the sides of thoroughfares.", "A park bench is a bench that is placed in a park.", "A park bench is a bench that is usually placed in a park, along the side of a road, or in a garden for people to sit on.", "This is a garden bench.", "A bench is a long seat on which multiple people may sit at the same time. Benches are typically made of wood, but may also be made of metal, stone, or synthetic materials.", "A garden bench is a bench that is used in a garden.", "A park bench is a long seat on which multiple people may sit at the same time.", "The bench is made of wood.", "This bench is a wooden bench.", "The bench is concrete.", "A bench is a long seat on which multiple people may sit at the same time.", "Benches are made of wood, metal, or a combination of the two.", "Benches are usually made of wood, metal, or stone.", "The bench is made of metal.", "A picnic table is a modified table with attached benches, designed for eating a meal outdoors.", "The bench is a coffee can."]