["These animals are participating in a horse show.", "The animals are participating in a zoo.", "The animals are participating in the zoo.", "A zoo is a place where animals and people can play together.", "A zoo is a facility in which animals are housed within enclosures, displayed to the public, and in which they may also breed.", "A zoo is a facility in which animals are confined within enclosures, displayed to the public, and in which they may also breed.", "A zoo is a place where animals are kept and displayed to the public.", "A zoo is a facility in which all animals are housed within enclosures, displayed to the public, and in which they may also breed.", "Zoos are a place where animals are kept so they can be seen by people.", "Zoos are a place where animals are kept in captivity and displayed to the public.", "A zoo (short for zoological garden or zoological park and also called an animal park or menagerie) is a facility in which all animals are housed within enclosures, displayed to the public, and in which they may also breed.", "Zoo is a place where animals are kept in enclosures", "These animals are participating in a horse race.", "Zoos provide care for animals and a place for them to live.", "Zoo is a short name of zoological garden or zoological park. This is the place where animals are kept for the purpose of study or display to the public.", "Zoo play is a play style where the child is not in control of the play.", "The animals are playing. Playing is recreational activity.", "Zoo animals are animals that are kept in zoos, and some of them are endangered species.", "The animals are playing.", "A horse show is a judged exhibition of horses and ponies. Many different horse breeds and equestrian disciplines hold competitions worldwide, from local to the international levels.", "A dog show is a judging event in which the dogs are assigned a breed and judged on their appearance and behavior.", "A horse show is a judged exhibition of horses and ponies.", "Giraffes participate in a variety of activities at the zoo.", "Dogs are often trained to perform in dog shows.", "A dog show is a dog competition where the dogs are judged to see how close they conform to a standard.", "A dog show is a judging event in which the handlers or owners of dogs present their dogs to a judge, who then decides which dog should be awarded the prize in each class.", "Play is a range of voluntary, intrinsically motivated activities normally associated with recreational pleasure and enjoyment.", "The animals are participating in a circus.", "Two dogs playing with each other and a person watching them.", "The animal is a horse.", "The event is a horse race.", "Play is the work of children.", "The scene is a dog show.", "The horses are playing in a rodeo.", "A play is a form of literature written by a playwright, usually consisting of dialogue between characters, intended for theatrical performance rather than just reading.", "A sport is an activity involving physical exertion and skill in which an individual or team competes against another or others for entertainment."]