["The temperature is measured in degrees Celsius.", "The outside temperature is a temperature.", "The outside temperature is about 20 degrees.", "The temperature is cold.", "The temperature outside is about 62 degrees Fahrenheit.", "The temperature is about 20 degree.", "The temperature is 7 degrees celsius.", "The temperature is about 1 degree Celsius.", "The temperature outside is 20 degrees.", "The temperature is the degree of hotness or coldness of a body or environment.", "The temperature is about 25 degrees Celsius.", "The temperature of the outside is approximately 20 degrees Celsius.", "The temperature outside is about 21°C.", "The temperature is very cold.", "The temperature is about 68 degrees.", "The temperature is 20 degrees.", "The temperature is often higher when the sun is out.", "The outside temperature is 10 degrees.", "The temperature is a measure of how hot or cold something is.", "The outside temperature is 30 degrees.", "The outside temperature is 19 degrees.", "The outside temperature is probably cold.", "The temperature is about 70 degrees Fahrenheit.", "The temperature outside is the temperature outside the house.", "The temperature is a measure of the warmth or coldness of an object or substance with reference to a standard value.", "The sun is a star, and as such is very hot.", "The temperature of the sun is about 10,000 degrees Fahrenheit.", "Sun is the star at the center of the Solar System.", "The sun is the star at the center of the Solar System.", "The average temperature in the park is 14 degrees Celsius.", "The sun is a yellow dwarf star.", "The temperature is not very hot in the park.", "The sun is a G-type main-sequence star that comprises about 99.86% of the mass of the Solar System.", "The temperature of the sun is about 5,500 °C (9,932 °F) at its surface.", "The temperature is a physical property of a system that underlies the common notions of hot and cold; something that is hotter generally has the greater temperature.", "There is no temperature information in the photo.", "The temperature of the air is the measure of the intensity of heat in the atmosphere.", "It is 25 degree.", "The average temperature in the summer is 70.5 °F (21.4 °C) and the average temperature in the winter is 35.3 °F (1.8 °C).", "The temperature at which the water freezes is the freezing point of water. The freezing point of water is 0 °C (32 °F).", "The temperature of the Earth's surface varies from place to place and time to time, and the concept of temperature is only well-defined for systems in thermodynamic equilibrium.", "Weather is the state of the atmosphere, describing for example the degree to which it is hot or cold, wet or dry, calm or stormy, clear or cloudy.", "It is a sunny day.", "A park is an area of natural, semi-natural or planted space set aside for human enjoyment and recreation or for the protection of wildlife or natural habitats.", "The temperature at which the liquid–gas phase change occurs."]