["The pattern on the umbrella is called stripes.", "The pattern on the umbrella is called a stripe.", "The pattern is called stripes.", "The pattern on the umbrella is called a polka dot pattern.", "The pattern is called \"stripes\".", "The pattern is called a stripe.", "The umbrella pattern is called striped.", "The pattern is called polka dots.", "The pattern is called a polka dot.", "The pattern called that is printed on the umbrella.", "It is a polka dot pattern.", "The pattern of the umbrella is called the \"paisley\" pattern.", "The pattern is called a \"rainbow\".", "The umbrella pattern is called a paisley pattern.", "The pattern on the umbrella is called a plaid.", "Stripes are a pattern of regularly spaced lines.", "A pattern is a design in which lines, shapes, forms or colours are repeated.", "Stripes are a pattern consisting of regular, alternating bands or lines of varying widths and colors.", "The pattern is called plaid.", "The pattern is called the Rainbow.", "A striped umbrella is an umbrella with stripes.", "A pattern is a design in which lines, shapes, forms or colours are arranged in a recurring sequence.", "Stripes are parallel lines, often vertical and equally spaced.", "Stripes are lines of alternating color, usually parallel to each other. They can be of any width and are often used to decorate the outside of an object.", "The umbrella is striped.", "Stripes are lines that go straight across, side to side, or up and down, like the stripes on a zebra.", "A stripe is a line or band of color.", "The umbrella is a canopy designed to protect against rain or sunlight.", "A stripe is a line or band that differs in color or tone from the background, usually parallel to one of the edges.", "Stripes.", "stripes", "The umbrella is a symbol of the sun. The umbrella is a symbol of the sun.", "An umbrella or parasol is a folding canopy supported by wooden or metal ribs, which is usually mounted on a wooden, metal, or plastic pole.", "Polka dots are distinct from other patterns, such as a plaid or tartan, in that they are a pattern of evenly spaced dots rather than vertical and horizontal stripes or lines.", "An umbrella or parasol is a folding canopy supported by wooden or metal ribs, which is usually mounted on a wooden, metal, or plastic pole. It is designed to protect a person against rain or sunlight.", "A pattern is a regularity in the world, in human-made design, or in abstract ideas. As such, the elements of a pattern repeat in a predictable manner.", "The word \"umbrella\" typically refers to a device used for protection from rain. The word parasol usually refers to an item designed to protect from the sun.", "A polka dot is a pattern consisting of an array of filled circles of the same size.", "A polka dot is a pattern consisting of an array of filled circles.", "A polka dot is a pattern consisting of an array of filled, large circles of the same size.", "Chevron is an inverted V-shaped pattern."]