["It is a cycling race.", "A bicycle race is a competition of cycling.", "A bicycle race is a road bicycle racing competition held on roads.", "A bicycle race is a road bicycle racing sport held on roads.", "A bicycle race is a competition that involves racing bicycles.", "A bicycle race is a road bicycle racing competition.", "A bicycle race is a sporting competition using bicycles.", "Bicycle racing is the cycle sport discipline of road bicycle racing, held on paved roads.", "The Tour de France is a multi - stage bicycle race held annually in France.", "A bicycle race is a competition of speed involving bicycles.", "A bicycle race is a competition between people using bicycles.", "The bike race is Tour de France.", "The Tour de France is an annual multiple stage bicycle race primarily held in France, while also occasionally passing through nearby countries.", "A bicycle race is a sporting event involving bicycles. There are several categories of bicycle racing including road bicycle racing, time trialling, cyclo-cross, mountain bike racing, track cycling, BMX, and cycle speedway.", "A bicycle race is a competition of speed.", "Tour de France is an annual multiple stage bicycle race primarily held in France, while also occasionally passing through nearby countries.", "The Tour de France is an annual male multiple stage bicycle race primarily held in France, while also occasionally passing through nearby countries.", "A bicycle race is a sporting competition using bicycles. There are several categories of bicycle racing including road bicycle racing, time trialling, cyclo-cross, mountain bike racing, track cycling, BMX, and cycle speedway. Non-racing cycling sports include artistic cycling, cycle polo, freestyle BMX and mountain bike trials.", "The Tour de France is an annual multiple stage bicycle race primarily held in France.", "Bike racing is a bicycle racing sport.", "The Tour de France is an annual men's multiple stage bicycle race primarily held in France, while also occasionally passing through nearby countries.", "Bike races are races involving bikes.", "The Tour de France is an annual men's multiple stage bicycle race primarily held in France.", "The Tour de France is an annual road bicycle race held over 23 days in July.", "Cycling is a sport in which people ride bicycles.", "Cycling, also called bicycling or biking, is the use of bicycles for transport, recreation, exercise or sport.", "The Tour de France is an annual multiple stage bicycle race primarily held in France, while also occasionally passing through nearby countries. Like the other Grand Tours (the Giro d'Italia and the Vuelta a España), it consists of 21 day-long stages over the course of 23 days.", "The Tour de France is an annual men's multiple stage bicycle race primarily held in France, while also occasionally passing through nearby countries. Like the other Grand Tours (the Giro d'Italia and the Vuelta a España), it consists of 21 day-long stages over the course of 23 days.", "A race is a competition of speed, against an objective criterion, usually a clock or to a specific point. The competitors in a race try to complete a given task in the shortest amount of time. Typically this involves traversing some distance, but it can be any other task involving speed to reach a specific goal.", "A race is a contest of speed, against an objective criterion, usually a clock or to a specific point. The competitors in a race try to complete a given task in the shortest amount of time. Typically this involves traversing some distance, but it can be any other task involving speed to reach a specific goal.", "This is the Tour de France."]