["The kind of lighting used in this kitchen is spotlight.", "The kind of lighting used in this kitchen shown is spotlight.", "Spotlights are a type of lighting used in kitchens and other areas of the home.", "The lights used in this kitchen are spotlight.", "The kitchen is illuminated by spotlights.", "The lights in this kitchen are spotlights.", "The lights in the kitchen are spotlights.", "The kitchen is illuminated with spotlights.", "The kitchen lights are spotlights.", "The kitchen has a spotlight.", "Spotlights are used in kitchens.", "The kitchen is lit by a spotlight.", "The kitchen uses spotlights.", "This kitchen uses spotlights.", "The lighting used in this kitchen is spot lighting.", "The kind of lighting used in this kitchen shown is spot light.", "Spotlights are used for lighting.", "This kitchen has spotlights.", "The kitchen has spot lighting.", "The lighting used in kitchen is fluorescent lighting.", "Kitchen lighting is a key element of your home's design.", "The kitchen has recessed lighting.", "A spotlight is a lamp that is used to illuminate a particular area.", "Spot lights are used in kitchens.", "Spotlights are a lighting fixture that is used in stage lighting to produce a focused light.", "The spotlight is a form of stage lighting instrument which projects a bright beam of light onto a performance space.", "Spotlight is a lighting device which projects a bright beam of light onto a particular spot.", "A spotlight is a powerful stage lighting instrument which projects a bright beam of light onto a performance space.", "Spotlight is a lamp that produces a strong beam of light to illuminate a small area.", "Lighting or illumination is the deliberate use of light to achieve a practical or aesthetic effect.", "Spotlights are used.", "Spotlights, sometimes called spotlights, are powerful stage lights that shine a bright beam of light onto a particular area of the stage.", "task lighting is the lighting that is used to illuminate specific tasks, such as reading, cooking, or cleaning.", "Lighting is the deliberate use of light to achieve a practical or aesthetic effect. Lighting includes the use of both artificial light sources like lamps and light fixtures, as well as natural illumination by capturing daylight.", "The kitchen lighting is fluorescent.", "Spotlight", "Spotlights are sometimes called floods or floodlights. The beam of light is usually narrow, with an enclosed cylinder which restricts the light to a specific angle.", "The kitchen is a room or part of a room used for cooking and food preparation in a dwelling or in a commercial establishment.", "A kitchen is a room or part of a room used for cooking and food preparation in a dwelling or in a commercial establishment.", "A kitchen is a room or part of a room used for cooking and food preparation in a dwelling or in a commercial establishment. A modern middle-class residential kitchen is typically equipped with a stove, a sink with hot and cold running water, a refrigerator, and worktops and kitchen cabinets arranged according to a modular design.", "A kitchen is a room or part of a room used for cooking and food preparation in a dwelling or in a commercial establishment. A modern middle-class residential kitchen is typically equipped with a stove, a sink with hot and cold running water, a refrigerator and kitchen cabinets arranged according to a modular design.", "Recessed lighting is one of the most popular types of lighting.", "Incandescent light bulbs are the most common type of light bulb used in homes."]