["The horse is a horse breed.", "The breed of horse is a thoroughbred.", "Horses are a breed of animal.", "The horse is a stallion.", "The horse is a breed of horse that has been developed primarily for speed.", "A horse is a mammal in the genus Equus, which includes the domesticated horse and several other wild species.", "The horse is a Percheron, a French breed of draft horse.", "The breed of the horse is a Shire.", "The horse is a quarter horse.", "The horse is a Percheron.", "A horse is one of two extant subspecies of Equus ferus. It is an odd-toed ungulate mammal belonging to the taxonomic family Equidae.", "The horse is a Clydesdale.", "The breed of the horse is a Friesian horse.", "The horse is a Shire.", "A horse is a mammal in the family Equidae.", "The horse is an Arabian horse. The Arabian or Arab horse is a breed of horse that originated on the Arabian Peninsula.", "The most common breed of horse in the United States is the American Quarter Horse.", "The horse is a black and white paint.", "The horse is a Friesian horse.", "The horse is Friesian.", "The horse is a Friesian.", "A horse is a large solid-hoofed herbivorous animal, one of the seven extant species of the genus Equus.", "A horse is a large four-legged mammal.", "The horse is a Lipizzaner.", "The Shire horse is a breed of draught horse.", "The horse is a bay.", "Horses are large, strong animals with long legs, a long neck and a short back.", "The horse (Equus ferus caballus) is one of two extant subspecies of Equus ferus.", "Horses are mammals of the family Equidae. The horse has evolved over the past 45 to 55 million years from a small multi-toed creature, Eohippus, into the large, single-toed animal of today.", "The Shire horse is a breed of draught horse. It is usually black, bay, or grey. It is a tall breed, and Shires have at various times held world records both for the largest horse and for the tallest horse.", "The most common breed of horse used by mounted police is the American Quarter Horse.", "The breed of horse most commonly used for police work is the American Quarter Horse.", "The most common type of police horse is the gelding (a castrated male horse).", "The Friesian horse is a horse breed originating in Friesland, in the Netherlands.", "A Clydesdale is a breed of draught horse named for and derived from the farm horses of Clydesdale, Scotland, and was originally one of the foremost breeds used for agriculture and haulage.", "A horse is a horse, of course, of course, and no one can talk to a horse of course. That is, of course, unless the horse is the famous Mr. Ed.", "The Shire is a British breed of draught horse. It is usually black, bay, or grey.", "The Arabian or Arab horse is a breed of horse that originated on the Arabian Peninsula.", "The American Quarter Horse is an American breed of horse that excels at sprinting short distances. Its name came from its ability to outdistance other horse breeds in races of a quarter mile or less; some have been clocked at speeds up to 55 mph.", "The Percheron is a breed of draft horse that originated in the Huisne river valley in western France, part of the former Perche province from which the breed takes its name.", "The American Quarter Horse is an American breed of horse that excels at sprinting short distances.", "The Friesian is a horse breed originating in Friesland, in the Netherlands.", "The breed is called the Percheron.", "The Dutch Warmblood is a modern sport horse breed from the Netherlands, bred for use in show jumping and dressage.", "This is a Clydesdale."]