["The animal to the left is a llama.", "A llama is a domesticated South American camelid, widely used as a meat and pack animal by Andean cultures since the Pre-Columbian era.", "The llama is a domesticated South American camelid, widely used as a meat and pack animal by Andean cultures since the Pre-Columbian era.", "Llamas are a domesticated species of South American camelid. They are very social animals and live with other llamas as a herd.", "Llama is a domesticated South American camelid, widely used as a meat and pack animal by Andean cultures since the Pre-Columbian era.", "llama is a domesticated South American camelid, widely used as a meat and pack animal by Andean cultures since the Pre-Columbian era.", "Llamas are a domesticated species of South American camelid.", "The llama is a South American camelid, widely used as a pack and meat animal by Andean cultures since pre-Hispanic times.", "The llama is a South American camelid, widely used as a pack and meat animal by Andean cultures since the Pre-Columbian era.", "Llama is a domesticated species of South American camelid.", "The llama is a domesticated South American camelid.", "Llamas are domesticated South American camelids, widely used as a meat and pack animal by Andean cultures since the Pre-Columbian era.", "The llama is a South American camelid, widely used as a pack animal by the Incas and other natives of the Andes mountains.", "A llama is a domesticated camelid.", "Llama is a South American relative of the camel, often used as a pack animal by the Incas.", "Llamas are camelids, relatives of the camel.", "Llamas are members of the camel family.", "Llamas are mammals that live in South America.", "Llamas are four-legged mammals that are related to camels. Llamas are native to South America.", "Llamas are mammals.", "Llamas are very social animals and live with other llamas as a herd.", "Llamas are very social animals and like to live with other llamas. They do not like to be alone.", "Llama.", "Llamas are very social animals and live with other llamas as a herd. Their wool grows continuously and can be shorn each year. They can live for 15–30 years.", "Llamas are pack animals and can carry about 25 to 30% of their body weight for 8 to 13 km (5–8 miles).", "Lama is a South American camelid, widely used as a pack animal by the Andean cultures since the Pre-Columbian era."]