["The shirts are in a store.", "The shirts are in the store.", "The shirts are in store.", "Shirts are in stores.", "Shirts are sold in stores.", "These shirts are in a store.", "Shirts are usually in a store.", "The shirts are in a shop.", "These shirts are in store.", "These shirts are in the store.", "Shirts are usually sold in stores.", "A clothing store is a business that sells clothing.", "A store is a retail establishment that sells a variety of goods.", "A store is a retail establishment that sells items to customers.", "A store is a retail establishment selling items to the public.", "They are in store.", "Shirts are made in a very wide range of styles and fabrics.", "A store is a retail business that sells goods or services to consumers.", "A store is a business that presents a selection of goods and offers to trade or sell them to customers for money or other goods.", "A shirt is a cloth garment for the upper body.", "A shirt is a cloth garment for the upper body. Originally an undergarment worn exclusively by men, it has become, in American English, a catch-all term for a broad variety of upper-body garments and undergarments.", "Shirts are usually made of cotton, man-made fiber, or a blend. A shirt can also be worn with a necktie under the shirt collar.", "A store is a retail business that typically sells a particular product or product line", "In Store", "A store is a retail establishment offering a wide range of consumer goods in different product categories known as \"departments\". In modern major cities, the department store made a dramatic appearance in the middle of the 19th century, and permanently reshaped shopping habits, and the definition of service and luxury.", "A shop is a business that presents a selection of goods and offers to trade or sell them to customers for money or other goods. Shopping is an activity in which a customer browses the available goods or services presented by one or more retailers with the intent to purchase a suitable selection of them.", "A shirt is a piece of clothing that covers at least the chest, but which usually covers most of the upper human body between the neck and the waistline."]