["White frosting is usually vanilla flavored.", "The white frosting is usually vanilla flavored.", "The white frosting is usually vanilla.", "Most white frosting is vanilla flavored.", "White frosting is usually vanilla.", "White frosting is usually sweet.", "White frosting is usually made with vanilla.", "The white topping is frosting.", "Vanilla is the most common flavor used in cake frosting.", "Vanilla is the most common flavor for white cake.", "The white topping on the cake is usually sweet.", "Cake with white icing is usually sweet.", "The white topping usually have vanilla taste.", "The white topping usually has a sweet taste.", "The white topping usually has sweet taste.", "The white topping usually have a sweet taste.", "White icing is usually sweet.", "The white topping usually have sweet taste.", "The popular white topping is usually made from vanilla flavoring.", "The white topping is usually sweet.", "The topping is usually sweet and tastes like vanilla.", "The white topping usually tastes sweet.", "The most common flavors of frosting are vanilla and chocolate.", "Cake frosting is a sweet, often creamy glaze made of sugar with a liquid, such as water or milk, that is often enriched with ingredients like butter, egg whites, cream cheese, or flavorings.", "The cake is a vanilla cake with chocolate frosting.", "A frosting is a sweet, often creamy glaze made of sugar with a liquid, such as water or milk, that is often enriched with ingredients like butter, egg whites, cream cheese, or flavorings.", "Frosting, also known as icing, is a sweet, often creamy glaze made of sugar with a liquid, such as water or milk, that is often enriched with ingredients like butter, egg whites, cream cheese, or flavorings.", "The white topping is made of whipped cream.", "The most common flavor of frosting is vanilla, but buttercream frosting can be flavored with extracts, spices, or liquors.", "Icing is a sweet, often creamy glaze made of sugar with a liquid, such as water or milk, that is often enriched with ingredients like butter, egg whites, cream cheese, or flavorings.", "Icing is a sweet, often creamy glaze made of sugar with a liquid, such as water or milk, that is often enriched with ingredients like butter, egg whites, cream cheese, or flavorings. It is used to cover or decorate baked goods, such as cakes.", "Vanilla.", "It has a sweet taste.", "The cake is a form of sweet dessert that is typically baked.", "Cake is a form of sweet dessert that is typically baked.", "The frosting is white for the graduation.", "Vanilla is a flavoring derived from orchids of the genus Vanilla, primarily from the Mexican species, flat-leaved vanilla (V. planifolia).", "White chocolate is a chocolate confection made from cocoa butter, sugar, milk solids, and flavorings."]