["The pattern on the plate was manufactured in china.", "The pattern on the plate was manufactured in China.", "Plate was manufactured in China.", "The plate was made in Italy.", "The pattern on this plate was manufactured in Italy.", "The pattern on the plate is made in the United States.", "The plate was manufactured in Italy.", "The pattern on this plate was made by the company that makes the plate.", "The pattern on this plate was manufactured in China.", "The plate was made in China.", "The plate was manufactured in China.", "The plate was manufactured in the USA.", "The pattern on this plate was manufactured in France.", "The plate was manufactured in the United States.", "This plate was manufactured in China.", "The plate was manufactured in Japan.", "Plates are made in factories.", "The plate was manufactured in Thailand.", "The plate was made in Japan.", "The first porcelain factory in Europe was established in Meissen, Germany, in 1710 by Ehrenfried Walther von Tschirnhaus.", "The first place setting and tableware set was produced in 1748 by the Meissen porcelain factory.", "The company had a factory in East Liverpool, Ohio, which was the world's largest pottery factory", "The company was founded in 1896 by the merger of two pottery companies, one of which dated to the 17th century.", "The United States of America is a federal republic consisting of 50 states, a federal district, five major self-governing territories, and various possessions.", "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country composed of 50 states, a federal district, five major self-governing territories, and various possessions.", "A pattern is a discernible regularity in the world or in a manmade design. As such, the elements of a pattern repeat in a predictable manner.", "Floral patterns are a common pattern in the world.", "China is a country in East Asia and the world's most populous country, with a population of around 1.404 billion.", "China is a country in East Asia and the world's most populous country, with a population of around 1.428 billion.", "The plate was manufactured in the Czech Republic.", "The designs of the plates were manufactured by the Spode factory in Stoke-on-Trent, Staffordshire, England.", "The pattern was manufactured in Italy.", "The pattern is manufactured in China.", "The plate is a type of dishware, a broad, concave, but mainly flat vessel on which food can be served. A plate can also be used for ceremonial or decorative purposes.", "Pizza is a type of food that was originally created in Italy.", "The plate is a type of dishware, a broad, concave, but mainly flat vessel on which food can be served. They can also be used for ceremonial or decorative purposes.", "The pattern was made in England.", "The pattern is made in Germany.", "Pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients.", "A plate is a broad, concave, but mainly flat vessel on which food can be served. A plate can also be used for ceremonial or decorative purposes.", "The pizza is a flatbread generally topped with tomato sauce and cheese and baked in an oven.", "A plate is a broad, concave, but mainly flat vessel on which food can be served."]