["A fleet is a group of boats.", "A fleet is a group of boats or ships.", "A fleet is a large group of boats.", "a fleet is a group of boats, ships, submarines, or other watercraft.", "A fleet is a large group of boats all together.", "A harbor is a body of water where ships and boats can dock.", "A harbor or harbour is a body of water where ships, boats, and barges can seek shelter from stormy weather, or else are stored for future use.", "A harbor is a body of water where ships, boats, and barges can seek shelter from stormy weather, or else are stored for future use.", "Boats is a watercraft of a large range of type and size. Ships are generally distinguished from boats based on their larger size, shape, and cargo or passenger capacity.", "A boat is a watercraft of a large range of type and size. Ships are generally distinguished from boats based on their larger size, shape, and cargo or passenger capacity.", "Boats are watercraft of a large range of type and size. Ships are generally distinguished from boats based on their larger size, shape, and cargo or passenger capacity.", "The harbor is a place where boats can dock.", "The boats are docked in a harbor.", "A harbor is a sheltered body of water where ships, boats, and barges can seek shelter from stormy weather, or else are stored for future use.", "A marina is a dock or basin with moorings and supplies for yachts and small boats.", "A fleet is a large group of ships.", "The boats are docked in a port.", "A fleet is a large group of vehicles of the same type, typically motor vehicles, either motorised or horse-drawn, or a group of ships.", "A marina is a dock or basin with moorings and supplies for yachts and small boats. A marina differs from a port in that a marina does not handle large passenger ships or cargo from freighters.", "A boat is a watercraft of any size designed to float or plane, to work or travel on water.", "A fleet is a group of ships.", "A fleet is a large group of vehicles, typically motor vehicles, that are owned by a business, government agency, or other organization rather than by an individual or family.", "a fleet of ships", "A harbor or haven is a body of water where ships, boats, and barges can seek shelter from stormy weather, or else are stored for future use.", "A fleet is a large group of vehicles of the same type.", "A fleet is a large group of vehicles.", "A fleet is a group of vehicles, typically motor vehicles, that are owned or operated by a government, business, or organization.", "A fleet is a group of vehicles, typically motor vehicles, that are owned or leased by a business, government agency, or other organization rather than by an individual or family.", "A dock is a type of pier, often built at a shoreline of a lake, river, or sea, to allow people to embark and disembark from boats.", "A boat is a watercraft of a large range of type and size.", "A dock is a place where a ship can be docked.", "A dock is a human-made structure in the water at a lake, river, sea, ocean, or another body of water.", "The boats are lined up side by side in a row.", "A harbor or harbour (see spelling differences; synonyms: wharves, haven) is a body of water where ships, boats, and barges can seek shelter from stormy weather, or else are stored for future use."]