["The Apple Macintosh is a brand of computer.", "Mac is the name of a brand of computers made by Apple.", "Mac is a brand of computers designed, developed, and marketed by Apple Inc.", "The Mac is a personal computer made by Apple Inc.", "Mac is a brand of computers.", "The Apple Macintosh is a series of personal computers designed, manufactured, and sold by Apple Inc.", "Apple is a brand of computer.", "The Macintosh is a family of personal computers designed, manufactured, and sold by Apple Inc. since January 1984.", "The Macintosh is a family of personal computers designed, manufactured and sold by Apple Inc. since January 1984.", "mac is a brand of computer.", "Apple is a brand of computer company.", "The Macintosh is a family of personal computers designed, manufactured, and sold by Apple Inc.", "The Macintosh (commonly referred to as the Mac, is a series of personal computers designed, developed, and marketed by Apple Inc.", "The Macintosh (pronounced as MAK-in-tosh; branded as Mac since 1998) is a family of personal computers designed, manufactured, and sold by Apple Inc. since January 1984.", "Mac is a brand name which covers several lines of personal computers designed, developed, and marketed by Apple Inc.", "The brand of computer is a mac.", "MacBook is a brand of notebook computers manufactured by Apple Inc. from May 2006 to February 2012, and relaunched in 2015.", "Apple is an American multinational technology company headquartered in Cupertino, California, that designs, develops, and sells consumer electronics, computer software, and online services.", "Apple Inc. is an American multinational technology company headquartered in Cupertino, California, that designs, develops, and sells consumer electronics, computer software, and online services.", "Apple Inc. is an American multinational technology company headquartered in Cupertino, California that designs, develops, and sells consumer electronics, computer software, and online services.", "Mackintosh is a brand of Apple Inc.", "The computer is a Mac.", "It is an Apple computer.", "Mac or MAC most commonly refers to:", "Apple Computer Company was founded on April 1, 1976, by Steve Jobs, Steve Wozniak and Ronald Wayne."]