["Pants are a garment worn on the lower half of the body.", "She is wearing a pair of jeans.", "Jeans are trousers, a type of garment, typically made from denim or dungaree cloth. Often the term \"jeans\" refers to a particular style of trousers, called \"blue jeans\", which were invented by Jacob W. Davis in partnership with Levi Strauss & Co. in 1871 and patented by Jacob W. Davis and Levi Strauss on May 20, 1873.", "Pants are an item of clothing worn from the waist to the ankles, covering both legs separately (rather than with cloth extending across both legs as in robes, skirts, and dresses).", "Women's pants come in many different styles, fabrics and colors.", "Jeans are trousers typically made from denim or dungaree cloth. Often the term \"jeans\" refers to a particular style of trousers, called \"blue jeans\", which were invented by Jacob W. Davis in partnership with Levi Strauss & Co. in 1871 and patented by Jacob W. Davis and Levi Strauss on May 20, 1873.", "Jeans are trousers made from denim or dungaree cloth. Often the term \"jeans\" refers to a particular style of trousers, called \"blue jeans\", which were invented by Jacob W. Davis in partnership with Levi Strauss & Co. in 1871 and patented by Jacob W. Davis and Levi Strauss on May 20, 1873.", "The pants are a garment covering the lower half of the body, worn by both sexes.", "Pants are an item of clothing worn from the waist to the ankles, covering both legs separately.", "Pants are a garment covering the body from the waist down, with separate coverings for each leg, usually stopping around the ankle, and worn by both sexes.", "Pants are a garment worn on the lower part of the body and covering both legs separately.", "Pants (American English) or trousers (British English) are an item of clothing worn from the waist to the ankles, covering both legs separately (rather than with cloth extending across both legs as in robes, skirts, and dresses).", "Pajamas, also spelled pyjamas, can refer to several related types of clothing.", "Trousers (British English) or pants (American English) are an item of clothing worn from the waist to the ankles, covering both legs separately (rather than with cloth extending across both legs as in robes, skirts, and dresses).", "Trousers are an item of clothing worn from the waist to the ankles, covering both legs separately (rather than with cloth extending across both legs as in robes, skirts, and dresses).", "A pair of pants is the part of a suit worn below the waist and covering each leg separately, as opposed to the skirt which is worn below the waist and covers both legs together in a tube-like garment.", "Pajamas or pyjamas, often shortened to PJs, jimmies, jimjams or jammies, can refer to several related types of clothing originating from the Indian subcontinent. In the Western world, pajamas are loose-fitting garments derived from the original garment and worn chiefly for sleeping, but sometimes for lounging, also by both sexes.", "Pajamas or pyjamas (UK), often shortened to PJs, jammies, or Jim-jams, are several related types of clothing originating from the Indian subcontinent. In the Western world, pajamas are loose-fitting garments derived from the original garment and worn chiefly for sleeping, but sometimes for lounging, also by both sexes. More generally, pajamas may refer to several garments, for both daywear and nightwear, derived from traditional pajamas and involving variations of style and material.", "Pajamas are a type of clothing worn at night, consisting of loose-fitting pants and a shirt.", "She is wearing pajama pants.", "She is wearing jeans.", "she is wearing jeans.", "Pajamas or pyjamas, often shortened to PJs, jimmies, jimjams or jammies, can refer to several related types of clothing.", "The woman is wearing a pair of jeans.", "The word pants is used in the United Kingdom to refer to trousers.", "The woman is wearing jeans.", "Pajamas or pyjamas, often shortened to PJs, jimmies, jimjams or jammies, can refer to several related types of clothing originating from the Indian subcontinent.", "The word \"trousers\" is used in British English to refer to pants.", "Pajamas are loose-fitting garments derived from the original garment and worn chiefly for sleeping, but sometimes for lounging.", "The woman is wearing pajama pants.", "The woman is wearing pajamas.", "Pajama (US) or pyjama (commonwealth), sometimes shortened to PJs, jammies, or Jim-jams, is a term which originally referred to loose-fitting trousers of silk, cotton or synthetic fabric derived from the original garment worn by Muslims in India and adopted by Europeans during East India Company rule in India.", "Pajamas are loose-fitting and comfortable clothes to sleep in.", "Pajama pants are worn by both men and women.", "The young girl is wearing pajamas.", "The young girl is wearing a pair of jeans.", "Womens Pants:Capris, Cropped Pants, Dress Pants, Joggers, Leggings, Pants, Shorts, Sweatpants, Sweatshorts, Tights, Track Pants, Track Shorts, Yoga Pants", "A woman is a female human being.", "She is wearing a skirt.", "A woman is a female human. The term woman is usually reserved for an adult, with the term girl being the usual term for a female child or adolescent."]