["The street sign is a rectangular sign.", "The street sign is a rectangular shape.", "The street sign is rectangular in shape.", "The shape of the sign is the shape of the sign.", "The sign is rectangular.", "Street signs are usually rectangular or square.", "A street name sign is rectangular.", "The street sign is in the shape of an octagon.", "A sign is a form of communication. It may refer to a road sign, a traffic light, a street name sign, or a sign board.", "The road sign is a triangle.", "A street sign is a traffic sign that indicates the name of a street.", "A street sign is a traffic sign that indicates the name of a street or road.", "A street sign is a traffic sign that indicates the name of a street or a road.", "A street sign is a traffic sign that indicates the name of a street, road, or path.", "A street sign is a traffic sign that indicates the name of a street, highway, or other road.", "A street sign is a traffic sign used to indicate the location of a street or road, or the direction of travel along it.", "A street sign is a traffic sign used to indicate the name of a street, or other information, such as its destination or the direction of traffic that must use it.", "Street signs in the United States are generally rectangular or square.", "The shape of the sign is rectangular.", "A traffic sign is a sign erected at the side of or above roads to give instructions or provide information to road users.", "A road sign is a traffic sign that conveys a message to road users, usually intended to assist in the safe and efficient flow of traffic.", "The shape of the sign is a rectangle.", "A traffic sign is a type of sign which uses different symbols, colours, shapes, and sizes to provide information to road users.", "A street sign is a traffic sign used to mark streets and roads. They are usually made from metal, but can also be made from plastic, ceramic, wood, or other materials. Modern street signs are often retroreflective, meaning they are covered with a retroreflective material to allow them to reflect a portion of light back to the viewer.", "A sign is a visual form of information.", "The shape of the sign is a square.", "A sign is a visual form of communication, typically displayed on a physical surface.", "A sign is a device that displays a message. A sign can be made of metal, plastic, or wood.", "The shape of the stop sign is an octagon.", "The sign is triangular.", "The sign is octagonal.", "A stop sign is an octagon.", "The stop sign is an octagon.", "The octagon is the shape of the stop sign.", "A sign is an object, quality, event, or entity whose presence or occurrence indicates the probable presence or occurrence of something else.", "The street sign is green.", "The stop sign is an eight-sided red octagon.", "Street signs in the United States are, for the most part, standardized by federal regulations, most notably in the Manual on Uniform Traffic Control Devices (MUTCD) and its companion volume the Standard Highway Signs (SHS)."]