["Boxer is a breed of stocky, medium-sized, short-haired dog.", "A boxer is a breed of stocky, medium-sized, short-haired dog.", "Boxer is a breed of dog.", "The boxer is a breed of stocky, medium-sized, short-haired dog.", "The Boxer is a medium-sized, short-haired breed of dog, developed in Germany. The coat is smooth and tight-fitting; colours are fawn, brindled, or white, with or without white markings.", "A Boxer is a breed of dog.", "A boxer is a dog breed.", "The Boxer is a medium-sized, short-haired breed of dog, developed in Germany. The coat is smooth and tight-fitting; colors are fawn or brindled, with or without white markings, and white.", "The Boxer is a breed of stocky, medium-sized, short-haired dogs developed in Germany.", "The boxer breed is a medium to large, short-haired breed of dog, developed in Germany. The coat is smooth and tight-fitting; colors are fawn or brindled, with or without white markings, and white.", "Boxer is a breed of stocky, medium-sized, short-haired dogs developed in Germany. The coat is smooth and tight-fitting; colors are fawn, brindled, or white, with or without white markings.", "A boxer is a breed of stocky, medium-sized, short-haired dog. The coat is smooth and tight-fitting; colors are fawn or brindled, with or without white markings, and white.", "A boxer is a breed of stocky, medium-sized, short-haired dog. The coat is smooth and tight-fitting; colors are fawn, brindled, or white, with or without white markings.", "Boxer dogs are a breed of medium-sized, short-haired dogs bred in Germany.", "A boxer is a medium-sized, short-haired breed of dog, developed in Germany.", "Boxer is a breed of stocky, medium-sized, short-haired dog. The coat is smooth and tight-fitting; colors are fawn or brindled, with or without white markings, and white.", "Boxer is a breed of medium to large, short-haired dogs developed in Germany.", "The dog in the picture is a boxer.", "This dog is a boxer.", "The Boston Terrier is a breed of dog originating in the United States.", "The Boston Terrier is a breed of dog originating in the United States of America.", "The dog is a boxer.", "Boston Terrier is a breed of dog originating in the United States of America. This \"American Gentleman\" was accepted in 1893 by the American Kennel Club as a non-sporting breed.", "The Boston Terrier is a breed of dog originating in the United States of America. This \"American Gentleman\" was accepted in 1893 by the American Kennel Club as a non-sporting breed.", "Boston Terriers are a breed of dog originating in the United States of America.", "The Boston Terrier is a breed of dog originating in the United States. This \"American Gentleman\" was accepted in 1893 by the American Kennel Club as a non-sporting breed.", "Boxers are a breed of dog.", "Boxers are a medium-sized, short-haired breed of dog, developed in Germany.", "The breed is a Boston Terrier.", "The Boston Terrier, also called the Boston Bull, is a breed of dog originating in the United States of America. This \"American Gentleman\" was accepted in 1893 by the American Kennel Club as a non-sporting breed.", "Boxers are medium-sized, short-haired dogs with a smooth and glossy coat.", "A boston terrier is a small dog with a short, smooth coat and a square head."]