["A roof is the top covering of a building, including all materials and constructions necessary to support it on the walls of the building or on uprights, providing protection against rain, snow, sunlight, extremes of temperature, and wind. A roof is part of the building envelope.", "A roof is the top covering of a building, including all materials and constructions necessary to support it on the walls of the building or on uprights, providing protection against rain, snow, sunlight, extremes of temperature, and wind.", "The roof is the top covering of a building, including all materials and constructions necessary to support it on the walls of the building or on uprights, providing protection against rain, snow, sunlight, extremes of temperature, and wind. A roof is part of the building envelope.", "A roof is the top covering of a building, including all materials and constructions necessary to support it on the walls of the building or on uprights; it provides protection against rain, snow, sunlight, extremes of temperature, and wind.", "a roof is a structure that covers a building.", "The roof is the top covering of a building, including all materials and constructions necessary to support it on the walls of the building or on uprights, providing protection against rain, snow, sunlight, extremes of temperature, and wind.", "A roof is the covering on the uppermost part of a building.", "The roof is the top covering of a building, including all materials and constructions necessary to support it on the walls of the building or on uprights; it provides protection against rain, snow, sunlight, extremes of temperature, and wind.", "The roof is made of wood.", "a roof that is made of wood", "The roof is made of shingles.", "The roof was a roof.", "The roof of a house is the outermost covering of a house or other building, providing protection against rain, snow, sunlight, extremes of temperature, and wind.", "It has a shingle roof.", "This house has a shingled roof.", "The roof is the outermost part of a building.", "The house has a slanted roof.", "The roof of this house is made of shingles.", "The roof of the house is the top covering of the building, serving to keep out rain, snow, sunlight, wind, and extremes of temperature.", "The house has a flat roof.", "The roof is slanted.", "The roof of this house is made of wood.", "The roof of the house is a gable roof.", "Roofs come in different shapes and sizes. The most common types of roofs are flat, gable, hip, and shed.", "The roof of a building is the top covering of a building, which provides protection from animals and weather, notably rain or snow, but also heat, wind and sunlight. The word also denotes the framing or structure which supports that covering.", "The roof of a house is the outermost covering of a house.", "A roof is part of a building envelope.", "The roof of a house is the outermost layer of the house, protecting the house from the effects of weather.", "The roof of the house is made of tiles.", "The roof of a house is the outer covering of a house, and is part of the building envelope.", "The roof of the house is flat.", "The roof is a single-pitched roof.", "The roof is often the most neglected part of a house.", "it had a sloped roof.", "The roofing material was not the same as the walls.", "A gable roof is a type of roof with two sloping sides that come together at a ridge, creating end walls with a triangular extension, called a gable, at the top.", "Different types of roof shingles are needed to complete a certain look.", "Gable roofs are the most common roof design seen in the United States, and are an effective roof design for shedding snow.", "Composition shingles are the most common roofing material used on homes.", "A hip roof, hip-roof or hipped roof, is a type of roof where all sides slope downwards to the walls, usually with a fairly gentle slope. Thus a hipped roof house has no gables or other vertical sides to the roof.", "A thatched roof is a roof made of dry vegetation such as straw, water reed, sedge (Cladium mariscus), rushes, heather, or palm branches, laid in layers.", "A hip roof, hip-roof or hipped roof, is a type of roof where all sides slope downwards to the walls.", "A gable is the generally triangular portion of a wall between the edges of intersecting roof pitches. The shape of the gable and how it is detailed depends on the structural system used, which reflects climate, material availability, and aesthetic concerns."]