["Soccer cleats or football boots are shoes worn when playing soccer.", "Soccer cleats, also known as football boots, are a type of shoe worn by soccer players.", "Soccer cleats are the shoes that soccer players wear.", "Soccer shoes are called cleats.", "Soccer cleats are shoes that are used for playing soccer.", "Soccer cleats are shoes designed for playing soccer.", "Soccer cleats are the shoes that are worn by soccer players.", "Cleats are shoes used for playing soccer.", "Soccer cleats are a type of shoe worn when playing soccer.", "The shoes on soccer players are called cleats.", "Soccer cleats are shoes that have cleats on the bottom.", "Soccer cleats are shoes with cleats on the bottom.", "Soccer cleats are shoes with cleats on the bottom of the shoe.", "Soccer cleats are shoes with cleats on the bottom of the sole.", "Soccer cleats or football boots are shoes worn when playing football.", "The shoes worn by a soccer player are called cleats.", "Soccer cleats are called football boots.", "Soccer cleats are also known as football boots, or simply boots.", "Soccer cleats are shoes with cleats on the bottom. They are used in soccer to help players run faster.", "Soccer cleats are specialized footwear designed for the sport of soccer.", "Football boots, called cleats or soccer shoes in North America, are an item of footwear worn when playing football.", "soccer cleats", "soccer cleats.", "Soccer cleats.", "A football boot, called a soccer cleat in North America, is a particular type of shoe worn when playing football.", "Soccer players wear cleats.", "Soccer shoes are shoes that are used for playing soccer. They are usually made of leather or other materials.", "The shoes are called cleats.", "The boots are the shoes worn by soccer players.", "soccer shoes", "A soccer shoe is a type of shoe worn when playing soccer.", "Cleats are a type of shoe.", "Cleats are shoes with spikes on the sole to give traction and stability on a soft or slippery surface.", "Cleats or studs are protrusions on the sole of a shoe, or on an external attachment to a shoe, that provide additional traction on a soft or slippery surface.", "cleats", "Sneakers are shoes primarily designed for sports or other forms of physical exercise.", "A football boot is a type of shoe worn when playing football.", "The first official football boots were made by the German company Dassler, the forerunner of Adidas, in 1936."]