["Ties are generally made from silk or cotton.", "Ties are generally made of silk.", "Ties are generally made from silk.", "The ties are generally made from silk.", "Ties are generally made from silk or polyester.", "Ties are traditionally made from silk.", "Ties are usually made of silk or polyester.", "Ties are usually made of silk, cotton, or a polyester blend.", "Ties are generally made from silk, cotton, or a mixture of fabrics.", "Ties are made of silk, cotton, wool, or synthetic fibers.", "Ties are made from silk.", "Ties are generally made from silk, cotton, polyester, or wool.", "The ties are made of silk.", "Most ties are made from silk.", "Ties are generally made from silk, cotton, or a polyester blend.", "Silk is a common fabric for ties.", "The ties are made from silk.", "Ties are made from a variety of fabrics, including silk, polyester, nylon, cotton, and wool.", "Ties are generally made from wool, silk, polyester, or a mixture of fabrics.", "Ties are generally made from a variety of fabrics, including cotton, silk, satin, polyester and wool.", "The tie is made of silk, wool and polyester.", "Ties are made in a variety of fabrics, most commonly silk, polyester, cotton, or a mixture of fabrics.", "A tie is generally made from a piece of cloth, usually a thin one, which is wrapped around the neck and knotted at the throat. The most common fabrics for ties are silk, polyester, cotton, wool, and linen.", "Ties are generally made from a variety of fabrics, the most common being silk, polyester, cotton, wool, and microfiber.", "Silk ties are made of silk.", "Silk, cotton, polyester and wool are the most commonly used fabrics for ties.", "A tie is generally made of a durable cloth such as wool or silk, and is worn around the collar of the shirt.", "Neckties are usually made of silk or polyester.", "Neckties are generally made from a variety of fabrics including silk, cotton, and polyester.", "A necktie, or simply a tie, is a long piece of cloth, worn usually by men, for decorative purposes around the neck, resting under the shirt collar and knotted at the throat.", "A necktie, or simply a tie, is a long piece of cloth, worn, usually by men, for decorative purposes around the neck, resting under the shirt collar and knotted at the throat.", "The tie is a long piece of cloth worn for decorative purposes around the neck, resting under the shirt collar and knotted at the throat.", "The tie is a piece of fabric worn around the neck, under the shirt collar, and tied at the throat. The tie is an accessory.", "There are three main kinds of fabric used to make neckties: silk, polyester, and wool.", "These are made from silk.", "Silk, wool, cotton, rayon, linen, polyester, nylon, etc.", "Silk is a natural protein fiber, some forms of which can be woven into textiles.", "The necktie is a piece of fabric worn around the neck.", "The necktie is a long piece of cloth worn for decorative purposes around the neck, resting under the shirt collar and knotted at the throat.", "A necktie is a long piece of cloth, worn usually by men, for decorative purposes around the neck, resting under the shirt collar and knotted at the throat.", "Silk is a natural protein fiber.", "Neckties are generally unsized, but may be available in a longer size."]