["Ketchup is a red condiment commonly placed in hot dogs.", "Ketchup is a sauce used as a condiment.", "Ketchup is a red condiment commonly placed in the food.", "ketchup is a condiment.", "The condiment is ketchup.", "ketchup is a condiment commonly placed in the food in the image.", "ketchup is a red condiment commonly placed in the food in the image.", "Ketchup is a red condiment commonly placed in the food in the image.", "Ketchup is a red condiment.", "Ketchup is a sauce used as a condiment. It is often used with french fries, hamburgers and hot dogs.", "Ketchup is a condiment made from tomatoes.", "Ketchup is a condiment typically made from tomatoes, vinegar, a sweetener, and assorted seasonings and spices.", "Ketchup is a sauce used as a condiment. The primary ingredients are tomatoes, vinegar, sugar or high-fructose corn syrup, and salt.", "Ketchup, catsup or ketsup is a condiment.", "Ketchup, also known as catsup, is a sauce used as a condiment.", "Ketchup is a sweet and tangy condiment made from tomatoes, vinegar, a sweetener and spices.", "Ketchup is a sweet and tangy sauce, typically made from tomatoes, sugar, and vinegar, with assorted seasonings and spices.", "Ketchup, also known as catsup or tomato sauce, is a sauce used as a condiment.", "Ketchup, also known as catsup or ketsup, is a sauce used as a condiment.", "Hot dogs are often served with condiments. The most common condiments include mustard, ketchup, mayonnaise, and relish.", "Ketchup is a sweet and tangy sauce now typically made from tomatoes, sugar, and vinegar, with assorted seasonings and spices.", "Ketchup, catsup or catchup is a condiment. Traditionally, recipes used egg whites, mushrooms, oysters, mussels, or walnuts, among other ingredients, but in modern times the unmodified term usually refers to tomato ketchup.", "Ketchup, also spelled catsup or catchup, is a condiment, usually made from tomatoes, vinegar, sugar and various seasonings and spices.", "Ketchup is a table sauce.", "Ketchup", "ketchup", "Hot dogs are often served with one or more condiments. Common hot dog condiments include mustard, ketchup, mayonnaise, relish, and onions.", "A hot dog is a cooked sausage, traditionally grilled or steamed and served in a sliced bun as a sandwich.", "A hot dog (also spelled hotdog) is a cooked sausage, traditionally grilled or steamed and served in a sliced bun as a sandwich.", "A hot dog is a cooked sausage, traditionally grilled or steamed and served in a sliced bun as a sandwich. Hot dog variants include the corn dog and pig in a blanket. The hot dog's cultural traditions include the Nathan's Hot Dog Eating Contest and the Oscar Mayer Wienermobile.", "A hot dog is a sandwich consisting of a grilled or steamed hot dog in a sliced bun.", "The hot dog is a grilled or steamed link-sausage sandwich where the sausage is served in the slit of a partially sliced bun.", "Mustard is a condiment made from the seeds of a mustard plant.", "Chili sauce is a red condiment commonly placed in the food in the image.", "Mustard is a condiment made from the seeds of a mustard plant (white or yellow mustard, Sinapis alba; brown or Indian mustard, Brassica juncea; or black mustard, B. nigra). The whole, ground, cracked, or bruised mustard seeds are mixed with water, vinegar, lemon juice, wine, or other liquids, salt, and often other flavorings and spices, to create a paste or sauce ranging in color from bright yellow to dark brown. The taste of mustard ranges from sweet to spicy."]