["The material from which the shoes are made is leather.", "Shoes are made of leather.", "shoes are made of leather", "The shoes are made of leather.", "Shoes are made from leather.", "Shoes are typically made of leather or synthetic material.", "The shoe is made of leather.", "Shoe materials include leather, canvas and rubber.", "The material of the shoe is leather.", "Shoes are made of leather or synthetic material.", "The shoes look like leather.", "Shoes are made of a variety of materials.", "Sneakers are made of leather, canvas, rubber, or synthetic materials.", "The shoes are made out of rubber.", "Sneakers are typically made of canvas or leather.", "Shoes can be made from a variety of materials. Common natural materials are leather, jute, hemp, and cotton.", "Sneakers have a durable sole, usually made of rubber or polyurethane, and an upper part made of leather or synthetic material.", "A shoe is an item of footwear intended to protect and comfort the human foot while the wearer is doing various activities.", "A shoe is an item of footwear intended to protect and comfort the human foot while the wearer is doing various activities. Shoes are also used as an item of decoration.", "Sneakers are shoes primarily designed for sports or other forms of physical exercise, but which are now also widely used for everyday wear.", "Leather is a durable and flexible material created by tanning animal rawhide and skins. The most common raw material is cattle hide. It can be produced at manufacturing scales ranging from cottage industry to heavy industry.", "Leather is a durable and flexible material created by tanning animal rawhides, mostly cattle hide. It can be produced through manufacturing processes ranging from cottage industry to heavy industry.", "Leather is a durable and flexible material created by tanning animal rawhide and skins.", "The upper is the part of the shoe that covers and supports the foot. The upper of a shoe is usually made of leather, but can be made of other materials, such as canvas or synthetic materials.", "Leather is a material made from the skin of an animal by tanning or a similar process.", "Leather is a durable and flexible material created by tanning animal rawhides, mostly cattle hide.", "Leather is a durable and flexible material created by tanning animal rawhide and skin, often cattle hide.", "The upper of a shoe is the part that covers the foot.", "Leather is the tanned or treated skin of an animal.", "The most common material is leather, but canvas and other textiles are also used, sometimes in combination with plastic.", "The foot is an anatomical structure found in many vertebrates. It is the terminal portion of a limb which bears weight and allows locomotion."]