["Snowboarding is a recreational activity and Olympic and Paralympic sport that involves descending a snow-covered slope while standing on a snowboard attached to a rider’s feet.", "Snowboarding is a recreational activity and Olympic and Paralympic sport that involves descending a snow-covered slope while standing on a snowboard attached to a rider's feet.", "Snowboarding is a recreational activity and Winter Olympic and Paralympic sport that involves descending a snow-covered slope while standing on a snowboard attached to a rider's feet.", "A snowboarder is a person who participates in the sport of snowboarding.", "A snowboarder is a person who practices the sport of snowboarding.", "The snowboarder is a person who practises snowboarding.", "Snowboarding is a winter sport that involves descending a slope that is covered with snow while standing on a snowboard attached to a rider's feet.", "A snowboarder is a person who practices snowboarding.", "Snowboarding is a winter sport that involves descending a slope that is covered with snow while standing on a snowboard attached to a rider's feet using a special boot set onto a mounted binding.", "A snowboard is a winter sport that involves descending a slope that is covered with snow while standing on a board attached to a rider's feet, using a special boot set onto a mounted binding.", "The snowboarder is in a crouching position.", "A snowboarder is a person who rides a snowboard. Snowboarders can be seen in the Winter Olympics and the X Games.", "The snowboarder is in a snowboarding stance.", "The snowboarder is in a crouched position.", "A snowboard is a device used for snowboarding. It consists of a board attached to a pair of boots.", "The snowboarder is in the squat position.", "The snowboarding posture is called a crouch.", "The snowboarder is in a crouched position called the crouch.", "Snowboarders use a snowboard stance, which is the way they stand on the snowboard.", "The snowboarding posture is called the crouch.", "The name of the snowboarding posture pictured here is a crouch.", "A snowboarder crouches on their snowboard with their legs bent and their knees close to their chest.", "The snowboarder is in a crouch.", "A snowboarder riding on a snowboard.", "A snowboarder crouching down is called a \"Stalefish\".", "In freestyle snowboarding, the rider's feet are not attached to the board, and the rider is free to move both feet independently.", "The Ollie is a skateboarding trick where the skateboarder and board leap into the air without the use of the rider's hands."]