["The event is a video game competition.", "A video game convention is an event that allows people to play video games.", "A video game convention is an event that is dedicated to video games.", "A video game convention or fair, which can also be called a gaming convention or simply a gaming expo, is an event in which video game developers, publishers, and fans gather.", "A video game convention is an event in which video game developers, publishers, hardware manufacturers, and players meet to show off their latest works.", "It's a video game event.", "A video game convention is an event in which video game developers, publishers, and fans gather.", "A video game competition is a competition involving video games.", "A video game competition.", "A video game competition is being held.", "A video game tournament is the competition of video gaming.", "The event is a video game tournament.", "A video game competition is a competition involving video games. Most commonly, it refers to a tournament in which multiple players compete for a large cash prize in a multiplayer video game.", "This is a video game competition.", "This is a gaming event.", "A video game is an electronic game that involves interaction with a user interface to generate visual feedback on a video device.", "A video game is an electronic game that involves human interaction with a user interface to generate visual feedback on a video device.", "A video game is an electronic game that involves interaction with a user interface to generate visual feedback on a video device such as a TV screen or computer monitor.", "A gaming convention.", "A video game console is an electronic, digital or computer device that outputs a video signal or visual image to display a video game that one or more people can play.", "An exhibition, in the most general sense, is an organised presentation and display of a selection of items. In practice, exhibitions usually occur within a cultural or educational setting such as a museum, art gallery, park, library, exhibition hall, or world's fairs.", "A trade show is an exhibition organized so that companies in a specific industry can showcase and demonstrate their latest products and services, meet with industry partners and customers, study activities of rivals, and examine recent market trends and opportunities.", "A video game console is an electronic device that produces a video display signal which can be used with a display device (a television, monitor, etc.) to display a video game.", "Wii is a video game console made by Nintendo.", "A Wii Remote is a controller used by Nintendo to play video games.", "A gaming convention is a convention for people who play video games.", "A Wii U is a video game console made by Nintendo.", "This is a gaming competition.", "The Wii (/wiː/ WEE; known unofficially as the Nintendo Wii) is a home video game console released by Nintendo on November 19, 2006.", "The Wii Remote, also known colloquially as the Wiimote, is the primary controller for Nintendo's Wii console.", "The Wii is a home video game console released by Nintendo on November 19, 2006. As a seventh-generation console, the Wii competed with Microsoft's Xbox 360 and Sony's PlayStation 3.", "The man is holding a wii remote control.", "A convention is a gathering of individuals who meet at an arranged place and time in order to discuss or engage in some common interest.", "A convention is a gathering of individuals who share a common interest or a meeting of people who have an interest in a particular subject.", "The event is a party.", "The E3 Media and Business Summit is an annual trade fair for the computer and video games industry presented by the Entertainment Software Association.", "An event is something that happens at a given place and time.", "E3 is an annual trade show for the computer and video games industry. The show is owned by the Entertainment Software Association (ESA), the U.S. association representing companies that publish computer and video games.", "A conference is a meeting of people who \"confer\" about a topic."]