["A ceiling fan can make a room brighter.", "The ceiling fans can be used to make the room brighter.", "A ceiling fan can make a room brighter by increasing the amount of light reflected off the walls.", "A lamp can make the room brighter.", "Turning on the lights could make the room brighter.", "The room can be brightened by turning on the light.", "A light bulb could make the room brighter.", "The room could be brighter if the light from the ceiling fan was turned on.", "The room could be brighter if you turn on the light.", "The room needs a light bulb.", "The room could be made brighter by opening the curtains.", "Lamps, lights, and other light sources can make a room brighter.", "The room could be made brighter by adding more light.", "The room could be made brighter by opening the curtains or turning on the lights.", "A brighter bulb could be installed in the ceiling fan.", "A light bulb could make this room brighter.", "The room could be made brighter by adding more lights or turning on the lights.", "The lamps in the room are not bright enough.", "Adding more lamps or lights to a room can make it brighter.", "The room could be brighter if the curtains were opened.", "Lighting is a very important feature in a living room.", "The most effective way to brighten up a dark room is to let natural light in.", "The room is dark.", "The room is not bright enough to read.", "Ceiling fans help to circulate air and keep the room cool.", "Ceiling fans can be used to help circulate air in a room.", "Ceiling fans are used to circulate air in a room.", "A ceiling fan is a mechanical fan, usually electrically powered, suspended from the ceiling of a room, that uses hub-mounted rotating paddles to circulate air.", "A ceiling fan is a mechanical fan mounted on the ceiling of a room or space, usually electrically powered, suspended from the ceiling of a room, that uses hub-mounted rotating paddles to circulate air.", "Ceiling fans are an energy efficient way to maintain a comfortable temperature in your home.", "The ceiling fan is a mechanical fan mounted on the ceiling of a room or space, usually electrically powered, suspended from the ceiling of a room, that uses hub-mounted rotating paddles to circulate air.", "Ceiling fans are a great way to cool your home.", "Lighting or illumination is the deliberate use of light to achieve a practical or aesthetic effect.", "Turn on the light.", "A light bulb is a device that produces light from electricity.", "a light bulb, a lamp, a window", "Turn on the lights.", "Open the curtains.", "Light is electromagnetic radiation within a certain portion of the electromagnetic spectrum."]