["Ducks are found in many countries.", "Ducks are found in many countries, including the United States, Canada, Mexico, Australia, New Zealand, and South Africa.", "Ducks are found in many countries, including the United States, Canada, China, Japan, and Australia.", "You can find ducks in many countries, such as Canada, Mexico, the United States, Australia, China, and India.", "The duck is a bird that lives in many countries.", "The country of the birds is in the United States of America.", "ducks are found in China.", "The birds are found in Canada, Greenland, Iceland, Norway, Sweden, Finland, Estonia, Latvia, Lithuania, Belarus, Ukraine, western Russia and Kazakhstan.", "The birds live in a country.", "The birds are found in the Americas, Europe, Asia, and Africa.", "These birds are found in Canada.", "The birds can be found in America.", "These birds are found in North America, Europe, Asia and Africa.", "Birds can be found in all countries in the world.", "Ducks are found on every continent except Antarctica.", "The bird is usually found in the United States.", "The birds are found in Europe and Asia.", "Birds are found in all countries of the world except Antarctica.", "You will find these birds in the United States.", "The birds are found in Canada.", "A duck is a small bird that lives in many countries.", "You will find these birds in the United States of America.", "The birds are found in a variety of habitats.", "Ducks are birds.", "You will find these birds in America.", "The birds are widely distributed and are found from the Arctic Circle to the equator.", "The United States of America (USA), commonly known as the United States (U.S.) or America, is a country composed of 50 states, a federal district, five major self-governing territories, and various possessions.", "The mallard is the most common duck species in North America, Europe, and Asia.", "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country composed of 50 states, a federal district, five major self-governing territories, and various possessions.", "Ducks are birds in the Anatidae family.", "The swan goose is a species of goose found in eastern Asia. In eastern Asia, it is found from eastern Kazakhstan and eastern Mongolia east to northeastern China, Korea and Japan.", "The United States of America (USA), commonly known as the United States (U.S.) or America, is a federal republic composed of 50 states, a federal district, five major self-governing territories, and various possessions.", "The United States of America is a country in North America.", "The United States of America is a federal republic consisting of 50 states, a federal district, five major territories, and various minor islands.", "The mallard is a dabbling duck that breeds throughout the temperate and subtropical Americas, Eurasia, and North Africa and has been introduced to New Zealand, Australia, Peru, Brazil, Uruguay, Argentina, Chile, Colombia, the Falkland Islands, and South Africa.", "The Mallard is a dabbling duck that breeds throughout the temperate and subtropical Americas, Eurasia, and North Africa and has been introduced to New Zealand, Australia, Peru, Brazil, Uruguay, Argentina, Chile, Colombia, the Falkland Islands, and South Africa.", "The mallard is a dabbling duck that breeds throughout the temperate and sub-tropical Americas, Eurasi", "A duck is a bird. Ducks are sometimes confused with several types of unrelated water birds with similar forms, such as loons or divers, grebes, gallinules, and coots.", "Ducks are birds characterized by a broad bill, short legs, and a waddling gait. Most ducks have a wide flat beak adapted for dredging.", "The Muscovy duck (Cairina moschata) is a large duck native to Mexico, Central, and South America.", "They are found in Australia.", "Birds are a group of endothermic vertebrates, characterised by feathers, toothless beaked jaws, the laying of hard-shelled eggs, a high metabolic rate, a four-chambered heart, and a strong yet lightweight skeleton.", "Birds are a group of warm-blooded vertebrates constituting the class Aves, characterized by feathers, toothless beaked jaws, the laying of hard-shelled eggs, a high metabolic rate, a four-chambered heart, and a strong yet lightweight skeleton."]