["The Nintendo Wii is a gaming system.", "Nintendo Wii is a gaming system.", "Wii is a gaming system.", "The Nintendo Wii is a video game console.", "Nintendo Wii is a video game console.", "The gaming system is Nintendo Wii.", "Nintendo Wii is a gaming console.", "Wii is a video game console made by Nintendo.", "The Wii is a video game console manufactured by Nintendo.", "The Nintendo Wii is a home video game console released by Nintendo.", "A Nintendo Wii is being played.", "The game is being played on a Nintendo Wii.", "A Nintendo Wii is a game console that was produced by Nintendo and first released on November 19, 2006.", "Nintendo Wii games are for the gaming system of the same name.", "The Wii (/wiː/ WEE) is a home video game console released by Nintendo on November 19, 2006. As a seventh-generation console, the Wii competed with Microsoft's Xbox 360 and Sony's PlayStation 3.", "The Nintendo Wii is a video game console that was released by Nintendo on November 19, 2006.", "The Wii is a home video game console released by Nintendo on November 19, 2006. As a seventh-generation console, the Wii competed with Microsoft's Xbox 360 and Sony's PlayStation 3.", "The Wii is a home video game console released by Nintendo on November 19, 2006. As a seventh-generation console, the Wii competes with Microsoft's Xbox 360 and Sony's PlayStation 3.", "The Wii is a home video game console released by Nintendo on November 19, 2006. As a seventh-generation console, the Wii primarily competes with Microsoft's Xbox 360 and Sony's PlayStation 3.", "Nintendo Wii", "The Wii U is a video game console developed by Nintendo as the successor to the Wii.", "Nintendo Wii game.", "The Nintendo Wii is a home video game console released by Nintendo on November 19, 2006.", "The Wii is a home video game console released by Nintendo on November 19, 2006.", "Nintendo is a Japanese multinational consumer electronics and video game company headquartered in Kyoto.", "A video game console is a device that outputs a video signal or visual image to display a video game that one or more people can play.", "A gaming system is a device that allows a person to play video games.", "A gaming system is being played."]