["There are several toothbrushes, so this is a family bathroom.", "A family bathroom is a room in a house that contains a bath and/or shower, a toilet and a washbasin. It is intended for use by more than one person.", "A family bathroom is a bathroom that is shared by more than one person.", "A family bathroom is a bathroom that is accessible to more than one person at a time.", "The bathroom is for a family of four.", "A family bathroom is a bathroom used by multiple people.", "The bathroom of a family.", "This is the bathroom of a family.", "This is a family bathroom.", "There are several toothbrushes.", "The bathroom is a room in the home for personal hygiene activities, generally containing a toilet, a sink and either a bathtub, a shower, or both.", "The bathroom is owned by a family.", "The bathroom is a room for personal hygiene activities, generally containing a toilet, a sink and either a bathtub, a shower, or both.", "Toothbrushes are used by people to clean the surfaces of their teeth.", "A bathroom is a room in the home for personal hygiene activities, generally containing a toilet, a sink, and either a bathtub, a shower, or both.", "Toothbrushes are used for cleaning teeth.", "A toothbrush is an oral hygiene instrument used to clean the teeth, gums, and tongue.", "The bathroom is a room in the home for personal hygiene activities, generally containing a sink (basin) and either a bathtub, a shower, or both.", "A toothbrush is an oral hygiene instrument used to clean the teeth, gums, and tongue. It consists of a head of tightly clustered bristle--fibers attached to a handle.", "The toothbrush is an oral hygiene instrument used to clean the teeth, gums, and tongue.", "The toothbrushes are for a family.", "Toothbrushes are used by families and individuals.", "Toothbrushes are used to clean the teeth, gums, and tongue.", "The toothbrush is an oral hygiene instrument used to clean the teeth, gums, and tongue. It consists of a head of tightly clustered bristles mounted on a handle which facilitates the cleansing of hard-to-reach areas of the mouth.", "Toothbrush is an oral hygiene instrument used to clean the teeth, gums, and tongue. It consists of a head of tightly clustered bristles mounted on a handle which facilitates the cleaning of hard to reach areas of the mouth.", "The bathroom is a room for personal hygiene activities, generally containing a toilet, a sink and either a bathtub, a shower, or both. It may also contain a bidet, which is used for personal cleansing after using the toilet.", "A family normally has more than one toothbrush.", "A family has more than one toothbrush.", "A family has multiple toothbrushes.", "There are three toothbrushes.", "the bathroom is the bathroom of a single person.", "The bathroom is a single person's bathroom.", "The toothbrushes are all different colors and sizes, indicating that they belong to more than one person.", "Electric toothbrushes are toothbrushes with an electric motor that oscillates or rotates, allowing the user to brush with less effort.", "An electric toothbrush is a toothbrush that makes rapid automatic bristle motions, either back-and-forth oscillation or rotation-oscillation (where the brush head alternates clockwise and counterclockwise rotation), in order to clean teeth.", "A family is a group of people who are related to each other.", "A family is a group of people who are related to each other, such as a mother, a father, and their children.", "A family is a group of people who share common ancestry, affection and co-residence (or any combination of these).", "A family is a group of people who share common ancestry, who may hold various social, economic, and spiritual roles in a society.", "A family is a group of people affiliated by consanguinity, affinity, or co-residence. In most societies it is the principal institution for the socialization of children.", "family", "The average family of four uses approximately 400 gallons of water per day."]