["The wetsuit was invented by Jack O'Neill in the 1950s.", "The wetsuit was invented by Jack O'Neill.", "The wet suit was invented by Jack O'Neill.", "The wetsuit was invented by Jack O'Neill in 1952.", "Jack O'Neill invented the wetsuit.", "Jack O'Neill invented the wet suit in 1952.", "The wetsuit was invented by Jack O'Neill, a surfer and inventor who lived in San Francisco, California.", "Jack O’Neill is the inventor of the wetsuit.", "The wetsuit, invented in 1952 by Hugh Bradner, is a close-fitting suit made of neoprene, a synthetic rubber that provides thermal insulation.", "The wetsuit was invented by Rodney and Jack O'Neill in 1952.", "The long wet suit was invented by Jack O'Neill.", "The wetsuit was invented by Jack O'Neill, an American surfer and businessman from San Francisco.", "The wetsuit was invented in 1952 by Hugh Bradner, a University of California at Berkeley physicist who tested his suit at the San Francisco Bay.", "The wetsuit was invented by Hugh Bradner, a University of California, Berkeley physicist, around 1952.", "The wetsuit was invented in 1952 by Hugh Bradner, a University of California, Berkeley physicist who used the suit in his study of hypothermia.", "The wet suit was invented by Hugh Bradner, a University of California, Berkeley physicist and United States Navy officer, in 1952.", "John Joseph \"Jack\" O'Neill was an American businessman and surfer who is widely credited as the inventor of the wetsuit.", "The wetsuit was invented in 1952 by Hugh Bradner, a University of California at Berkeley physicist.", "The wet suit was invented in 1952 by Hugh Bradner.", "The modern wetsuit was invented by Hugh Bradner, a University of California, Berkeley physicist, around 1952.", "The first wetsuit was made in 1952 by Jack O'Neill, who made the first one out of neoprene.", "Wetsuits were invented by Hugh Bradner, a University of California, Berkeley physicist and former member of the United States Navy.", "The modern wet suit was invented by Hugh Bradner, a physicist working with the United States Navy.", "The first wetsuits were made by the U.S. Navy in the 1940s to protect divers from the cold water.", "The wetsuit was developed by the U.S. Navy in the 1950s for the protection of divers.", "James \"Ding\" How, a surfer from Torquay, Australia, is credited with inventing the wetsuit.", "Wetsuits are made of neoprene, which is a type of synthetic rubber.", "The Japanese invented the wet suit.", "The wetsuit is a garment, usually made of foamed neoprene, which is worn by surfers, divers, windsurfers, canoeists, and others engaged in water sports, providing thermal insulation, abrasion resistance and buoyancy.", "The wetsuit is a garment, usually made of foamed neoprene, which is worn by surfers, divers, windsurfers, canoeists, and others engaged in water sports and other activities in or on water, primarily providing thermal insulation, but also buoyancy and protection from abrasion, ultraviolet exposure and stings from marine organisms.", "A wetsuit is a garment, usually made of foamed neoprene, which is worn by surfers, divers, windsurfers, canoeists, and others engaged in water sports, providing thermal insulation, abrasion resistance and buoyancy.", "The wetsuit is a neoprene suit designed to insulate the body from the cold water.", "A wet suit is a garment, usually made of foamed neoprene, which is worn by surfers, divers, windsurfers, canoeists, and others engaged in water sports, providing thermal insulation, abrasion resistance and buoyancy.", "The wet suit first appeared in the early 1930s as a solution to the problem of divers and surfers getting hypothermia in cold water.", "A wet suit is an insulating suit made of neoprene, a type of synthetic rubber.", "Diving suits were invented by the ancient Greeks.", "the suit is invented by the O'Neill.", "Jack O'Neill invented this kind of suit.", "Jack O'Neill is a pioneer in the sport of surfing.", "Surfing is a surface water sport in which the wave rider, referred to as a surfer, rides on the forward or deep face of a moving wave, which is usually carrying the surfer towards the shore.", "Surfing was first observed by British explorers at Tahiti in 1767.", "Neoprene is a family of synthetic rubbers that are produced by polymerization of chloroprene."]