["The person celebrating a birthday is 35 years old.", "The person is celebrating their birthday.", "A person is celebrating a birthday.", "a person is celebrating his birthday.", "The person is celebrating his/her 35th birthday.", "The person celebrating a birthday is 35.", "A birthday is an occasion when a person or institution celebrates the anniversary of their birth.", "A birthday is an annual celebration of the date on which a person was born.", "A birthday is a day that commemorates the anniversary of the birth of a person.", "The person is celebrating their 35th birthday.", "Birthday is the anniversary of the birth of a person, or figuratively of an institution.", "A birthday is the anniversary of the birth of a person, or figuratively of an institution.", "The person is celebrating a 35th birthday.", "A birthday is an occasion when a person or institution celebrates the anniversary of their birth. Birthdays are celebrated in numerous cultures, often with a gift, party, or rite of passage.", "A birthday is a day where a person is born.", "A birthday is the anniversary of the birth of a person, or figuratively of an institution. Birthdays of people are celebrated in numerous cultures, often with birthday gifts, birthday cards, a birthday party, or a rite of passage.", "Birthday is the day of the birth of a person, or figuratively an institution.", "The person is celebrating his 35th birthday.", "The person is celebrating his/her 40th birthday.", "The person is celebrating their 40th birthday.", "The person is celebrating his 40th birthday.", "People celebrate their birthdays on the day they were born.", "People start to celebrate their birthdays since they are born.", "The person is celebrating 12th birthday.", "The person is celebrating a 12th birthday.", "The number of the candles is the age of the person celebrating the birthday.", "A birthday cake is a cake eaten as part of a birthday celebration.", "The number of candles on a birthday cake is the age of the person celebrating their birthday.", "A birthday cake is a cake eaten as part of a birthday celebration in many world traditions.", "the cake is a birthday cake.", "The person is turning 35.", "A person's age is the number of years they have been alive.", "The person is 35 years old.", "The person is 40 years old.", "Age is the length of time that someone has lived or something has existed.", "The age at which a person is considered a legal adult in the US", "The cake is a rectangular cake top with a number 12 candle.", "The person is 12 years old."]