["Mountain biking is a sport that is practiced in this picture.", "Mountain biking is a sport in which people ride bicycles off-road, often over rough terrain, using specially designed mountain bikes.", "mountain biking is the sport of riding bicycles off-road, often over rough terrain, using specially designed mountain bikes.", "Mountain biking is the sport of riding bicycles off-road, often over rough terrain, using specially designed mountain bikes.", "Mountain biking is the sport of riding bicycles off-road, often over rough terrain.", "Mountain biking is a sport of riding bicycles off-road.", "Mountain biking is a sport of riding bicycles off-road, often over rough terrain, using specially designed mountain bikes.", "Mountain biking is the sport of riding bicycles off-road.", "The sport of mountain biking involves riding bicycles off-road, often over rough terrain, using specially designed mountain bikes.", "Mountain biking is the sport of riding bicycles off-road, often over rough terrain, using specially designed mountain bikes. Mountain bikes share similarities with other bikes, but incorporate features designed to enhance durability and performance in rough terrain.", "Mountain biking is a sport of riding bicycles off-road, often over rough terrain, using specially designed mountain bikes. Mountain bikes share similarities with other bikes but incorporate features designed to enhance durability and performance in rough terrain.", "Mountain biking is a sport.", "Cycling, also called bicycling or biking, is the use of bicycles for transport, recreation, or for sport.", "Cycling, also called bicycling or biking, is the use of bicycles for transport, recreation, exercise or sport.", "Cycling, also called biking or bicycling, is the use of bicycles for transport, recreation, exercise or sport.", "Cycling is a sport in which people ride bicycles.", "Biking is a sport.", "BMX is a cycle sport performed on BMX bikes, either in competitive BMX racing or freestyle BMX, or else in general on- or off-road recreation."]