["People spend about 2 hours a day taking photos.", "People usually spend one hour taking photos.", "People usually spend about one hour taking pictures.", "Most people spend about 5 minutes taking pictures.", "People spend an average of 4 hours a day on their phones.", "People spend an average of 5.4 hours a day on their phones.", "People spend about 3 hours on their smartphones per day.", "People spend about an hour taking photos.", "People spend about 10 minutes per day on their phone.", "People spend an average of 4 hours per day on their phones.", "People spend about 50 minutes a day using their cell phones.", "People spend 2 hours taking pictures.", "Most people spend about an hour on their phone a day.", "People spend about an hour taking pictures.", "People usually spend about 15 minutes a day on this activity.", "People usually spend about 3 hours doing this activity.", "People usually spend 3 hours a day using their smart phones.", "People usually spend about 10 minutes taking photos.", "People usually spend a few minutes taking pictures.", "People spend about 10 minutes taking photos.", "People usually spend about an hour doing this activity.", "people usually spend 3 hours doing this activity.", "People spend a lot of time on their phones.", "The average American spends 24 minutes per day taking photos and videos, according to a survey by the Pew Research Center.", "The average person spends about 2 hours a day on their phone.", "People spend a lot of time taking pictures.", "The average person spends about 2 hours and 51 minutes on their phone every day.", "The average person spends over 2 hours a day on their phone.", "People usually spend about 15 minutes doing this activity.", "Some people spend a long time taking photos.", "The average person spends about two hours a day on their phone.", "The average person spends 1 hour and 40 minutes on their phone each day.", "people spend a lot of time doing this activity.", "People usually spend 10 minutes doing this activity.", "The average person spends nearly two hours a day on social media.", "The average person will spend up to two hours a day (or 14 hours a week) on social media.", "The average person spends about 2 hours and 51 minutes each day social networking and messaging, according to data provided by Nielsen.", "People spend more time on their phones than they think.", "The average person takes about thirty minutes to take a photo.", "People spend a few minutes taking pictures of an airplane.", "People spend about 10 to 20 minutes photographing an airplane.", "people are taking photos.", "The average adult spends about 28% of their day using a computer.", "This activity takes about 5 minutes."]