["These jets can typically be seen at air shows, military bases, or other aviation events.", "These jets can often be seen at air shows, military bases, and other aviation events.", "These jets can be seen at air shows, military bases, and other aviation events.", "These jets can be seen at air shows and military bases.", "These jets can typically be seen at air shows, military bases, and airfields.", "These jets can be seen flying in formation at air shows, military exercises, and other special events.", "These jets can be seen at air shows, military exercises, and other aviation-related events.", "Military jets flying in formation can often be seen at air shows.", "Military jets flying in formation can be seen at air shows, military exercises, and other special events.", "Military jets can often be seen flying in formation at air shows.", "These jets can be seen at air shows, military bases, and other airfields.", "These jets can be seen at air shows, military demonstrations, or in the sky during flyovers.", "These jets can be seen at air shows, military bases, and aviation museums.", "You would typically see these jets flying in formation at an air show or military base.", "Military jets can often be seen at air shows, which are events where aircrafts are showcased to the public.", "You would typically see these jets flying in formation at an air show or military demonstration.", "You can often see jets flying in formation at air shows or military exercises.", "Military jets can be seen performing at air shows, which are events that showcase the capabilities of aircraft and their pilots.", "Military jets can be seen performing aerial maneuvers at air shows, which are held in many cities around the world.", "You would typically see jets flying in formation at an air show. Air shows are events where aircraft are displayed and performed in aerobatic displays.", "You would most likely see these jets flying in formation at an air show or military exercise.", "You would typically see these at an air show.", "Military airshows are held at airbases, airshows, and other military installations around the world. These events typically feature a variety of aircraft, including fighter jets, bombers, transport aircraft, and helicopters."]