["The delete key on a keyboard allows someone to remove text.", "The delete key on a computer keyboard is used to remove text to the left of the cursor.", "The backspace key is a key on a typewriter or computer keyboard that causes the device to produce a backspace, moving the cursor towards the left one space.", "The backspace key is a key on a computer keyboard. It is typically used to delete text to the left of the cursor.", "The backspace key is a key on a computer keyboard that deletes any character before the cursor's current position.", "The backspace key is the key on a computer keyboard that deletes any character before the cursor's current position, including spaces, letters, and punctuation.", "The Delete key is a key on most computer keyboards which typically is used to delete either (in text mode) the character ahead of or beneath the cursor, or (in GUI mode) the currently-selected object.", "The delete key is a key on most computer keyboards which typically is used to delete either (in text mode) the character ahead of or beneath the cursor, or (in GUI mode) the currently-selected object.", "The backspace key allows someone to remove text.", "Backspace is the key that allows someone to remove text.", "The delete key.", "Backspace is a keyboard key that deletes any character before it.", "The backspace key is a key on a computer keyboard that deletes any character before the cursor's current position, moving the cursor backwards.", "The backspace key is a key on a computer keyboard that deletes any character before the cursor's current position, moving the cursor backward.", "The backspace key is a key on a computer keyboard that deletes any character before the cursor's current position, moving the cursor backward one space.", "The backspace key is a key on a computer keyboard that deletes any character before the cursor's current position, moving the cursor backward a space.", "The backspace key is a key on a computer keyboard that deletes any character before the cursor's current position, including spaces.", "The backspace key is a keyboard key that deletes any character before the cursor's current position, including spaces.", "The backspace key removes text.", "The Delete key is used to remove text.", "The delete key allows someone to remove text.", "Delete key allows someone to remove text.", "The backspace key.", "The delete key removes text.", "A keyboard is a device used to input text into a computer or other device.", "A keyboard is a typewriter-style device which uses an arrangement of buttons or keys to act as mechanical levers or electronic switches.", "Delete"]