["A shepherd's duties may include herding of sheep, feeding, and grooming of sheep, and the treatment of sheep in case of injury or illness.", "The other duties of this occupation are to shear the sheep, castrate the males, and treat the sheep for parasites.", "The other duties of this occupation are to shear the sheep.", "Other duties of this occupation include shearing sheep, maintaining fences, buildings, and equipment, and maintaining records of sheep production.", "The shepherd's responsibilities often include herding the sheep, feeding them, and protecting them from predators.", "The sheepherder is responsible for the care and protection of the sheep.", "The shepherd's responsibilities may include herding the sheep, feeding them, and taking them to market.", "The duties of a shepherd are to herd sheep, protect sheep from predators, and provide food and shelter for sheep.", "A shepherd or sheepherder is a person who tends, herds, feeds, or guards herds of sheep.", "The other duties of a shepherd are to keep the sheep in good condition, protect them from predators, and provide them with shelter, water and food.", "The sheepherder is responsible for the care and management of a herd of sheep.", "The other duties of this occupation is to keep track of the sheep.", "Shepherds also commonly milk their sheep, and may cut their wool. Shepherding is an ancient occupation, whose duties may date back to the Mesolithic period.", "The shepherd's other duties include safeguarding the sheep from theft by humans and protecting them from predators.", "The sheepherder is a person who tends to sheep.", "Shepherds are responsible for the care of the sheep.", "sheep shearers are responsible for removing the wool from sheep.", "The other duties of this occupation include: shearing sheep, vaccinating sheep, and moving sheep from one pen to another.", "Shepherds are responsible for the day-to-day care of their sheep, including feeding, herding, and protecting them from predators.", "Sheep herders are responsible for the health and well-being of the sheep.", "Shepherd's duties often include tending to flocks, protecting them from predators, and providing them with food and water.", "Farmers also shear sheep for their wool.", "The shepherd is usually responsible for protecting the sheep from predators.", "The other duties of this occupation are to maintain the shearing shed, to carry out maintenance on shearing plant and equipment, and to maintain records of sheep health.", "Shepherds typically use their dogs to keep the sheep in the flock.", "Sheep shearers are individuals who have the job of cutting the wool off of sheep.", "The sheepherder must keep the flock together, watch for predators and keep the sheep from straying.", "Sheep shearing is the process by which the woolen fleece of a sheep is cut off. The person who removes the sheep's wool is called a shearer. Typically each adult sheep is shorn once each year (a sheep may be said to have been \"shorn\" or \"sheared\", depending upon dialect).", "Sheep shearers are typically self-employed contractors who move from farm to farm shearing sheep.", "Sheep shearing is the process by which the woollen fleece of a sheep is cut off. The person who removes the sheep's wool is called a shearer. Typically each adult sheep is shorn once each year (a sheep may be said to have been \"shorn\" or \"sheared\", depending upon dialect).", "A shepherd is a person who tends, herds, feeds, or guards flocks of sheep.", "Sheep shearing is the process by which the woolen fleece of a sheep is cut off.", "Sheep shearing is the process by which the woollen fleece of a sheep is cut off. The person who removes the sheep's wool is called a shearer.", "Shepherds are often responsible for protecting their flocks from predators.", "Sheep shearing is the process by which the woollen fleece of a sheep is cut off.", "Shepherds are often responsible for protecting their flocks from predators, and this can involve the use of firearms, dogs, and other methods.", "Sheep shearers are typically paid on a piece rate, i.e., per sheep", "The farmer's duties include planting and harvesting crops, raising animals, and maintaining farmland.", "Shepherds commonly feed their flocks with their own hands, and are generally out in the fields with them all day, every day.", "Duties vary greatly according to the size, type, and philosophy of the farm.", "The farmer's job is to raise crops and animals."]