["Pizza is a type of food that originated in Italy.", "The pizza was made in Italy.", "The Pizza is made in Italy.", "The pizza was made in the United States.", "Pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients baked at a high temperature, traditionally in a wood-fired oven.", "Pizza is a savory dish of Italian origin consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients (anchovies, olives, meat, etc.) baked at a high temperature, traditionally in a wood-fired oven.", "A pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients baked at a high temperature, traditionally in a wood-fired oven.", "Pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients (anchovies, olives, meat, etc.) baked at a high temperature, traditionally in a wood-fired oven.", "This pizza was made in Italy.", "Pizza is a traditional Italian dish consisting of a yeasted flatbread typically topped with tomato sauce and cheese and baked in an oven. It can also be topped with additional vegetables, meats, and condiments, and can be made without cheese.", "Pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients.", "Pizza is a traditional Italian dish consisting of a yeasted flatbread typically topped with tomato sauce and cheese and baked in an oven.", "Pizza is a type of food that originated in Italy. It has since become popular in many parts of the world. A shop or restaurant where pizzas are made and sold is called a \"pizzeria\".", "Pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients (anchovies, olives, meat, etc.) baked at a high temperature, traditionally in a wood-fired oven. In formal settings, like a restaurant, pizza is eaten with knife and fork, but in casual settings it is cut into wedges to be eaten while held in the hand. Small pizzas are sometimes called pizzettas.", "Pizza was invented in Naples, Italy.", "Pizza is a type of food made with leavened dough, usually round, and usually covered with tomatoes or a tomato sauce, cheese and various toppings. It is baked at a high temperature, traditionally in a wood-fired oven.", "Pizza is a type of bread and tomato dish, often served with cheese.", "The pizza was made in the oven.", "Pizza is a yeasted flatbread typically topped with tomato sauce and cheese and baked in an oven.", "The pizza was made in the kitchen.", "The pizza is made in the kitchen.", "Pizza is cooked in an oven.", "A pizza is a round, flat bread typically topped with a tomato sauce, cheese and various toppings.", "The pizza was baked in an oven.", "Pizza was invented in Naples, Italy, and the Neapolitan style is the most authentic.", "This was made in the United States.", "Italy is a country in Europe.", "Italy is a country in southern Europe."]