["London is the capital of England and the United Kingdom.", "The most common type of bus service is scheduled route service.", "London is the capital city of England and the United Kingdom.", "This photo was taken in the United Kingdom.", "London is the capital of the United Kingdom.", "The United Kingdom of Great Britain and Northern Ireland, commonly known as the United Kingdom (UK) or Britain, is a sovereign country in western Europe.", "The United Kingdom of Great Britain and Northern Ireland, commonly known as the United Kingdom (UK or U.K.) or Britain, is a sovereign country located off the north-western coast of the European mainland.", "This photo was taken in London, England.", "The United Kingdom of Great Britain and Northern Ireland, commonly known as the United Kingdom or Britain, is a sovereign country in western Europe.", "London is the capital and largest city of England and the United Kingdom.", "London is the capital and largest city of both England and the United Kingdom.", "The bus is a double decker bus, which is a bus that has two levels or decks.", "London is the capital and most populous city of England and the United Kingdom.", "Tour buses provide a comfortable method of transportation for groups of people who are traveling together.", "London is the capital city of England.", "A double-decker bus is a bus that has two storeys or decks. Double-decker buses are used for mass transport in the United Kingdom, Europe, Asia and many former European possessions, the most iconic example being the red London bus.", "London is the capital of England and the United Kingdom. It is the largest city in the United Kingdom, with a population of over 8 million.", "United Kingdom is a sovereign country in western Europe.", "England is a country that is part of the United Kingdom. It shares land borders with Scotland to the north and Wales to the west.", "This photo was taken in England.", "The photo was taken in England.", "The country is England.", "The photo was taken in London, UK.", "Tour buses are usually for tourists, and tourists are usually not from the country where the tour bus is in.", "This was taken in London, England."]