["a plane is landing.", "A plane is taking off is an aircraft that is moving on the ground prior to lift-off.", "Airplane is taking off.", "The plane is taking off.", "A plane is taking off.", "A jet airplane is an airplane that is powered by jet engines.", "A plane is a type of aircraft that has fixed wings and is propelled forward by thrust from a jet engine or propeller.", "Aircraft are usually propelled by one or more jet engines, which are also used to provide thrust for the landing and take-off.", "If the plane is on the ground, it is landing. If the plane is in the air, it is taking off.", "The plane is landing.", "A plane is taking off if it is on the runway and landing if it is on the ground.", "An airplane or aeroplane (informally plane) is a powered, fixed-wing aircraft that is propelled forward by thrust from a jet engine or propeller.", "A plane takes off from the runway.", "The plane is on the ground, so it is landing.", "Airplanes are vehicles that fly through the air.", "The airplane is landing.", "A jet aircraft, or jetliner, is an aircraft propelled by jet engines.", "A plane is taking off when it is moving forward.", "Airport, aerodrome, or airfield is a location from which aircraft take off and land.", "A jet aircraft (or simply jet) is an aircraft (nearly always a fixed-wing aircraft) propelled by jet engines (jet propulsion).", "Jets take off and land by using their engines.", "A jet airliner is an airliner powered by jet engines (passenger jet aircraft). Airliners usually have two or four jet engines; three-engined designs were popular in the 1970s but are less common today.", "A passenger jet is a jet airliner designed to carry passengers.", "Landing is the last part of a flight, where a flying animal, aircraft, or spacecraft returns to the ground.", "A landing is the last part of a flight, where a flying animal, aircraft, or spacecraft returns to the ground.", "A jet engine is a type of reaction engine discharging a fast-moving jet that generates thrust by jet propulsion.", "A runway is a rectangular area on an aerodrome prepared for the landing and takeoff of aircraft.", "An airport is an aerodrome with extended facilities, mostly for commercial air transport. Airports often have facilities to store and maintain aircraft, and a control tower.", "An airport is an aerodrome with extended facilities, mostly for commercial air transport.", "Jet engines can be classified according to the type of cycle used to produce power.", "The Boeing 747 is an American wide-body commercial jet airliner and cargo aircraft, often referred to by its original nickname, Jumbo Jet.", "It is taking off.", "A plane is a flat surface that extends infinitely in all directions.", "The landing gear of an aircraft includes the wheels, skids, floats, or pontoons."]