["The bed is an air mattress.", "The bed is aero mattress.", "This is an air mattress.", "The bed is a blow-up mattress.", "It is a sleeper bed.", "An air mattress is an inflatable mattress/sleeping pad.", "A bed is a piece of furniture which is used as a place to sleep or relax.", "An air mattress is an inflatable mattress/sleeping pad. Due to its buoyancy, it is also often used as a water toy/flotation device.", "It is a sofa bed.", "A waterbed is a mattress with water in it.", "Aero bed is a kind of bed.", "Aero beds are mattresses that are inflated by pumps.", "A mattress is a large pad for supporting the reclining body, used as a bed or as part of a bed.", "AeroBed is an air mattress brand.", "a mattress is a large pad for supporting the reclining body, used as or on a bed.", "A mattress is a large pad for supporting the reclining body, used as or on a bed.", "An air mattress is an inflatable mattress.", "This is a water bed.", "Air mattresses are inflatable mattresses.", "A mattress is a large, rectangular pad for supporting the reclining body, designed to be used as a bed or on a bed frame, as part of a bed.", "Aero bed is a brand of air mattress.", "The bed is a water bed.", "A futon is a flat mattress that can be folded up to be used as a couch or recliner.", "AeroBed is a brand of inflatable mattresses that are manufactured by the Aero Products International company.", "Air mattresses are inflated by blowing air into a valve.", "A bunk bed is a type of bed in which one bed frame is stacked on top of another.", "The bed is a raised bed.", "An air mattress is an inflatable mattress/sleeping pad. Due to its buoyancy, it is also often used as a water toy / flotation device, and in some countries, including the UK, is called a lilo (an abbreviation of \"li-lo\", a proprietary name).", "The bed is a sleeping bag.", "an air mattress or an airbed is an inflatable mattress, the vast majority of which are usually made of polyvinyl chloride (PVC), although recently developed textile-reinforced urethane plastic or rubber versions exist.", "The air mattress is an inflatable mattress/sleeping pad. Due to its buoyancy, it is also often used as a water toy/flotation device, and in some countries, including the UK, is called a lilo (an abbreviation of \"li-lo\", a proprietary eponym).", "A waterbed is a bed or mattress with a water-filled cavity.", "A futon is a Japanese traditional style of bedding consisting of padded mattresses and quilts pliable enough to be folded and stored away during the day, allowing the room to serve for purposes other than as a bedroom.", "The sleeper is a bed which is a bed that has a bed which is a bed that is a bed that is a bed that is a bed that is a bed that is a bed that is a bed that is a bed that is a bed that is a bed that is a bed that is a bed that is a bed that is a bed that is a bed that is a bed that is a bed that is a bed that is a bed that is a bed that is a bed that is a bed that is a bed that is a bed that is a bed that is a bed that is a bed that is a bed that is", "A futon is the Japanese traditional style of bedding.", "A futon is the Japanese traditional style of bedding. A complete futon set consists of a mattress, called a shikibuton, and a quilt, called a kakebuton.", "The bed is one of the most important pieces of furniture in the home.", "A sleeper is a type of bed that is used on a train.", "A sleeping bag is a protective bag for a person to sleep in, essentially a blanket that can be closed with a zipper or similar means."]