["Most disposable cups are made of polystyrene, a petroleum-based plastic resin.", "The disposable cups are usually made from plastic.", "Disposable cups are usually made of plastic.", "Most disposable cups are made from plastic.", "Disposable cups are usually made of paper or plastic.", "Disposable cups are typically made out of either paper or plastic.", "The cups are usually made of plastic.", "The cups are made of polystyrene.", "The cups are made of plastic.", "Disposable cups are usually made from paper.", "The material of the cups is plastic.", "Disposable food containers are usually made from paper and plastic.", "The plastic is made of polystyrene.", "Paper cups are disposable cups made out of paper and often lined or coated with plastic or wax to prevent liquid from leaking out or soaking through the paper.", "Paper cups are usually made of paper.", "Paper cups are usually made from paper.", "The cups are made of paper.", "The cups are made from paper.", "Disposable food containers are usually made of polystyrene.", "A paper cup is a disposable cup made out of paper and often lined with plastic or wax to prevent liquid from leaking out or soaking through the paper. It may be made of recycled paper and is widely used around the world.", "The paper cup is a disposable cup made out of paper and often lined or coated with plastic or wax to prevent liquid from leaking out or soaking through the paper.", "Paper cups are made from paper and are usually lined with plastic to prevent liquid from leaking out or soaking through the paper.", "Paper cups are made from paper, a material made from wood pulp or other plant fibres.", "Disposable food containers are usually made of plastic.", "Paper cups are made of paper and are commonly used for hot drinks.", "Disposable food containers are usually made of synthetic material.", "The disposable food container is made of plastic.", "The stacked disposable food containly are usually made fom plastic.", "paper cup", "Plastic is a synthetic material.", "A disposable cup is a type of tableware and disposable food packaging.", "The stacked disposable food containly usually made fom polystyrene.", "Plastic is material consisting of any of a wide range of synthetic or semi-synthetic organic compounds that are malleable and so can be molded into solid objects.", "Polystyrene is a synthetic aromatic polymer made from the monomer styrene.", "Polystyrene is a synthetic aromatic hydrocarbon polymer made from the monomer styrene.", "Polystyrene (PS) /ˌpɒliˈstaɪriːn/ is a synthetic aromatic polymer made from the monomer styrene. Polystyrene can be solid or foamed. General-purpose polystyrene is clear, hard, and rather brittle. It is an inexpensive resin per unit weight.", "Paper is a thin material produced by pressing together moist fibres of cellulose pulp derived from wood, rags or grasses, and drying them into flexible sheets.", "Polystyrene (PS) /ˌpɒliˈstaɪriːn/ is a synthetic aromatic hydrocarbon polymer made from the monomer styrene.", "Synthetic materials are made from chemicals."]