["A meal is an eating occasion that takes place at a certain time and includes prepared food.", "a meal is a portion of food, generally eaten at a table with utensils.", "This is a meal.", "A bowl of salad is a snack.", "A meal is a portion of food, generally eaten at a table or otherwise eaten as part of a one or more courses.", "A snack is a small portion of food eaten between meals.", "A meal is a collection of food eaten together, usually for breakfast, lunch, or dinner.", "A snack is a portion of food, smaller than a regular meal, generally eaten between meals.", "A meal is a part of a day's food intake that takes place at a certain time and includes specific, prepared food, or the food eaten on that occasion.", "A snack is a portion of food often smaller than a regular meal, generally eaten between meals.", "A meal is an eating occasion that takes place at a certain time and includes specific, prepared food, or the food eaten on that occasion. The names used for specific meals in English vary, depending on the speaker's culture, the time of day, or the size of the meal.", "A bowl of salad is a meal.", "It’s a meal.", "The bowl is a snack.", "A snack is a portion of food, smaller than a regular meal, generally eaten between meals. Snacks come in a variety of forms including packaged snack foods and other processed foods, as well as items made from fresh ingredients at home.", "Broccoli is a meal.", "Food is any substance consumed to provide nutritional support for an organism. It is usually of plant or animal origin, and contains essential nutrients, such as carbohydrates, fats, proteins, vitamins, or minerals.", "Salad is a dish consisting of a mixture of small pieces of food, usually vegetables.", "This is a snack.", "Broccoli is a vegetable.", "A salad is a dish that consists of a mixture of small pieces of food, usually vegetables or fruit. However, different varieties of salad may contain virtually any type of ready-to-eat food.", "Broccoli is a member of the cabbage family, and it's a cruciferous vegetable.", "Broccoli is a cool-weather crop that does poorly in hot summer weather.", "Snacks are generally considered an easy to carry and eat food.", "A bowl is a round, open-top container used in many cultures to serve food, and is also used for drinking and storing other items.", "A bowl of cereal is a breakfast cereal served in a bowl with milk added to it."]