["Buses are powered by diesel fuel.", "Buses are fueled by diesel fuel.", "The fuel used in buses are diesel.", "Buses are powered by diesel fuel, which is used in vehicles that run on diesel engines.", "The fuel used by buses is diesel.", "Buses are fueled by diesel.", "Buses run on diesel fuel.", "Buses are powered by diesel or gasoline.", "Buses use diesel fuel.", "Most buses use diesel fuel.", "Buses are powered by diesel engines.", "Most buses use diesel fuel, but some use natural gas, electric power, or other alternative fuels.", "The majority of buses use diesel fuel.", "The majority of buses use diesel fuel, but some buses use other fuels such as natural gas or biodiesel.", "These buses use diesel fuel.", "Most buses use diesel fuel, but some use natural gas or electricity.", "Buses are mostly diesel-powered.", "Buses are usually powered by diesel engines.", "Buses can be fuelled by diesel, gasoline, compressed natural gas, biodiesel, hydrogen fuel cells, and electric batteries.", "Buses are powered by diesel, gasoline, natural gas, electricity or biogas.", "The buses use gasoline or diesel fuel.", "Buses are usually fueled by diesel, gasoline, compressed natural gas, biodiesel, ethanol, or battery electric.", "Buses are powered by diesel, gasoline, natural gas, electricity, and hydrogen.", "The transit bus is powered by diesel or gasoline.", "The buses are gas powered.", "Diesel fuel is used to power the engines of large vehicles such as trucks, buses, trains and ships.", "Gasoline buses are powered by gasoline.", "The bus uses a gasoline engine.", "The city bus is powered by a diesel engine.", "Buses and trains are powered by electricity.", "A bus is a road vehicle designed to carry passengers.", "A bus is a road vehicle designed to carry many passengers.", "The fuel used in buses varies depending on the type of bus, the type of bus, and the type of bus, the type of bus, the type of bus, and the type of bus.", "Diesel fuel is used to power a diesel engine.", "A bus is a road vehicle designed to carry many passengers. Buses can have a capacity as high as 300 passengers.", "Buses and coaches are a safe and efficient means of transport.", "Diesel fuel is a type of fuel used in diesel engines to power them.", "A bus (archaically also omnibus, multibus, motorbus, autobus) is a road vehicle designed to carry many passengers.", "Diesel fuel.", "Diesel fuel in general is any liquid fuel used in diesel engines, whose fuel ignition takes place, without any spark, as a result of compression of the inlet air mixture and then injection of fuel.", "A bus (contracted from omnibus, with variants multibus, motorbus, autobus, etc.) is a road vehicle designed to carry many passengers.", "Diesel is a fraction obtained from petroleum distillation, either as a distillate or a residue. Diesel engines have found broad use as a result of higher thermodynamic efficiency and thus fuel efficiency.", "A diesel engine is an internal combustion engine that uses the heat of compression to initiate ignition to burn the fuel, which is injected into the combustion chamber during the final stage of compression.", "Gasoline is a transparent, petroleum-derived liquid that is used primarily as a fuel in spark-ignited internal combustion engines."]