["Pepperoni pizza is a type of pizza.", "Pizza is a savory dish of Italian origin consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients.", "Pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients.", "The pizza is a pepperoni pizza.", "A pepperoni pizza is a type of pizza that is topped with pepperoni.", "Pepperoni pizza is a pizza made with pepperoni.", "It is a pepperoni pizza.", "This is a pepperoni pizza.", "Pepperoni is a popular pizza topping.", "Pizza is a traditional Italian dish consisting of a yeasted flatbread typically topped with tomato sauce and cheese and baked in an oven. It can also be topped with additional vegetables, meats, and condiments, and can be made without cheese.", "Pepperoni is a popular pizza topping in North America.", "Pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients baked at a high temperature, traditionally in a wood-fired oven.", "A pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients (anchovies, olives, meat, etc.) baked at a high temperature, traditionally in a wood-fired oven.", "Pizza is a traditional Italian dish consisting of a yeasted flatbread typically topped with tomato sauce and cheese and baked in an oven.", "Pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients (anchovies, olives, meat, etc.) baked at a high temperature, traditionally in a wood-fired oven.", "A pizza is a flatbread generally topped with tomato sauce and cheese and baked in an oven. It is commonly topped with a selection of meats, vegetables and condiments.", "Pizza is a flatbread generally topped with tomato sauce and cheese and baked in an oven. It is commonly topped with a selection of meats, vegetables and condiments.", "A pizza is a round, flattened base of dough baked with a topping of tomato sauce and cheese, typically with added meat or vegetables.", "Pizza is a type of food made with leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients baked at a high temperature, traditionally in a wood-fired oven.", "This is a deep dish pizza.", "A Chicago-style pizza is a deep-dish pizza.", "The pizza is topped with tomato sauce and mozzarella cheese, with a thin layer of crust.", "Pepperoni is a variety of Italian dry sausage made from cured pork and beef seasoned with paprika or other chili pepper.", "Pepperoni is a spicy Italian-American variety of salami (a dry sausage).", "Chicago-style pizza is pizza prepared according to several different styles developed in Chicago.", "Deep-dish pizza is a form of pizza made with a thick crust, especially in the Chicago style.", "Pepperoni, is an American variety of salami, made from cured pork and beef mixed together and seasoned with paprika or other chili pepper.", "Pepperoni is an American variety of salami, made from cured pork and beef mixed together and seasoned with paprika or other chili pepper.", "Pepperoni is an American variety of salami, made from a cured mixture of pork and beef seasoned with paprika or other chili pepper.", "Pepperoni is a variety of salami, made from cured pork and beef mixed together and seasoned with paprika or other chili pepper.", "Pepperoni is a type of salami, usually made from cured pork and beef.", "Deep-dish pizza is a style of pizza, originating from Chicago, Illinois.", "Deep-dish pizza is a style of pizza that originated in Chicago, Illinois, United States, in the 1940s.", "Pepperoni is a variety of salami, made from cured pork and beef mixed together."]