["the bench is made of cement.", "The bench is made of cement.", "The material used to make the bench is cement.", "The material used to make the bench is wood.", "The material used to make this sitting bench is cement.", "The bench is made of wood.", "The bench is made of concrete.", "This bench is made of concrete.", "The material used to make this sitting bench shown in this picture is cement.", "Cement is used to make the bench.", "The material used to make this bench is concrete.", "this is a cement bench.", "The material used to make benches is concrete.", "The bench is a long seat on which multiple people may sit at the same time. Benches are typically made of wood, but may also be made of metal, stone, or synthetic materials.", "A bench is a long seat on which multiple people may sit at the same time. Benches are typically made of wood, but may also be made of metal, stone, or synthetic materials.", "Benches are made of wood, metal, or concrete.", "Bench is a long seat on which several people may sit at the same time. Benches are typically made of wood, but may also be made of metal, stone, or synthetic materials. Many benches have arm and back rests; some have no back rest and can be sat on from either side.", "A bench is a long seat on which multiple people may sit at the same time. Benches are typically made of wood, but may also be made of metal, stone, or synthetic materials. Many benches have arm and back rests; some have no back rest and can be sat on from either side.", "A bench is a long seat on which multiple people may sit at the same time. Benches are typically made of wood, but may also be made of metal, stone, or synthetic materials. Many benches have arm and back rests; some have no back rest and can be sat on from either side. In American public areas, benches are often donated by persons or associations, which may then be indicated on it, e.g. by a small plaque.", "Garden benches can be made from a variety of materials, including wood, metal, and plastic.", "It is made of cement.", "A bench is a long seat on which multiple people may sit at the same time.", "Cement is a binder, a substance that sets and hardens independently, and can bind other materials together.", "Wood is a porous and fibrous structural tissue found in the stems and roots of trees and other woody plants."]