["An orange tree is a type of citrus tree.", "An orange tree is a tree that grows oranges.", "Orange trees are plants that bear oranges.", "Oranges grow from orange trees.", "Orange is a citrus fruit.", "Oranges are a type of citrus fruit.", "Orange trees are cultivated in warm climates worldwide, and the fruit is a major crop in many countries. This fruit is a citrus tree.", "Oranges grow from trees.", "An orange tree is a tree that produces oranges.", "Oranges grow on trees.", "Orange trees produce oranges.", "Orange trees are widely grown in tropical and subtropical climates for their sweet fruit.", "An orange tree is a tree that bears oranges.", "In botany, an orange is a type of citrus fruit which people eat.", "An orange is the fruit of the citrus species Citrus × sinensis in the family Rutaceae.", "Orange trees are widely cultivated in tropical and subtropical climates for their sweet fruit.", "The orange is a type of citrus fruit which people often eat.", "Orange trees are cultivated in warm climates worldwide, and the fruits of some species are important agricultural crops, including the sweet orange, which is the most commonly grown tree fruit in the world.", "An orange is a type of citrus fruit which people often eat.", "Orange trees are widely cultivated in subtropical and tropical climates for their sweet fruit. The fruit of the orange tree can be eaten fresh, or processed for its juice or fragrant peel.", "The orange is the fruit of various citrus species in the family Rutaceae (see list of plants known as orange); it primarily refers to Citrus × sinensis, which is also called sweet orange, to distinguish it from the related Citrus × aurantium, referred to as bitter orange.", "The orange is the fruit of the citrus species Citrus × sinensis in the family Rutaceae.", "The orange is a hybrid of ancient cultivated origin, possibly between pomelo (Citrus maxima) and tangerine (Citrus reticulata).", "Orange trees are evergreen flowering trees and shrubs.", "The orange is the fruit of the citrus species Citrus × sinensis in the family Rutaceae. It is also called sweet orange, to distinguish it from the related Citrus × aurantium, referred to as bitter orange.", "The orange is a hybrid, possibly between pomelo (Citrus maxima) and mandarin (Citrus reticulata), which has been cultivated since ancient times.", "Citrus trees", "The orange is a hybrid between pomelo (Citrus maxima) and mandarin (Citrus reticulata).", "Orange trees are evergreen, flowering plants, with an average height of 9 to 10 m (30 to 33 ft), although some very old specimens can reach 15 m (49 ft).", "The orange is a hybrid between pomelo and mandarin.", "The orange tree is an evergreen, flowering tree, with an average height of 9 to 10 m (30 to 33 ft), although some very old specimens can reach 15 m (49 ft).", "The plant is a tree."]