["A parasail is a parachute that is attached to a boat or a land vehicle.", "A parasail is a parachute that is attached to a boat.", "A parasail is a parachute that is attached to a boat. The parachute is used to lift the person up into the air.", "A parasail is a parachute that is towed behind a vehicle, usually a boat.", "A parasail is a parachute that can be towed behind a vehicle, usually a boat.", "A parasail is a parachute that is attached to a boat or a land vehicle and used for recreational purposes.", "A parasail is a parachute attached to a boat.", "A parasail is a parachute with a harness attached to a boat.", "A parasail is a parachute that you can use to fly.", "A parasail is a parachute that is towed behind a motorboat.", "A parasail is a parachute that is towed behind a vehicle, usually a boat. The person on the parasail is called a parasailor.", "A parasail is a parachute which is towed behind a vehicle.", "A parasail is a parachute that is towed behind a vehicle.", "A parasail is a parachute that is used to glide through the air.", "He is holding on a parasail.", "A parasail is a parachute.", "A parasail, parascender or kiteski is a sail, similar to a parachute, designed to be towed behind a vehicle.", "A parasail, parascending or parakiting is a recreational kiting activity where a person is towed behind a vehicle (usually a boat) while attached to a specially designed canopy wing that resembles a parachute, known as a parasail wing. The manned kite's moving anchor may be a car, truck, or boat. The harness attaches the pilot to the parasail, which is connected to the boat, or land vehicle, by the tow rope. The vehicle then drives off, carrying the parascender (or wing) and person into the air. If the boat is powerful enough, two or three people can paras", "parasailing is a recreational kiting activity where a person is towed behind a vehicle (usually a boat) while attached to a specially designed canopy wing that resembles a parachute, known as a parasail wing.", "A parasail, parascender, or parakite is a canopy wing that is towed behind a vehicle, usually a car or boat. It is also used for parasailing, a recreational activity where a person is towed behind a vehicle while attached to a specially designed canopy wing that resembles a parachute.", "A parascender or parasail is a parachute-like device that is towed behind a vehicle, usually a boat, a four-wheel drive, or a snowmobile.", "A parasailor is a person who is towed behind a motorboat while attached to a specially designed canopy wing that reminds one of a parachute, known as a parasail.", "A parasail is an inflatable wing that is towed behind a boat.", "Parasailing, also known as parascending or parakiting, is a recreational kiting activity where a person is towed behind a vehicle (usually a boat) while attached to a specially designed canopy wing that reminds one of a parachute, known as a parasail wing.", "The person is holding a parasail.", "He is holding on to a parasail.", "A parasailor is a person who is parasailing.", "The person is holding on to a parasail.", "The man is holding a parasail.", "The parasail is held by a harness.", "The man is holding on to a parasail.", "A parascender, powered parachute, or para-commander is a parachute with motor and wheels.", "The man is holding on to a para sail.", "A parascender is a single-person kiting device that uses a parachute to provide lift.", "He is holding on to a parachute."]