["The language is English.", "The language of the advertisement is English.", "The advertisement is in English.", "The advertisement is being shown in English.", "The advertisement is written in English.", "The language in the background advertisement is English.", "The language of the background advertisement is English.", "The background advertisement is being shown in English.", "The advertisement is in the English language.", "The French Open is a major tennis tournament held over two weeks between late May and early June at the Stade Roland Garros in Paris, France.", "The French Open is a major tennis tournament held over two weeks between late May and early June in Paris, France.", "The background advertisement is being shown in German.", "The ad is in English.", "The background advertisement is in Spanish.", "The advertisement is in French.", "The advertisement is in Japanese.", "The advertisement is written in Japanese.", "The advertisement is in Chinese.", "The French language is a Romance language of the Indo-European family. It descended from the Vulgar Latin of the Roman Empire, as did all Romance languages.", "The official language of the United States is English.", "The English language is a West Germanic language that was first spoken in early medieval England and is now a global lingua franca. It is named after the Angles, one of the Germanic tribes that migrated to the area of Great Britain that later took their name, as England. Both names derive from Anglia, a peninsula in the Baltic Sea.", "The language is German.", "Tennis is a racket sport that can be played individually against a single opponent (singles) or between two teams of two players each (doubles).", "French is a Romance language of the Indo-European family. It descended from the Vulgar Latin of the Roman Empire, as did all Romance languages. French has evolved from Gallo-Romance, the spoken Latin in Gaul, and more specifically in Northern Gaul.", "Tennis is a racket sport that can be played individually against a single opponent or between two teams of two players each.", "English is a West Germanic language that was first spoken in early medieval England and is now a global lingua franca.", "French is a Romance language of the Indo-European family. It descended from the Vulgar Latin of the Roman Empire, as did all Romance languages.", "French is a Romance language of the Indo-European family.", "The French Open, officially the Tournoi de Roland-Garros (French: [tuʁnwa də ʁɔlɑ̃ ɡaʁɔs]), is a major tennis tournament held over two weeks at the Stade Roland-Garros in Paris, France, beginning in late May.", "The German language is a West Germanic language and one of the world's major languages. It is the most widely spoken and official or co-official language in Germany, Austria, Switzerland, South Tyrol (Italy), the German-speaking Community of Belgium, and Liechtenstein.", "The sign is written in English.", "The United States is a country where most people speak English.", "Advertising is a marketing communication that employs an openly sponsored, non-personal message to promote or sell a product, service or idea.", "The official language of the United States is English, but it is not the official language of every state.", "A sign language (also signed language or simply signing) is a language which chiefly uses manual communication to convey meaning, as opposed to acoustically conveyed sound patterns. This can involve simultaneously combining hand shapes, orientation and movement of the hands, arms or body, and facial expressions to fluidly express a speaker's thoughts.", "The language is Spanish.", "A language is a structured system of communication.", "Signs are objects, typically flat or shaped boards, which display information to be easily read from a distance."]