["An elephant is a large mammal.", "The elephant is a large mammal.", "The elephant is a large animal.", "The elephant is a very large mammal.", "The elephant is a mammal.", "Elephant is a mammal.", "The elephant is an animal.", "The animal is an elephant.", "The elephant is a large animal with a trunk.", "An elephant is a large mammal that is found in Africa and Asia.", "The animal is modeled on an elephant.", "The elephant is a large mammal with a trunk and tusks.", "The elephant is a large land mammal that has a long trunk.", "An elephant is a large animal. They have trunks and tusks.", "It is an elephant.", "The elephant is a large mammal which is found in parts of Africa and Asia.", "An elephant is a large mammal of the family Elephantidae.", "The elephant is a very large mammal. It is grey in color and has a long trunk.", "An elephant is a large mammal of the order Proboscidea.", "It is modeled on an elephant.", "The elephant is a herbivorous mammal that lives in Asia and Africa.", "A teapot is a vessel used for steeping tea leaves or an herbal mix in boiling or near-boiling water, and for serving the resulting infusion which is called tea.", "a black elephant-shaped teapot is on a light stand.", "A statue is a sculpture, representing one or more people or animals (including abstract concepts allegorically represented as people or animals), free-standing (as opposed to a relief) and normally full-length (as opposed to a bust) and at least close to life-size, or larger.", "A statue is a sculpture representing one or more people or animals.", "The elephant is the largest land animal on earth.", "The elephant is the largest land animal on Earth.", "The artifact is modeled on an elephant.", "Elephants are mammals of the family Elephantidae and the largest existing land animals.", "Elephant is the largest living land animals.", "This artifact is modeled on an elephant.", "Elephants are large mammals of the family Elephantidae and the order Proboscidea. Three species are currently recognised: the African bush elephant, the African forest elephant, and the Asian elephant.", "This artifact is modeled on the elephant.", "The elephant is a large mammal of the family Elephantidae and the order Proboscidea.", "Elephants are mammals of the family Elephantidae and the largest existing land animals. Three species are currently recognised: the African bush elephant, the African forest elephant, and the Asian elephant.", "Elephants are large mammals of the family Elephantidae and the order Proboscidea. Traditionally, two species are recognised, the African elephant and the Asian elephant (Elephas maximus). Elephants are scattered throughout sub-Saharan Africa, South Asia, and Southeast Asia. Elephantidae is the only surviving family of the order Proboscidea; other, now extinct, members of the order include deinotheres, gomphotheres, mammoths and mastodons.", "Elephant is a 2014 Indian drama film written and directed by Aanand L. Rai and produced by Eros International.", "Artifacts are usually made to resemble a particular animal.", "An artifact is an object made by a human being."]