["Potatoes are used to make french fries.", "Potatoes can be used to make french fries.", "A french fries is made from potatoes.", "French fries are made from potatoes.", "The french fries are made from potatoes.", "French fries are a type of potato dish.", "French fries are a type of fried potatoes.", "French fries are a common fast food dish made from potatoes.", "Potato chips, mashed potatoes, French fries.", "French fries are a piece of potato that has been cut into a thin strip and then fried.", "A french fries is a thin cut of potato that is fried and usually salted.", "French fries are a popular fast food made from potatoes.", "The French fry is a common fast food dish made from potatoes.", "French fries are slices of potato fried in oil.", "French fries, or simply fries, chips, finger chips, or French-fried potatoes, are batonnet or allumette-cut deep-fried potatoes.", "French fries, or simply fries, chips, finger chips, or french-fried potatoes, are batonnet or allumette-cut deep-fried potatoes.", "Fries, chips, crisps or French fries (North American English) are strips of potato that have been deep fried.", "French fries are a common fast food dish.", "Fried potatoes are the most common form of potatoes in many parts of the world, especially in Western countries.", "A french fries is a thin, long piece of potato that is deep fried and eaten hot, usually with a side of ketchup.", "Potato chips are thin slices of potato, fried quickly in oil and then salted.", "french fries", "French fries are served hot, either soft or crispy, and are generally eaten as part of lunch or dinner or by themselves as a snack, and they commonly appear on the menus of diners, fast food restaurants, pubs, and bars.", "French fries are prepared by first cutting the potato--peeled or unpeeled--into even strips, which are then wiped off or soaked in cold water to remove the surface starch, and thoroughly dried.", "Potatoes are a root vegetable. They are usually eaten as a side dish or in a main dish.", "Potatoes are grown in many countries.", "Potato chips.", "Chips is a term for a thin slice of potato that has been deep fried or baked until crunchy.", "Potatoes are a starchy, tuberous crop from the perennial nightshade Solanum tuberosum.", "Potatoes are a starchy, tuberous crop from the perennial nightshade Solanum tuberosum. In many contexts, potato refers to the edible tuber, but it can also refer to the plant itself.", "Potatoes are a good source of carbohydrates.", "The potato is a starchy, tuberous crop from the perennial nightshade Solanum tuberosum."]