["A motorcycle is a two-wheeled motor vehicle.", "Motorcycle is a two-wheeled vehicle.", "The motorcycle is a two-wheeled vehicle.", "A motorcycle is a two-wheeled motor vehicle with a strong frame, usually two wheels at the front and one at the back.", "Motorcycles are designed to be ridden.", "The motorcycle has a kickstand to prevent it from falling.", "Motorcycles are motor vehicles.", "The motorcycle is parked, so it cannot fall.", "A motorcycle can not fall because it is parked.", "A motorcycle is a vehicle that has two wheels and a motor. It is usually ridden by a single person.", "Motorcycle is a two-wheeled motor vehicle, and it has a two-wheel drive.", "The motorcycle has three wheels.", "The motorcycle can not fall because it is parked.", "The motorcycle can not fall because it has two wheels.", "Because the motorcycle has a stand.", "Motorcycles have two wheels.", "The main reason for a motorcycle to fall is that the center of gravity is too high.", "The motorcycle has a kickstand.", "The motorcycle is parked.", "The motorcycle's wheels are designed to lean into a turn and prevent the motorcycle from falling over.", "Motorcycles can not fall because they have two wheels.", "A motorcycle, often called a motorbike, bike, or cycle, is a two- or three-wheeled motor vehicle.", "The motorcycle can no fall because the motorcycle has a kickstand.", "A motorcycle, often called a bike, motorbike, or cycle, is a two- or three-wheeled motor vehicle.", "The motorcycle has a low center of gravity, which makes it easier to balance.", "The motorcycle can no fall because the motorcycle has a flat surface.", "Motorcycle stands are used to support the motorcycle when it is not being ridden.", "Motorcycle can not fall.", "The motorcycle is parked on a flat surface.", "The center of gravity of a motorcycle is a bit higher than that of a car.", "In the event of a fall, the side stand of the motorcycle should be deployed.", "Motorcycles can be dangerous. Motorcycles are more likely to be involved in a crash than a car.", "Motorcycle’s wheels have a large diameter, which means that they have a large moment of inertia.", "The motorcycle is parked on a road.", "The motorcycle is parked on the road.", "The motorcycle's center of gravity is too high for the two-wheeled design to support it upright without active rider input.", "Motorcycles are not self-balancing.", "The motorcycle is parked on a road with a curb.", "The motorcycle is parked next to a wall.", "Motorcycles are designed to be stable at speed, and the gyroscopic effect of the spinning front wheel helps counter steer through the handlebars.", "The motorcycle is parked in the parking lot.", "A motorcycle sidecar is a comfortable, convenient recreational sidecar designed to carry a passenger and luggage on the road with you.", "Motorcycle safety concerns many aspects of vehicle and equipment design as well as operator skill and training that are unique to motorcycle riding.", "A kickstand is a device on a bicycle or motorcycle that allows the bike to be kept upright without leaning against another object or the aid of a person.", "Because it has a kickstand."]