["A urinal is a sanitary plumbing fixture for urination only, predominantly used by men and boys.", "A urinal is a sanitary plumbing fixture for urination only, primarily used by males.", "A urinal is a sanitary plumbing fixture for urination only, predominantly used by males.", "A urinal is a sanitary plumbing fixture for urination only, predominantly used by and designed for males.", "Urinals are typically used in a men's bathroom.", "A urinal is a sanitary plumbing fixture for urination only, predominantly used by males. It can take the form of a container or simply a wall, with drainage and automatic or manual flushing, the flushing can be activated by the user, or by a sensor.", "Urinals are commonly found in a bathroom.", "A urinal is a sanitary fixture used primarily for urination.", "A urinal is a sanitary plumbing fixture for urination only, predominantly used by males. It can take the form of a container or simply a wall, with drainage and automatic or manual flushing, or without flush water as is the case for waterless urinals.", "A urinal is a sanitary fixture used by urinating.", "Urinals are commonly found in a men's bathroom.", "A urinal is a sanitary plumbing fixture for urination only.", "A urinal is a bowl or trough for men to urinate into.", "A urinal is a sanitary plumbing fixture for urination only, generally with a direct connection for drainage and a water supply within or near the toilet that keeps the bowl full for flushing.", "Urinals are found in a men's bathroom.", "A urinal is a sanitary plumbing fixture for urination only, generally with one or more drainage holes or slots, which allow urine to drain into the bowl and then into the sewer.", "Urinals are a sanitary plumbing fixture for urination only.", "A urinal is a sanitary plumbing fixture for urination only, generally by a standing person.", "Urinals are often provided in public toilets for male users in Western countries.", "Urinals are installed in public toilets for men.", "Urinals are primarily found in public toilets, but may also be installed in the bathrooms of private homes.", "You might find urinals in the bathroom of a home, a restaurant or a public building.", "a toilet is a piece of sanitary hardware used for the collection or disposal of human urine and feces.", "A toilet is a piece of hardware used for the collecting or disposal of human urine and feces. In other words: \"Toilets are sanitation facilities at the user interface that allow the safe and convenient urination and defecation\".", "A bathroom is a room in the home for personal hygiene activities, generally containing a toilet, a sink (basin) and either a bathtub, a shower, or both.", "a bathroom.", "You would find this in a men's bathroom."]