["A dump truck is used for transporting loose material such as sand, gravel, or dirt, for construction.", "A dump truck is usually used to carry sand, dirt, or gravel for construction.", "A dump truck is a truck used for transporting loose material for construction.", "The dump truck is used to carry and dump loose material, such as dirt, sand, or gravel.", "A dump truck is a truck used for transporting loose material (such as sand, gravel, or demolition waste) for construction.", "Dump trucks are used to transport loose material such as sand, gravel, or dirt for construction.", "Dump trucks are used to haul dirt, sand, gravel, and other materials.", "The dump truck is hauling dirt.", "Dump trucks are used for transporting loose material such as sand, gravel, or dirt for construction.", "Dump trucks are large, heavy vehicles that are used to haul large loads of dirt, sand, gravel, or other materials.", "Dump trucks are used to transport large quantities of loose material such as sand, gravel, or dirt for construction.", "A dump truck (or, UK, dumper truck) is a truck used for transporting loose material (such as sand, gravel, or dirt) for construction.", "Dump trucks are used to haul materials such as dirt, gravel, and sand.", "Dump trucks are used for hauling materials.", "The dump truck is dumping its load of dirt.", "Dump trucks are used for hauling loose material such as sand, gravel, or dirt for construction.", "Dump trucks are large trucks that transport loose materials for construction.", "Dump trucks are used for transporting loose material.", "The dump truck is dumping the dirt.", "A dump truck (known in the UK as a dumper/tipper truck) is a truck used for transporting loose material (such as sand, gravel, or demolition waste) for construction.", "A dump truck, also known as a dumper truck or tipper truck, is used for transporting loose material such as sand, gravel, or dirt for construction.", "This truck is dumping a load of dirt.", "The truck appears to be dumping dirt.", "A dump truck, known also as a dumper truck or tipper truck, is used for transporting loose material (such as sand, gravel, or demolition waste) for construction.", "The truck appears to be dumping the dirt.", "The dump truck is dumping.", "A dump truck, known also as a dumper truck or tipper truck, is used for taking dumps for construction as well as coal.", "Dump trucks transport loose material such as sand, gravel, or demolition waste for construction.", "A dump truck, known also as a dumper truck or tipper truck, is used for taking dumps.", "The truck is dumping dirt.", "A dump truck is a truck whose bed can be raised at the front end to allow its contents to be dumped out the back.", "Dump trucks carry large loads.", "A dump truck is a truck whose bed can be elevated at the front end to allow its contents to be dumped out the back.", "The truck appears to be hauling dirt.", "The truck appears to be dumping dirt in the field.", "The truck appears to be dumping dirt in the open field.", "The truck is hauling dirt.", "The truck is dumping the gravel.", "The truck is carrying soil.", "The truck appears to be dumping its load.", "dump truck with its dumpper down on an area that has dirt on the ground. hauling dump driving on dump dump dump dump dump dump dump being tipping trucks dump dump."]