["The elephant is found in India and Southeast Asia.", "Elephant is found in India.", "Elephants are found in Africa, India and Southeast Asia.", "Elephants are found in Africa and Asia.", "Elephants are found in Asia and Africa.", "The elephant is native to parts of Asia, Africa, and Europe.", "Asian elephant is a species of elephant that lives in Asia.", "Elephants are native to Africa and Asia.", "Elephants are found in India, Sri Lanka, Sumatra, and Borneo.", "Elephants are indigenous to Asia and Africa.", "Elephants are found in many parts of the world, including Asia and Africa.", "Elephants are found in India.", "The elephant is native to Southeast Asia.", "The elephant is found in Africa.", "The elephant is found in India.", "Elephants are found in Thailand.", "Elephants are large mammals of the family Elephantidae and the order Proboscidea. Two species are traditionally recognised, the African elephant and the Asian elephant. Elephants are scattered throughout sub-Saharan Africa, South Asia, and Southeast Asia. Elephantidae is the only surviving family of the order Proboscidea; other, now extinct, members of the order include deinotheres, gomphotheres, mammoths, and mastodons.", "The Asian elephant (Elephas maximus), also called Asiatic elephant, is the only living species of the genus Elephas and is distributed in Southeast Asia from India in the west to Borneo in the east.", "Elephants are large mammals of the family Elephantidae and the order Proboscidea. Three species are currently recognised: the African bush elephant (Loxodonta africana), the African forest elephant (L. cyclotis), and the Asian elephant (Elephas maximus).", "The Indian elephant is one of three recognized subspecies of the Asian elephant and native to mainland Asia.", "An elephant is a mammal of the family Elephantidae and the largest existing land animal.", "Elephants are large mammals of the family Elephantidae and the order Proboscidea.", "Elephants are mammals of the family Elephantidae and the largest existing land animals.", "The elephant is a large mammal of the family Elephantidae and the order Proboscidea.", "The Asian elephant is an endangered species which once ranged throughout Asia, from the Middle East in the west to the eastern coasts of Russia in the east.", "India is a country in Asia.", "India"]