["The socks are blue, so the complementary color is orange.", "The complementary color to red is green.", "The complementary color of red is green.", "The complementary color of green is red.", "The complementary color of blue is orange.", "Red and green are complementary colors.", "The complementary color of green is magenta; that is, a color corresponding to an equal mixture of red and blue light.", "The complementary color of a color is the color that is halfway between it and the next color on the color wheel.", "Green is the complementary color of red.", "The color orange is a complementary color to blue.", "The complimentary color to red is green.", "Complimentary colors are colors that are opposite each other on the color wheel.", "The complementary color of green is magenta.", "Blue is the complimentary color to orange.", "The complementary color of yellow is purple.", "The complimentary color of blue is orange.", "The complementary color of a color is the color that makes it neutral.", "Color complements are colors that are on opposite sides of the color wheel.", "Soccer, also known as football, is a sport played between two teams of eleven players with a spherical ball.", "A soccer ball is an inflated ball used to play soccer.", "The complimentary color of blue is yellow.", "The complimentary color to the their socks is green.", "Complementary colors are pairs of colors which, when combined, cancel each other out.", "The color of the socks is green.", "Complementary colors are pairs of colors which, when combined or mixed, cancel each other out (lose hue) by producing a grayscale color like white or black.", "The color yellow is a primary color that is used to create green and orange.", "Red, green, and blue are the primary colors of light.", "The complimentary color to the their socks is blue.", "A complementary color, when placed next to another color, creates the best contrast. This is because complementary colors are picked from the other side of the color wheel.", "The color of the socks is blue.", "The complementary color of red is cyan.", "The complimentary color to their socks is the orange of their shorts.", "The socks are blue.", "The primary colors in the RGB color wheel are the colors that, added together, create pure white light.", "The color of the socks is white.", "the complimentary color to their socks is black.", "The color wheel is a visual representation of colors arranged according to their chromatic relationship.", "The primary colors in the traditional RYB color model are red, yellow and blue.", "The color wheel is a chart representing the relationships between colors.", "The color wheel is a chart representing the relationships between colors. Based on a circle showing the colors of the spectrum originally fashioned by Sir Isaac Newton in 1666, the colour wheel he created serves many purposes today."]