["Tomato sauce is a sauce made from tomatoes.", "A tomato sauce is a sauce made from tomatoes.", "Tomato sauce is a sauce made from tomatoes, usually to be served as part of a dish (rather than as a condiment).", "The tomato sauce is a sauce made from tomatoes.", "A tomato sauce is a sauce made with tomatoes as the main ingredient.", "Tomato sauce is a sauce made from tomatoes, usually to be served as part of a dish.", "A tomato sauce is a sauce made from tomatoes, usually to be served as part of a dish.", "Tomato sauce is a sauce made with tomatoes as a primary ingredient.", "Tomato sauce is a sauce made from tomatoes, best known as a pasta sauce.", "Tomato sauce is a sauce made from tomatoes. It is used as a base for many dishes, such as pasta and pizza.", "The tomato sauce is a hot sauce made from tomatoes, chili peppers, and other ingredients.", "Tomato sauce, refers to any of a very large number of sauces made primarily from tomatoes, usually to be served as part of a dish.", "A tomato sauce is a sauce made from tomatoes, usually to be served as part of a dish (rather than as a condiment). Tomato sauces are common for meat and vegetables, but they are perhaps best known as sauces for pasta dishes.", "There are many varieties of tomato sauce.", "There are many types of tomato sauce.", "The sauce is made of tomatoes, garlic, and onion.", "There is a tomato sauce that is made from tomatoes, onions, garlic and basil.", "The tomato sauce is a classic tomato sauce.", "The tomato sauce is a dipping sauce.", "Marinara sauce is a tomato-based sauce.", "The type of tomato sauce is a simple tomato sauce.", "Sauce is a liquid or semi-solid food, served on or used in preparing other foods.", "Tomato sauce (also known as Neapolitan sauce, salsa roja in Spanish, or salsa di pomodoro in Italian) can refer to many different sauces made primarily from tomatoes, usually to be served as part of a dish, rather than as a condiment.", "Sauce is a liquid or semi-solid food, typically served on food or used to cook other foods.", "Soy sauce is a sauce made from soybeans.", "There are many varieties of tomato sauce, often specific to the cuisine of the geographical region.", "The best tomato sauces are made with fresh tomatoes.", "There is a tomato sauce in the bowl.", "There are several types of tomato sauce: marinara sauce, arrabbiata sauce, puttanesca sauce, amatriciana sauce and many more.", "Soy sauce, hot sauce, miso, tomato sauce", "The sauce is marinara.", "There is no tomato sauce.", "There is a dipping sauce, a hot sauce and a soy sauce.", "There is chili sauce.", "The tomato is the edible, often red, berry of the plant Solanum lycopersicum, commonly known as a tomato plant.", "A tomato is a fruit, botanically a berry, of the plant Solanum lycopersicum.", "Soy sauce (also called soya sauce in British English) is a liquid condiment of Chinese origin, made from a fermented paste of soybeans, roasted grain, brine, and Aspergillus oryzae or Aspergillus sojae molds.", "Soy sauce is a liquid condiment of Chinese origin, made from a fermented paste of soybeans, roasted grain, brine, and Aspergillus oryzae or Aspergillus sojae molds.", "Soy sauce is a condiment made from a fermented paste of soybeans, roasted grain, brine, and Aspergillus oryzae or Aspergillus sojae molds.", "Ketchup is a sauce used as a condiment."]