["A collection of baked goods is called a baker's dozen.", "A group of baked goods is called a batch.", "A batch is a group of baked goods.", "A batch of baked goods is called a batch.", "A batch of baked goods is a collective term for the quantity of baked goods that are cooked together in one batch in an oven.", "A batch of baked goods is a group of baked goods made at one time.", "A collective word representing the quantity of baked goods shown is a dozen.", "A batch of baked goods is a collection of baked goods produced from a single or mixed batch of dough.", "A batch is a collective term for a collection of baked goods.", "A batch of baked goods.", "a batch of baked goods", "A batch of baked goods", "Batch is a collective word representing the quantity of baked goods shown.", "A batch is a group of loaves of bread, cakes, cookies, muffins, or other baked goods made using the same batter or dough.", "A batch of muffins is a group of muffins made at the same time.", "A collective noun is a word used to describe a group of people or things.", "A baker is someone who bakes and sells bread.", "A collective noun is a noun that refers to a group of people or things, such as the word \"team\" or \"family.\"", "A batch of muffins", "a batch of muffins", "A collective word is a word that represents a group of people, animals, or things.", "Baked goods are foods made from dough or batter and cooked by baking, a method of cooking food that uses prolonged dry heat.", "A baker is a person who bakes and sometimes sells breads and other products made using an oven or other concentrated heat source.", "A baker's dozen is a baker's dozen.", "A baker's dozen is a grouping of thirteen.", "A baker's dozen is a term used to designate a group of thirteen.", "A baker's dozen is 13.", "A baker's dozen is a term used in English-speaking countries for a group of thirteen.", "A dozen is a grouping of twelve.", "A dozen is a group of twelve.", "A batch of goods is a quantity of goods produced in one series of operations in a process, or produced during a particular period of time.", "A dozen is a grouping of twelve items.", "a baked good is a food that is cooked by baking.", "A dozen is a grouping of twelve. The dozen may be one of the earliest primitive groupings, perhaps because there are approximately a dozen cycles of the moon, or months, in a cycle of the sun, or year.", "A batch is a collection of things or persons to be handled together or at one time.", "A batch is a collection of things or persons to be handled together.", "a dozen", "The collective noun for muffins is a \"basket\".", "A muffin is an American name for a type of bread that is baked in small portions.", "A muffin is a small bread or cake that has been baked in a cup-shaped container.", "Muffin is a collective noun.", "Batch", "Bake is to cook (food) by dry heat without direct exposure to a flame, typically in an oven or on a hot surface."]