["Snowboarding is a recreational activity and Olympic and Paralympic sport that involves descending a snow-covered slope while standing on a snowboard attached to a rider's feet.", "snowboarding is a recreational activity and olympic and paralympic sport that involves descending a snow-covered slope while standing on a snowboard attached to a rider's feet.", "Snowboarding is a recreational activity and Winter Olympic and Paralympic sport that involves descending a slope that is covered with snow while standing on a snowboard attached to a rider's feet.", "Snowboarding is a winter sport that involves descending a slope that is covered with snow while standing on a snowboard attached to a rider's feet.", "Snowboarding is a recreational activity and Winter Olympic and Paralympic sport that involves descending a snow-covered slope while standing on a snowboard attached to a rider's feet.", "The snowboarding is a winter sport that involves descending a slope that is covered with snow while standing on a board attached to a rider's feet, using a special boot set onto a mounted binding.", "The event is called snowboarding.", "The event is called Snowboarding.", "The event is called 'snowboarding'.", "The event is called a snowboarding event.", "It is called snowboarding.", "Snowboarding is a recreational activity and Olympic and Paralympic sport that involves descending a snow-covered slope while standing on a snowboard attached to a rider's feet. The development of snowboarding was inspired by skateboarding, sledding, surfing and skiing.", "snowboarding is a winter sport that involves descending a slope that is covered with snow while standing on a board attached to a rider's feet, using a special boot set onto mounted binding.", "A snowboard is a winter sport that involves descending a slope that is covered with snow while standing on a snowboard attached to a rider's feet.", "This is snowboarding.", "This is called \"freestyle snowboarding\".", "This is called a snowboard.", "Skiing is a sport where people slide down a snowy slope on long skis.", "A snowboarder is a person who rides a snowboard. Snowboarding is a recreational activity and olympic and paralympic sport that involves descending a snow-covered slope while standing on a snowboard attached to a rider's feet.", "Skiing can be a means of transport, a recreational activity or a competitive winter sport in which the participant uses skis to glide on snow.", "A snowboard is a thin board that is used to slide down a snow-covered slope.", "A snowboarder is a person who engages in the sport of snowboarding.", "A snowboarder is a person who practices the sport of snowboarding.", "The snowboard is a board that is usually the width of one's foot longways, with the ability to glide on snow.", "The snowboard is a board that usually has the feet attached to it.", "Skiing is a means of transport using skis to glide on snow. Variations of purpose include basic transport, a recreational activity, or a competitive winter sport.", "The snowboarding competition consists of slopestyle and halfpipe.", "Ski jumping is a winter sport in which a person jumps on skis from a specially designed ramp and tries to go as far as possible.", "This event is called the Winter Olympics.", "The event is called the Winter Olympics.", "A slalom is an alpine skiing and alpine snowboarding discipline, involving skiing between poles or gates. These are spaced more closely than those in giant slalom, super giant slalom and downhill, necessitating quicker and shorter turns.", "A slalom is an event in alpine skiing, which involves skiing between poles or gates. These are spaced more closely than those in giant slalom, super giant slalom and downhill, necessitating quicker and shorter turns.", "Ski jumping is a winter sport in which competitors aim to achieve the longest jump after descending from a specially designed ramp on their skis.", "The Winter Olympics is a major international multi-sport event held once every four years for sports practiced on snow and ice.", "A ski jump is an event in which skiers go down a take-off ramp, jump and attempt to land as far as possible down the hill below.", "Ski jumping is a sport in which skiers go down a take-off ramp, jump and attempt to land as far as possible down the hill below. The skis used for ski jumping are wide and long, to allow the skier to glide through the air.", "The Winter Olympic Games is a major international sporting event held once every four years for sports practiced on snow and ice.", "A slalom is an event in skiing in which the skier must pass between poles or gates spaced more closely than in giant slalom, super giant slalom and downhill, necessitating quicker and shorter turns.", "Ski jumping is an Olympic winter sport which was firstly contested in Norway in the late 19th century, and later spread through Europe and North America in the early 20th century.", "Freestyle skiing is a skiing discipline comprising aerials, moguls, cross, half-pipe and slopestyle as part of the Winter Olympics.", "The Olympics is a major international multi-sport event."]