["A squeegee is used to clean the glass of this vehicle.", "A squeegee is used to clean the glass of a car.", "Windshield wipers are used to clean the glass of a vehicle.", "The windshield wiper is a device used to clean the windshield of a vehicle.", "The windshield wipers are used to clean the glass of a vehicle.", "The windshield wiper is used to clean the glass of this vehicle.", "Wipers are used to clean the windshield glass.", "A windshield wiper is a device used to remove rain, snow, ice and debris from a windshield.", "Windshield wipers are used to remove rain, snow, ice and debris from a vehicle's front window.", "The windshield wiper or windscreen wiper (British English) is a device used to remove rain, snow, ice and debris from a windscreen or windshield.", "A windshield wiper or windscreen wiper (British English) is a device used to remove rain, snow, ice and debris from a windscreen or windshield.", "Windshield wipers are used to remove snow, ice, rain, and debris from a windscreen.", "A windshield wiper or windscreen wiper is a device used to remove rain, snow, ice and debris from a windscreen or windshield. Almost all motor vehicles, including cars, trucks, buses, train locomotives, and watercraft with a cabin—and some aircraft—are equipped with one or more such wipers, which are usually a legal requirement. A wiper generally consists of a metal arm, pivoting at one end and with a long rubber blade attached to the other. The arm is powered by a motor, often an electric motor, although pneumatic power is also used in some vehicles. The blade", "Windshield wipers are devices used to remove rain, snow, ice and debris from a windscreen or windshield.", "A squeegee is a tool with a rubber blade and handle used to clean windows.", "A squeegee is a tool used to clean glass and other flat surfaces.", "Windshield wipers are used to remove rain, snow, ice and debris from a vehicle's front window. Almost all motor vehicles, including cars, trucks, buses, train locomotives, and watercraft with a cabin—and some aircraft—are equipped with such wipers, which are usually a legal requirement.", "A squeegee is a tool used for cleaning windows.", "The device is a squeegee.", "A squeegee or window squeegee is a tool consisting of a rubber blade or fabric pad, used to remove water from glass after cleaning.", "A squeegee is a tool with a flat, smooth rubber blade, used to remove excess water from windows after cleaning.", "A squeegee is a tool with a flat, smooth rubber blade, used to remove excess water from glass after cleaning.", "The wiper blade is a device used to clean the windshield of a vehicle.", "Wiper blades are used to clean the glass of this vehicle.", "A squeegee is a tool with a flat, smooth rubber blade, used to remove excess water from a window after washing.", "Windshield wipers or windscreen wipers are devices used to remove rain, snow, ice and debris from a windscreen or windshield.", "A squeegee is a tool with a flat, smooth rubber blade, used to remove excess water from windows after washing.", "A squeegee is a tool with a rubber blade and handle used to remove liquid from a surface.", "A squeegee is a tool with a rubber blade for removing liquid from a surface.", "A squeegee or squilgee is a tool with a flat, smooth rubber blade, used to remove excess water from glass after cleaning.", "A wiper is a device used to remove rain, snow, ice and debris from a windscreen or a windshield.", "A window cleaning tool is a device used to clean the outside of windows.", "The moving device is called a squeegee.", "The moving device is a squeegee.", "The device is a rag."]