["Bottles are meant to be recycled.", "A bottle should be recycled after use.", "After a bottle is done being used, it should be recycled.", "After a bottle is used, it should be recycled.", "The bottle should be put in a recycling bin.", "After the bottle is done being used, it should be recycled.", "The bottle should be recycled.", "Bottles should be recycled after they are used.", "The bottle should be recycled after it is done being used.", "After your bottle is empty, it should be recycled.", "After the bottle is done being used it should be put in a recycling bin.", "Glass bottles should be recycled.", "an empty bottle should be thrown away.", "You should recycle the bottle.", "Bottles are recyclable.", "Empty bottles should be recycled.", "Glass bottles are 100% recyclable, can be recycled endlessly, and are a key component of the closed loop, zero waste system.", "After the bottle is done being used it should be thrown away.", "Bottle is a container made of an impermeable material.", "Bottles are generally made of glass, clay, plastic, aluminum or other impervious materials, and typically used to store liquids.", "After using a bottle, it should be thrown away.", "Bottles are containers with a neck that is narrower than the body and a \"mouth\".", "A bottle is a container that is used to hold liquids including water and milk. A bottle can be made of plastic, glass or metal.", "The bottle is a container, often made of glass or plastic that is used to store and transport liquids (water, milk, beer, wine, ink, cooking oil, medicine, soft drinks, shampoo, and chemicals, etc.).", "The bottle is a container for liquids.", "The bottle is a container with a narrow neck that is used to store and transport liquids.", "A bottle is a rigid container with a neck that is narrower than the body and a \"mouth\".", "When you are done with your drink, the bottle should be returned to the bar.", "Bottles are for single use only.", "A bottle is a rigid container with a neck that is narrower than the body, and a \"mouth\". By contrast, a jar has a relatively large mouth or opening which may be as wide as the overall container.", "You should recycle it.", "Recycling is the process of converting waste materials into new materials and objects. It is an alternative to \"conventional\" waste disposal that can save material and help lower greenhouse gas emissions.", "Recycling is the process of converting waste materials into new materials and objects. It is an alternative to \"conventional\" waste disposal that can save material and help lower greenhouse gas emissions. Recycling can prevent the waste of potentially useful materials and reduce the consumption of fresh raw materials, thereby reducing: energy usage, air pollution (from incineration), and water pollution (from landfilling).", "Recycling is the process of converting waste materials into new materials and objects.", "The table is made from recycled plastic bottles, and the chairs are made from recycled plastic bags."]