["The bench is made of concrete, which was invented by Joseph Aspdin in 1824.", "Concrete was invented by the ancient Romans.", "Concrete was invented in Ancient Rome by the Romans.", "The material that this bench is made from is concrete.", "Concrete was invented by the Romans.", "The material of the bench is made from concrete.", "The bench is made of concrete.", "The Romans were the first to use concrete as a building material.", "The inventor of concrete was Joseph Aspdin, an English bricklayer.", "Concrete is a composite material composed of fine and coarse aggregate bonded together with a fluid cement that hardens over time. Most concretes used are lime-based concretes such as Portland cement concrete or concretes made with other hydraulic cements, such as calcium aluminate cements.", "Concrete is a composite material composed of fine and coarse aggregate bonded together with a fluid cement that hardens over time. Most concretes used are lime-based concretes such as Portland cement concrete or concretes made with other hydraulic cements, such as ciment fondu.", "The modern concrete bench was invented by the Romans.", "Concrete is a composite material composed of coarse aggregate bonded together with a fluid cement that hardens over time.", "Concrete is a composite material composed of fine and coarse aggregate bonded together with a fluid cement that hardens over time.", "Concrete is a composite material composed of fine and coarse aggregate bonded together with a fluid cement (cement paste) that hardens over time.", "Concrete is a composite material composed of coarse aggregate bonded together with a fluid cement that hardens over time. Most concretes used are lime-based concretes such as Portland cement concrete or concretes made with other hydraulic cements, such as calcium aluminate cements. However, asphalt concrete, which is frequently used for road surfaces, is also a type of concrete, where the cement material is bitumen, and polymer concretes are sometimes used where the cementing material is a polymer.", "The first concrete was produced by the Romans.", "The first concrete bench was invented by Thomas Jefferson in 1809.", "The material is concrete.", "Concrete is a composite material composed of fine and coarse aggregate bonded together with a fluid cement (cement paste) that hardens over time—most frequently a lime-based cement binder, such as Portland cement, but sometimes with other hydraulic cements, such as a calcium aluminate cement.", "Roman engineers were the first and until the industrial revolution the only civilization known to have invented concrete and then used it on a large scale.", "The Romans invented concrete.", "Joseph Aspdin was an English cement manufacturer who obtained the patent for Portland cement on 21 October 1824.", "Joseph Aspdin was a British cement manufacturer who obtained the patent for Portland cement on 21 October 1824.", "Joseph Aspdin (1778–1855) was an English cement manufacturer who obtained the patent for Portland cement on 21 October 1824.", "Joseph Aspdin, an English cement manufacturer, obtained a patent on the production of portland cement in 1824.", "Joseph Aspdin, a bricklayer from Leeds, Yorkshire, England, was the first person to patent Portland cement in 1824.", "The inventor of the material that this bench is made from is unknown.", "A bench is a long seat on which multiple people may sit at the same time. Benches are typically made of wood, but may also be made of metal, stone, or synthetic materials.", "A bench is a long seat on which multiple people may sit at the same time.", "The first concrete was made by the Nabatean traders or Bedouins who occupied and controlled a large part of the area around the Jordan river."]