["The red suitcase is made of plastic.", "The suitcase is made of leather.", "Suitcases are usually made of plastic or leather.", "Suitcases are usually made of leather.", "The most common material for luggage is leather.", "The red article may be made of leather.", "The red article is made of leather.", "The luggage is made of plastic.", "Suitcases are usually made of plastic, wood, or metal.", "Luggage is typically made of leather, plastic, fabric, or metal.", "The red article is a suitcase.", "Suitcases are primarily made of cloth, leather, plastic, or aluminum.", "Most suitcases are made of polycarbonate or polypropylene.", "The luggage is made of a hard material, such as fiberglass or plastic.", "The red article in the foreground is made of plastic.", "The luggage is made from a variety of materials, including wood, leather, and synthetic fabrics such as nylon.", "The material of the luggage is made of polycarbonate.", "The red article is made of plastic.", "The red article in the foreground is made of rubber.", "The red article might be made of plastic.", "The suitcase is made of hard plastic.", "The red article in the foreground might be made of plastic.", "The red article is made of polyester.", "The red article is made of a hard material.", "The red article is made of cloth.", "A suitcase is a general term for a distinguishable form of luggage. It is often a somewhat flat, rectangular-shaped bag with rounded square corners, either metal, hard plastic or made of cloth, vinyl or leather that more or less retains its shape.", "The red article is made of metal.", "Luggage is a suitcase.", "The red article might be made of aluminium.", "The red article is made of wood.", "Bags are often made of cloth, leather, plastic, or other materials.", "Luggage consists of bags, cases, and containers which hold a traveller's articles while the traveler is in transit.", "Plastic is a material consisting of any of a wide range of synthetic or semi-synthetic organic compounds that are malleable and can be molded into solid objects.", "plastic is a material consisting of any of a wide range of synthetic or semi-synthetic organic compounds that are malleable and so can be molded into solid objects.", "The material is made of rubber.", "The material of a bag can range from plastic to leather and fabrics, and they are often made from a combination of these or other materials.", "Polyethylene is a thermoplastic polymer.", "Leather is a durable and flexible material created by tanning animal rawhide and skins.", "Leather is a durable and flexible material created by tanning animal rawhide and skin, often cattle hide. It can be produced through manufacturing processes ranging from cottage industry to heavy industry."]