["The checkered pattern is known as a picnic blanket.", "The checkered pattern is called a picnic blanket.", "The checkered pattern is called gingham.", "The name of the red and white checkered pattern is checkered.", "A gingham pattern is a checkered pattern.", "A checkered pattern is a pattern that has squares of two different colors.", "a checkered pattern is a pattern with squares of two alternating colors.", "The red and white checkered pattern is called gingham.", "The red and white checkered pattern is called a checkered blanket.", "A checkered pattern is a pattern of alternating squares of two or more colors.", "A checkered pattern is a pattern of squares of two alternating colors.", "The red and white checkered pattern is a picnic tablecloth.", "A picnic blanket is a blanket used for picnics.", "Picnic blanket is a blanket designed for picnicking.", "a checkered pattern is a pattern of squares.", "The name of the pattern is checkerboard.", "A picnic blanket is a blanket used to sit or lay on while having a picnic.", "A picnic blanket is a blanket for use on a picnic.", "A picnic blanket is a blanket that is designed for use on a picnic or similar outdoor activity.", "A checkered pattern is a pattern of alternating light and dark squares.", "Picnic blanket is a blanket to sit or lie on when having a picnic.", "The pattern is called a gingham pattern.", "Picnic blanket, also known as a picnic rug, is a blanket for use on grass or another surface when having a picnic.", "A picnic blanket is a blanket spread out on the ground for people to sit on while having a picnic.", "A gingham check is a pattern of dyed fabric consisting of evenly spaced, vertical and horizontal stripes forming squares.", "A picnic blanket, also known as a picnic rug, is a blanket for use on picnics. It is usually made of lightweight material that can be easily carried.", "Plaid is a pattern consisting of crisscrossed horizontal and vertical bands in multiple colors.", "A plaid is a pattern of criss-crossed horizontal and vertical bands in multiple colours.", "Checkered is a pattern of squares and lines.", "The pattern is called a gingham.", "The pattern is called gingham.", "Checkered blankets are blankets with a checkered pattern on them.", "Picnic is a meal taken outdoors as part of an excursion – ideally in scenic surroundings, such as a park, lakeside, or other place affording an interesting view, or else in conjunction with a public event such as preceding an open-air theatre performance, and usually in summer.", "The Gingham pattern is made of stripes of a single colour.", "A picnic is a meal taken outdoors (al fresco) as part of an excursion - ideally in scenic surroundings, such as a park, lakeside, or other place affording an interesting view, or else in conjunction with a public event such as preceding an open-air theatre performance, and usually in summer.", "A picnic is a meal taken outdoors as part of an excursion – ideally in scenic surroundings, such as a park, lakeside, or other place affording an interesting view, or else in conjunction with a public event such as preceding an open-air theatre performance, and usually in summer.", "Gingham is a medium-weight balanced plain-woven fabric made from dyed cotton or cotton-blend yarn. It is made of carded, medium or fine yarns, where the colouring is on the warp yarns and always along the grain (weft). When the weft yarns are dyed in the same piece, the fabric is called a \"self-gingham\"; otherwise, it is called a \"cross-gingham\". The gingham pattern is woven into the fabric, which is made from carded, medium or fine yarns. The pattern is typically a striped or checked pattern. Gingham", "It is called gingham.", "A gingham is a medium-weight balanced plain-woven fabric made from dyed cotton or cotton-blend yarn.", "Gingham is a medium-weight balanced plain-woven fabric made from dyed cotton or cotton-blend yarn.", "The checkerboard pattern, also known as the chessboard, is a geometric pattern of alternating squares in two colors, most commonly black and white.", "Checkerboard refers to a pattern of alternating light and dark squares.", "Gingham is a medium-weight balanced plain-woven fabric made from dyed cotton or cotton-blend yarn. It is made of carded, medium or fine yarns, where the colouring is on the warp yarns and always along the grain (weft). When the weft yarns are dyed in the same colour, this is sometimes referred to as a \"solid\" or \"pale\" gingham. When the weft yarns are dyed a darker colour, this is referred to as a \"plaid\" gingham.", "The word picnic derives from pique-nique, which is French.", "The tablecloth is made of cotton.", "The checkered flag is the traditional final signal in auto racing."]