["The type of phone is iPhone.", "The phone is an Iphone.", "The phone is an iPhone.", "The phone is an iphone.", "The phone is a cell phone.", "A cellphone is a mobile phone.", "There are many different types of cell phones, including smartphones.", "A smartphone is a mobile phone with a mobile operating system.", "A mobile phone (also known as a wireless phone, cell phone, or cellular telephone) is a small portable radio telephone.", "In telecommunications, a mobile phone (also known as a cellular phone, cell phone and a hand phone) is a device that can make and receive telephone calls over a radio link whilst moving around a wide geographic area.", "A mobile phone, cell phone, cellphone, or hand phone, sometimes shortened to simply mobile, cell or just phone, is a portable telephone that can make and receive calls over a radio frequency link while the user is moving within a telephone service area.", "A mobile phone is a portable telephone that can make and receive calls over a radio frequency carrier while the user is moving within a telephone service area.", "A smartphone is a mobile phone with an advanced mobile operating system which combines features of a personal computer operating system with other features useful for mobile or handheld use.", "A smartphone is a handheld personal computer with a mobile operating system and an integrated mobile broadband cellular network connection for voice, SMS, and Internet data communication; most, if not all, smartphones also support Wi-Fi.", "A cellphone is a portable telephone that makes and receives calls over a radio frequency link while the user is moving within a telephone service area.", "The man is using a cell phone.", "The person is using a smartphone.", "A cell phone is a mobile phone that is designed to be used over a cellular network.", "A cell phone is a portable telephone that can make and receive calls over a radio frequency link while the user is moving within a telephone service area.", "A cell phone is a phone that can make and receive telephone calls over a radio link while moving around a wide geographic area.", "A cell phone is a mobile phone that can make and receive telephone calls over a radio link while moving around a wide geographic area. It does so by connecting to a cellular network provided by a mobile phone operator, allowing access to the public telephone network.", "A cell phone is a portable telephone that can make and receive calls over a radio frequency link while the user is moving within a telephone service area. The radio frequency link establishes a connection to the switching systems of a mobile phone operator, which provides access to the public switched telephone network.", "The phone is a Nokia Lumia 920.", "Cell phones are mobile phones with a cellular network architecture, allowing access to the public switched telephone network.", "Cell phones are used to communicate with each other.", "The phone is iPhone 6S.", "The iPhone is a line of smartphones designed and marketed by Apple Inc. They run Apple's iOS mobile operating system.", "This person is using a smartphone.", "This person is using an iPhone.", "Iphone is a phone that is made by Apple.", "The iPhone is a smartphone made by Apple that combines a computer, iPod, digital camera and cellular phone into one device with a touchscreen interface. The iPhone runs the iOS operating system (OS), and as of 2017, there were 2.2 million apps available for it through the Apple App Store, according to Statista.", "The phone is a Samsung Galaxy S6.", "The iPhone is a line of smartphones designed and marketed by Apple Inc.", "The Apple iPhone is a line of smartphones designed and marketed by Apple Inc.", "The iPhone is a line of smartphones designed and marketed by Apple Inc. The iPhone line of products use Apple's iOS mobile operating system software.", "The Apple iPhone is a touchscreen-based smartphone developed by Apple Inc.", "The person is using a Samsung Galaxy.", "The woman is using a smart phone.", "It is a Samsung Galaxy S6.", "The first handheld mobile phone was demonstrated by John F. Mitchell and Martin Cooper of Motorola in 1973, using a handset weighing 2 kilograms.", "The first mobile phone was demonstrated by John F. Mitchell and Martin Cooper of Motorola in 1973, using a handset weighing 2 kilograms (4.4 lb).", "The most popular mobile operating systems are Android, iOS, Symbian and Windows Phone.", "Apple."]