["Candles are lit with a lighter.", "Candles are lit by a lighter.", "The candles are lit with a lighter.", "The candles are being lit by a person with a lighter.", "The candles are being lit by a lighter.", "The candles are being lit from a lighter.", "The candles are being lit with a lighter.", "Candles are lit by fire.", "The candles are being lit by a lighter", "Candles are lit by using a lighter or matches.", "Candles are lit with a flame or a match.", "Candles are lit by hand.", "Candles are used for lighting purposes.", "The candles on the cake are being lit by a lighter.", "The candles on the cake are being lit with a lighter.", "The candles are being lit by a person blowing on them.", "One candle is being used to light the other candles.", "Candles are often used in romantic or religious settings, for decoration, and for emergencies.", "Candles are made of wax or tallow.", "Candles are often used in the practice of magic.", "Candles are often used in religious ceremonies, as well as in birthday cakes, to signify the number of years the person has lived.", "A candle is a stick with wax around it.", "A candle is an ignitable wick embedded in wax, or another flammable solid substance such as tallow, that provides light, and in some cases, a fragrance. A candle can also provide heat, or be used as a method of keeping time.", "Candles are often used in the Christian religion as an integral part of the observance of certain religious days and events.", "A candle is an ignitable wick embedded in wax or another flammable solid substance such as tallow that provides light, and in some cases, a fragrance.", "A candle is an ignitable wick embedded in wax, or another flammable solid substance such as tallow, that provides light, and in some cases, a fragrance.", "Candles are the simplest form of lighting, and were among the first inventions of the prehistoric human.", "The candles on the cake are being lit with one light lighter.", "A lighter is a portable device used to create a flame, and to ignite a variety of combustible materials, such as cigars, gas stoves, fireworks, candles or cigarettes. It consists of a metal or plastic container filled with a flammable fluid or pressurized liquid gas, a means of ignition to produce the flame, and some provision for extinguishing the flame.", "A lighter is a portable device used to generate a flame.", "Someone is blowing out the candles on a birthday cake.", "The first birthday candle was invented in 1882.", "a lighter", "Fire is the rapid oxidation of a material in the exothermic chemical process of combustion, releasing heat, light, and various reaction products.", "A birthday cake is a cake eaten as part of a birthday celebration in many world traditions."]