["Horses are native to Asia and Europe.", "The country is the United States.", "The church is in a city.", "The church is in Italy.", "The United States of America (USA), commonly known as the United States (U.S.) or America, is a federal republic composed of 50 states, a federal district, five major self-governing territories, and various possessions.", "The United States of America (USA), commonly referred to as the United States (U.S.) or America, is a federal republic composed of 50 states, a federal district, five major self-governing territories, and various possessions.", "The United States of America (USA), commonly referred to as the United States (U.S.) or America, is a federal republic composed of 50 states, a federal district, five major territories and various possessions.", "The United States of America (USA), commonly known as the United States (U.S.) or America, is a country consisting of 50 states, a federal district, five major self-governing territories, and various possessions.", "The United States of America, commonly known as the United States or America, is a country composed of 50 states, a federal district, five major self-governing territories, and various possessions.", "A church building, often simply called a church, is a building used for Christian religious activities, particularly for Christian worship services.", "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country composed of 50 states, a federal district, five major self-governing territories, and various possessions.", "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions.", "Horses are grazing in a city area during the winter.", "A church building or church house, often simply called a church, is a building used for Christian religious activities, particularly for Christian worship services.", "The United States of America, commonly referred to as the United States, America, or simply the States, is a federal republic composed of 50 states, a federal district, five major self-governing territories, and various possessions.", "A church is a Christian religious organization or congregation or community that meets in a particular location.", "This is a church in the United States.", "A horse is a hoofed mammal of the genus Equus.", "The United States of America is a country in North America.", "This is a church in London, England.", "The United States of America is a federal republic consisting of 50 states and a federal district.", "The United States of America is a country in North America. The United States is the world's third or fourth largest country by total area and the third most populous.", "A church is a building used for religious purposes and often has a steeple and stained glass windows.", "The United States of America is a federal constitutional republic comprising fifty states and a federal district.", "Church of the Holy Sepulchre is a church in the Christian Quarter of the Old City of Jerusalem.", "The United Kingdom of Great Britain and Northern Ireland, commonly known as the United Kingdom (UK) or Britain, is a sovereign country in western Europe.", "The United Kingdom of Great Britain and Northern Ireland, commonly known as the United Kingdom or Britain, is a sovereign country in western Europe.", "The United Kingdom of Great Britain and Northern Ireland, commonly known as the United Kingdom (UK), is a sovereign country in western Europe.", "The United Kingdom of Great Britain and Northern Ireland, commonly known as the United Kingdom or Britain, is a sovereign country located off the north-western coast of the European mainland.", "Iceland is a Nordic island country in the North Atlantic, with a population of 348,580 and an area of 103,000 km2 (40,000 sq mi), making it the most sparsely populated country in Europe.", "Sweden is a Scandinavian country in Northern Europe.", "The United Kingdom (UK), officially the United Kingdom of Great Britain and Northern Ireland, is a sovereign country located off the north­western coast of the European mainland.", "This is a picture of a church in the United States.", "Horse grazing in the field.", "A country is a region that is identified as a distinct national entity in political geography.", "Horse is a large odd-toed ungulate mammal.", "Horses are used in the military in every country in the world.", "A country is a region that is identified as a distinct entity in political geography. A country may be an independent sovereign state or one that is occupied by another state.", "A country is a region that is identified as a distinct national entity in political geography. A country may be an independent sovereign state or one that is occupied by another state, as a non-sovereign or formerly sovereign political division, or a geographic region associated with a previously independent people who are now considered a minority group.", "The country is Germany.", "This church is in the city of Moscow in Russia.", "The Church of the Nativity is a basilica located in Bethlehem, in the disputed territories of Judea and Samaria, also known as the West Bank."]