["a horse jumping competition is a sporting event in which a horse and rider attempt to jump over obstacles.", "A horse jumping competition is held in a horse show.", "It is happening at a horse jumping competition.", "horse jumping is a part of a group of English riding equestrian events that also includes dressage, eventing, hunters, and equitation.", "This is happening in an equestrian competition.", "Horse riding is a sport that involves riding horses.", "This is happening at a horse show.", "Horse jumping competitions are held throughout the world.", "This is a horse show.", "a horse show", "The horse show is a competition at which horses and riders are judged on certain performance and conformation traits.", "This is happening in a horse show.", "The equestrian sport of show jumping, also known as \"stadium jumping\", \"open jumping\", or simply \"jumping\", is a part of a group of English riding equestrian events that also includes dressage, eventing, hunters, and equitation. Jumping classes are commonly seen at horse shows throughout the world, including the Olympics.", "Skateboarding is an action sport which involves riding and performing tricks using a skateboard. Skateboarding can also be considered a recreational activity, an art form, a job, or a method of transportation.", "A skatepark, or skate park, is a purpose-built recreational environment made for skateboarding, BMX, scooter, wheelchair, and aggressive inline skating.", "The rider is jumping a horse over an obstacle.", "The rider is jumping in a show.", "A skateboard is a type of sports equipment used primarily for the activity of skateboarding. It usually consists of a specially designed maplewood board combined with a polyurethane coating used for making smoother slides and stronger durability.", "This is happening at a park.", "The event takes place in a show jumping arena, which may be indoors or outdoors.", "A skateboard is a type of sports equipment used primarily for the sport of skateboarding. It usually consists of a specially designed maplewood board combined with a polyurethane coating used for making smoother slides and stronger durability. Most skateboards are made with 7 plies of this wood.", "A skatepark.", "The rider is jumping in a field.", "This is happening in a park.", "The rider is jumping over a small obstacle.", "This is happening in a stadium.", "This is a person jumping a skateboard over a fence.", "The event is being held in the United States.", "A rodeo is a competitive event where cowboys and cowgirls ride and rope livestock."]