["Corn is a type of crop.", "The crops is corn.", "Corn is a green crop.", "The crop is corn.", "The green crop is corn.", "The crop could be corn.", "The corn is a green crop.", "corn is a type of grassy crop that is green.", "The crops could be corn, wheat, barley, or some other type of grain.", "The most common type of crop grown in the United States is corn.", "Corn is a common crop grown in the United States.", "The crop could be corn, wheat, barley, rye, oats, or rice.", "Corn is a grass plant.", "Corn is a grass.", "A corn field is a crop that is green.", "Corn is a type of grain, so it can be green.", "Corn is a type of grain.", "The most common types of crops are corn, wheat, and soybeans.", "Corn is a cereal grain that is grown all over the world.", "The most common crops are wheat, corn, barley and soybeans.", "Corn is a grain crop that provides food for both humans and animals.", "Corn is a tall annual cereal plant.", "The corn plant is a grass.", "Wheat is a green crop.", "Corn is a large grain plant domesticated by indigenous peoples in Mesoamerica in prehistoric times.", "Corn, wheat, and soybeans.", "Wheat, maize, rice, and soybeans are the most widely produced grain crops. Other major grain crops include barley, sorghum, oats, and rye.", "Corn, wheat, and soybeans are all crops that could be this green.", "Some crops are green.", "Wheat is a grass widely cultivated for its seed, a cereal grain which is a worldwide staple food.", "Corn is a cereal grain first domesticated by indigenous peoples in southern Mexico about 10,000 years ago.", "Green crops are crops that are grown for animal feed, silage, or for green manure.", "The corn plant is a grass with a stout, erect, solid stem.", "Corn is a tall annual cereal grass bearing kernels on large ears.", "Some of the crops that are grown in the state of Nebraska include corn, wheat, soybeans, and hay.", "Grains, Corn, Wheat, Rice, Soybeans, Barley, Oats, Sorghum, Rye, Millet, and Sunflowers.", "A crop is a plant or animal product that can be grown and harvested extensively for profit or subsistence.", "Green manure crops include species that are grown to be tilled under to improve the soil."]