["A laptop is a portable computer designed for mobile use.", "A laptop is a personal computer designed for mobile use.", "A laptop computer is a personal computer for mobile use.", "Laptop computers are electronic devices.", "The electronic devices are laptops and a phone.", "Laptops, smartphones, and tablets are popular electronic devices.", "The electronic devices are laptops, phones.", "The electronic devices are laptops and phones.", "A laptop is a small, portable computer.", "Laptops, also called notebook computers by manufacturers, are a type of portable personal computer.", "Laptops are portable computers.", "The electronic devices are laptops, phones and tablets.", "a laptop, a phone.", "Laptop is a portable personal computer with a \"clamshell\" form factor, suitable for mobile use.", "Laptops and phones are pictured here.", "Laptop is a portable personal computer with a clamshell form factor, suitable for mobile use.", "laptop", "Laptops, also called notebook computers or just notebooks, are a type of personal computer designed for portability.", "Electronic devices are pictured here, including laptops, phones, and computers.", "There are several laptops and a phone on the table.", "a laptop and a phone", "A laptop is a small, portable personal computer (PC) with a \"clamshell\" form factor, typically having a thin LCD or LED computer screen mounted on the inside of the upper lid of the clamshell and an alphanumeric keyboard on the inside of the lower lid. The clamshell is opened up to use the computer. Laptops are folded shut for transportation, and thus are suitable for mobile use. Its name comes from lap, as it was deemed to be placed on a person's lap when being used. Although originally there was a distinction between laptops and notebooks (the former being bigger and heavier than", "laptop, phone", "Laptop, phone", "A laptop, also called a notebook computer or simply a notebook, is a small, portable personal computer with a \"clamshell\" form factor, having, typically, a thin LCD or LED computer screen mounted on the inside of the upper lid of the \"clamshell\" and an alphanumeric keyboard on the inside of the lower lid. The \"clamshell\" is opened up to use the computer. Laptops are folded shut for transportation, and thus are suitable for mobile use. Its name comes from lap, as it was deemed to be placed on a person's lap when being used. Although originally there was", "A laptop, also called a notebook computer or simply a notebook, is a small, portable personal computer with a \"clamshell\" form factor, having, typically, a thin LCD or LED computer screen mounted on the inside of the upper lid of the \"clamshell\" and an alphanumeric keyboard on the inside of the lower lid.", "Laptops and phones.", "A laptop, also called a notebook computer or just notebook, is a small, portable personal computer with a \"clamshell\" form factor, having, typically, a thin LCD or LED computer screen mounted on the inside of the upper lid of the clamshell and an alphanumeric keyboard on the inside of the lower lid.", "A laptop computer, often called a notebook computer by manufacturers, is a battery- or AC-powered personal computer generally smaller than a briefcase that can easily be transported and conveniently used in temporary spaces such as on airplanes, in libraries, temporary offices, and at meetings.", "Laptops are pictured here.", "This is a laptop.", "laptop, phone.", "A laptop is a small, portable personal computer (PC) with a \"clamshell\" form factor, typically having a thin LCD or LED computer screen mounted on the inside of the upper lid of the clamshell and an alphanumeric keyboard on the inside of the lower lid.", "Laptop and mobile phone are pictured here.", "Laptops, phones, and tablets.", "A laptop is a small, portable personal computer with a \"clamshell\" form factor, having, typically, a thin LCD or LED computer screen mounted on the inside of the upper lid of the clamshell and an alphanumeric keyboard on the inside of the lower lid.", "A laptop is a small, portable personal computer with a \"clamshell\" form factor, typically having a thin LCD or LED computer screen mounted on the inside of the upper lid of the clamshell and an alphanumeric keyboard on the inside of the lower lid.", "A laptop computer is a small, portable personal computer (PC) with a \"clamshell\" form factor, typically having a thin LCD or LED computer screen mounted on the inside of the upper lid of the clamshell and an alphanumeric keyboard on the inside of the lower lid.", "Laptop, phone, computer, tablet, and ipad.", "Laptop, tablet, phone, e-reader", "Laptops, phones and magazines.", "A tablet computer, commonly shortened to tablet, is a thin, flat mobile computer with a touchscreen display.", "Computer."]