["in this picture, you can exit through a door.", "The door is an exit.", "A doorway is a place of entry and exit.", "A door is a moving structure used to block off and allow access to, an entrance to or within an enclosed space.", "The exit is through the door.", "The door is a moving structure used to block off and allow access to, an entrance to or within an enclosed space, such as a building or vehicle.", "A door is a moving structure used to block off and allow access to, an entrance to or within an enclosed space, such as a building or vehicle.", "A door is a moving structure used to block off, and allow access to, an entrance to or within an enclosed space, such as a building or vehicle.", "A door is a moving structure used to block off and allow access to, an entrance to or within an enclosed space, such as a building, room or vehicle.", "A door is a moving structure used to block off, and allow access to, an entrance to or within an enclosed space, such as a building, room or vehicle.", "A door is a moving mechanism used to block off and allow access to, an entrance to or within an enclosed space, such as a building, room or vehicle.", "A door is a movable structure used to open and close off an entrance, typically consisting of a panel that swings on hinges or that slides or rotates inside of a space.", "A doorway is an architectural opening in a wall or a partition. A door is a panel that covers an opening in a building, room or vehicle.", "A door is a moving structure used to block off and allow access to, an entrance to or within an enclosed space, such as a building or vehicle. Doors normally consist of one or two solid panels, with or without windows, that swing on hinges horizontally.", "The door is a movable structure used to open and close off an entrance, typically consisting of a panel that swings on hinges or that slides or rotates inside of a space.", "Door is a moving structure used to block off, and allow access to, an entrance to or within an enclosed space, such as a building, room or vehicle. Doors normally consist of one or two solid panels, with or without windows, that swing on hinges horizontally.", "The door is a movable structure used to open and close off an entrance, typically consisting of a panel that swings on hinges or that slides or rotates inside of a space. When open, they admit ventilation and light. The door is used to control the physical atmosphere within a space by enclosing the air drafts, so that interiors may be more effectively heated or cooled.", "a door", "You can exit through a door.", "A door.", "The exit is usually a door, but also may be a passageway, gateway, or vestibule.", "A door is a hinged or otherwise movable barrier that allows ingress into and egress from an enclosure.", "A door is a panel that covers an opening in a building, room or vehicle.", "Door.", "The door.", "An exit is a way out of a building, room, or vehicle.", "You can exit through the door.", "An exit is a point of egress from a building, room or vehicle. Exits are commonly labeled with exit signs or emergency exit lights to indicate the direction of travel to reach the exit with respect to the entire building, and are ideally found near the corners of the building to minimize travel distance.", "You could through an exit.", "An exit is a point of egress in a public venue. An exit may also be known as a fire exit, depending on local regulations."]