["There are many famous female tennis players including serena williams and venus williams.", "Venus Williams is a famous female tennis player.", "Serena Williams is a famous female tennis player.", "Venus Williams is a professional tennis player.", "Martina Navratilova is a famous female athlete of tennis.", "Martina Navratilova is a famous tennis player.", "Venus Ebony Starr Williams is an American professional tennis player who is generally regarded as one of the all-time greats of women's tennis and who is, according to Tennis magazine, in 2009 ranked world No.", "Venus Ebony Starr Williams (born June 17, 1980) is an American professional tennis player who is generally regarded as one of the all-time greats of women's tennis and who is, according to some commentators, one of the greatest female athletes of all time.", "Venus Ebony Starr Williams is an American professional tennis player who is generally regarded as one of the all-time greats of women's tennis and who, along with younger sister Serena Williams, is credited with ushering in a new era of power and athleticism on the women's professional tennis tour.", "Serena Williams is one of the most famous female tennis players of all time.", "Serena Williams is an American professional tennis player.", "Martina Navratilova is a Czech and American retired tennis player and coach, and is considered by many to be the greatest female tennis player of all time.", "Serena Williams is a famous female athlete of this sport.", "Venus Williams is a famous female athlete of this sport.", "Serena Williams is an American professional tennis player, and she is widely regarded as one of the greatest tennis players of all time.", "Serena Williams is a famous female athlete.", "Maria Sharapova is a famous female tennis player.", "Martina Navratilova is a famous female athlete of this sport.", "Martina Navratilova is a Czech and American retired tennis player and coach. In 2005, Tennis magazine selected her as the greatest female tennis player for the years 1965 through 2005.", "Serena Williams is an American professional tennis player and former world No. 1 in women's single tennis.", "Maria Sharapova is a Russian professional tennis player, who as of June 2011 is ranked World No. 2 by the Women's Tennis Association (WTA). A United States resident since 1994, Sharapova has won 23 WTA singles titles, including three Grand Slam singles titles at the 2004 Wimbledon, 2006 US Open and 2008 Australian Open.", "Serena Williams is an American professional tennis player who is ranked No. 1 in women's singles tennis.", "Venus Ebony Starr Williams is an American professional tennis player who is ranked world No. 1 in singles by the Women's Tennis Association.", "Maria Sharapova is a Russian professional tennis player.", "She is Serena Williams.", "Maria Sharapova is a Russian professional tennis player who is ranked world No. 2 by the Women's Tennis Association (WTA) and is the top Russian player.", "The Williams sisters, Venus and Serena, are among the most dominant tennis players of all time.", "Serena Williams is an American professional tennis player. The Women's Tennis Association ranked her world No. 1 in singles on eight separate occasions between 2002 and 2017. She reached the No. 1 ranking for the first time on July 8, 2002.", "Serena Williams.", "Maria Sharapova is a female athlete.", "Maria Sharapova is a famous female athlete of this sport.", "Caroline Wozniacki is a Danish professional tennis player. She is a former world No. 1 in singles.", "Billie Jean King is an American former World No. 1 professional tennis player.", "Tennis is a racket sport that can be played individually against a single opponent or between two teams of two players each.", "Maria Sharapova", "Billie Jean King is a female athlete of this sport.", "Tennis is a racket sport that can be played individually against a single opponent or between two teams of two players each. Each player uses a tennis racket that is strung with cord to strike a hollow rubber ball covered with felt over or around a net and into the opponent's court.", "Billie Jean King (née Moffitt; born November 22, 1943) is an American former World No. 1 professional tennis player."]