["Golden Retriever is a breed of dog. It is a large-sized breed of dog bred as gun dogs to retrieve shot waterfowl such as ducks and upland game birds during hunting and shooting parties, and were named retriever because of their ability to retrieve shot game undamaged.", "Golden Retriever is a kind of dog.", "A golden retriever is a type of retriever-gun dog.", "Golden Retriever is a breed of dog.", "Golden Retriever is a large-sized breed of dog bred as gun dogs to retrieve shot waterfowl such as ducks and upland game birds during hunting and shooting parties, and were named 'retriever' because of their ability to retrieve shot game undamaged.", "Golden Retriever is a large-sized breed of dog bred as gun dogs to retrieve shot waterfowl such as ducks and upland game birds during hunting and shooting parties, and were named retriever because of their ability to retrieve shot game undamaged.", "A golden retriever is a medium-sized gun dog that was bred to retrieve shot waterfowl, such as ducks and upland game birds, during hunting and shooting parties.", "The Golden Retriever is a large-sized breed of dog bred as gun dogs to retrieve shot waterfowl such as ducks and upland game birds during hunting and shooting parties, and were named 'retriever' because of their ability to retrieve shot game undamaged.", "The golden retriever is a breed of dog.", "A golden retriever is a breed of dog.", "A Golden Retriever is a medium-large gun dog that was bred to retrieve shot waterfowl, such as ducks and upland game birds, during hunting and shooting parties.", "The Golden Retriever is a large-sized breed of dog bred as gun dogs to retrieve shot waterfowl such as ducks and upland game birds during hunting and shooting parties, and were named retriever because of their ability to retrieve shot game undamaged.", "The Golden Retriever is a large-sized breed of dog bred as gun dogs to retrieve shot waterfowl, such as ducks and upland game birds, during hunting and shooting parties, and were named 'retriever' because of their ability to retrieve shot game undamaged.", "The golden retriever is a large-sized breed of dog bred as gun dogs to retrieve shot waterfowl, such as ducks and upland game birds, during hunting and shooting parties, and were named 'retriever' because of their ability to retrieve shot game undamaged.", "The Golden Retriever is a large-sized breed of dog bred as gun dogs to retrieve shot waterfowl, such as ducks and upland game birds, during hunting and shooting parties, and were named retriever because of their ability to retrieve shot game undamaged.", "Golden Retrievers are a breed of dog.", "Golden Retriever is a large-sized breed of dog bred as gun dogs to retrieve shot waterfowl such as ducks and upland game birds during hunting and shooting parties.", "The Golden Retriever is a medium-large gun dog that was bred to retrieve shot waterfowl, such as ducks and upland game birds, during hunting and shooting parties.", "The golden retriever is a medium-large gun dog that was bred to retrieve shot waterfowl, such as ducks and upland game birds, during hunting and shooting parties.", "Golden Retrievers are a type of dog.", "The dog is a Golden Retriever.", "The dog is a golden retriever.", "Golden Retriever is a large-sized breed of dog bred as gun dogs to retrieve shot waterfowl, such as ducks and upland game birds, during hunting and shooting parties.", "The Golden Retriever is a large-sized breed of dog bred as gun dogs to retrieve shot waterfowl such as ducks and upland game birds during hunting and shooting parties.", "The Golden Retriever is a large-sized breed of dog bred as gun dogs to retrieve shot waterfowl, such as ducks and upland game birds, during hunting and shooting parties.", "A golden retriever is a medium-sized breed of dog.", "Golden Retrievers are dogs.", "Golden retrievers are one of the most popular breeds of dog in the world.", "Golden Retriever", "Golden Retrievers are large, strongly built dogs with a dense, water-repellent wavy coat. As their name implies, they retrieve game for hunters.", "Golden retrievers are a breed of dog that originated in Scotland, and are known for their loyalty, intelligence, and friendly temperament.", "Golden Retriever.", "A dog is a domesticated carnivorous mammal that has been selectively bred for millennia for various behaviors, sensory capabilities, and physical attributes.", "A dog is a domesticated mammal."]