["Autumn is the season after summer and before winter.", "Autumn, also known as fall in North American English, is one of the four temperate seasons. Autumn marks the transition from summer to winter, in September (Northern Hemisphere) or March (Southern Hemisphere), when the duration of daylight becomes noticeably shorter and the temperature cools considerably.", "Autumn is a season of the year between summer and winter.", "Autumn, also known as fall in American and Canadian English, is one of the four temperate seasons. Autumn marks the transition from summer to winter, in September (Northern Hemisphere) or March (Southern Hemisphere), when the duration of daylight becomes noticeably shorter and the temperature cools considerably.", "Autumn is the season after summer and before winter. In the United States this season is also called fall. In the Northern Hemisphere, it is often said to begin with the autumnal equinox in September and end with the winter solstice in December.", "Autumn is the season after summer and before winter. In the United States this season is also called fall.", "The season is autumn.", "The season is Autumn.", "Fall or autumn is one of the four temperate seasons. Autumn marks the transition from summer into winter, in September (Northern Hemisphere) or March (Southern Hemisphere), when the arrival of night becomes noticeably earlier and the temperature cools considerably.", "Autumn, also known as fall in American English and sometimes in Canadian English, is one of the four temperate seasons. Autumn marks the transition from summer into winter, in September (Northern Hemisphere) or March (Southern Hemisphere), when the arrival of night becomes noticeably earlier and the temperature cools considerably. One of its main features is the shedding of leaves from deciduous trees.", "Autumn, also known as fall in American English and sometimes in Canadian English, is one of the four temperate seasons. Autumn marks the transition from summer to winter, in September (Northern Hemisphere) or March (Southern Hemisphere), when the duration of daylight becomes noticeably shorter and the temperature cools considerably.", "Fall, also known as autumn, is one of the four temperate seasons. Autumn marks the transition from summer into winter, in September (Northern Hemisphere) or March (Southern Hemisphere) when the arrival of night becomes noticeably earlier.", "Autumn is one of the four temperate seasons. Autumn marks the transition from summer into winter usually in September (Northern Hemisphere) or March (Southern Hemisphere) when the arrival of night becomes noticeably earlier.", "autumn is one of the four temperate seasons. autumn marks the transition from summer into winter, in september (northern hemisphere) or march (southern hemisphere) when the arrival of night becomes noticeably earlier.", "Autumn is one of the four temperate seasons. Autumn marks the transition from summer into winter, in September (Northern Hemisphere) or March (Southern Hemisphere) when the arrival of night becomes noticeably earlier.", "Autumn is one of the four temperate seasons. Autumn marks the transition from summer into winter, in September (Northern Hemisphere) or March (Southern Hemisphere), when the arrival of night becomes noticeably earlier.", "Autumn, also known as fall in American English and sometimes in Canadian English, is one of the four temperate seasons. Autumn marks the transition from summer into winter, in September (Northern Hemisphere) or March (Southern Hemisphere) when the arrival of night becomes noticeably earlier.", "Autumn is one of the four conventional temperate seasons. Autumn marks the transition from summer into winter, in September (Northern Hemisphere) or March (Southern Hemisphere), when the arrival of night becomes noticeably earlier and the temperature cools considerably.", "Autumn is one of the four temperate seasons. Autumn marks the transition from summer into winter, in September (Northern Hemisphere) or March (Southern Hemisphere), when the duration of daylight becomes noticeably shorter and the temperature cools considerably.", "The autumn is one of the four temperate seasons. Autumn marks the transition from summer into winter, in September (Northern Hemisphere) or March (Southern Hemisphere), when the duration of daylight becomes noticeably shorter and the temperature cools considerably.", "Autumn, also known as fall in American English and sometimes in Canadian English, is one of the four temperate seasons. Autumn marks the transition from summer into winter, in September (Northern Hemisphere) or March (Southern Hemisphere) when the arrival of night becomes noticeably earlier and the temperature cools considerably. One of its main features is the shedding of leaves from deciduous trees.", "Autumn, also known as fall in American English and sometimes in Canadian English, is one of the four temperate seasons. Autumn marks the transition from summer into winter, in September (Northern Hemisphere) or March (Southern Hemisphere), when the arrival of night becomes noticeably earlier. One of its main features is the shedding of leaves from deciduous trees.", "Autumn, also known as fall in North American English, is one of the four temperate seasons.", "Autumn is the transition season between summer and winter.", "The Autumn season is the time when leaves fall from the trees.", "Autumn is one of the four temperate seasons.", "Autumn, also known as fall in American English and sometimes in Canadian English, is one of the four temperate seasons.", "The seasons are spring, summer, autumn, and winter.", "It is autumn.", "autumn.", "The season is fall.", "Fall is a season.", "In autumn, the weather is cool and the leaves are falling.", "The seasons are the periods of the year in which the weather is different.", "In autumn, leaves fall from trees.", "The autumnal equinox is the moment when the Sun appears to cross the celestial equator, heading southward.", "The winter season is the coldest season of the year in polar and temperate zones (winter does not occur in most of the tropical zone). It occurs after autumn and before spring in each year.", "The seasons are the result of the earth's orbit around the sun and the earth's axial tilt relative to the ecliptic plane.", "It is fall.", "A season is one of the four divisions of the year.", "The season of the year in which the sun is at its greatest distance from the celestial equator.", "Fall."]