["The watch is a mechanical watch.", "a watch is a timepiece intended to be carried or worn by a person.", "A watch is a timepiece intended to be carried or worn by a person.", "a watch is a small timepiece intended to be carried or worn by a person.", "A watch is a small timepiece intended to be carried or worn by a person.", "A watch is a small timepiece intended to be carried or worn by a person. It is designed to keep working despite the motions caused by the person's activities.", "A watch is a timepiece intended to be carried or worn by a person. It is designed to keep working despite the motions caused by the person's activities.", "A watch is a portable timepiece intended to be carried or worn by a person.", "A watch is a timepiece intended to be carried or worn by a person. It is designed to keep working despite the motions caused by the person's activities. A wristwatch is designed to be worn around the wrist, attached by a watch strap or other type of bracelet.", "A watch is a small timepiece intended to be carried or worn by a person. It is designed to keep working despite the motions caused by the person's activities. A wristwatch is designed to be worn around the wrist, attached by a watch strap or other type of bracelet. A pocket watch is designed for a person to carry in a pocket.", "The watch is a sport watch.", "The watch is a quartz watch.", "There are many types of watches.", "The watch is an analog watch.", "There are many different types of watches, including wristwatches, stopwatches and pocket watches.", "The watch has a quartz movement.", "This is a quartz watch.", "A wristwatch is designed to be worn around the wrist, attached by a watch strap or other type of bracelet.", "This is a watch with a chronograph.", "This is a chronograph watch.", "The watch face is the part of a watch that displays the time.", "A wristwatch is designed to be worn around the wrist.", "It is a digital watch.", "This is a sport watch.", "An analog watch is a watch that displays the time of day by means of hands moving over a dial face.", "A chronograph is a specific type of watch that is used as a stopwatch combined with a display watch.", "A dive watch, also commonly referred to as a diver's or diving watch, is a watch designed for underwater diving that features, as a minimum, a water resistance greater than 1.0 MPa (10 atm), the equivalent of 100 m (330 ft).", "Rolex is a Swiss luxury watchmaker."]