["Skateboarders should be wearing protective gear such as helmets, wrist guards, and knee pads.", "Skateboarders should wear helmets, knee pads, elbow pads and wrist guards to reduce the risk of injury.", "People skateboarding should wear helmets and knee pads.", "Skateboarders should wear helmets and kneepads to protect themselves from injury.", "Skateboarders should wear helmets, knee pads and elbow pads.", "Skateboarders should wear helmets, knee pads, elbow pads, and wrist guards.", "Skateboarders should wear helmets, knee pads, and elbow pads.", "Skateboarders should wear a helmet, knee and elbow pads, and wrist guards.", "Skateboarders should wear a helmet and knee, elbow and wrist pads.", "Skateboarders should wear helmets, knee pads, and elbow pads to protect themselves from injury.", "Skateboarders should wear helmets and knee and elbow pads.", "Helmets are essential for skateboarding.", "A skateboarder should wear a helmet, knee pads, and elbow pads.", "Helmets, gloves and pads are all important safety equipment for skateboarders.", "Skateboarders should wear helmets and other protective gear.", "Skateboarders should be wearing a helmet.", "The people should be wearing a helmet, wrist guards, elbow pads, and knee pads.", "Helmets and knee pads.", "Skateboarding safety gear includes a helmet and wrist guards.", "We recommend that all skaters wear helmets, knee pads, elbow pads, and wrist guards.", "Skaters are required to wear helmets, knee pads, elbow pads and wrist guards.", "A skateboard helmet is a type of helmet designed for use when riding a skateboard.", "Helmets and pads are a must.", "A skateboarder can be seen wearing a helmet, knee pads and elbow pads.", "Helmets, elbow pads and knee pads.", "People should be wearing helmets.", "Skateboarders should wear protective gear.", "A skateboarder wears a helmet, knee pads, elbow pads, wrist guards and a mouth guard.", "Helmets, protective pads and wrist guards can prevent or reduce the severity of many injuries.", "Helmets are the most important piece of safety equipment. They protect your head and brain from injury.", "These people should be wearing helmets.", "They should be wearing helmets.", "Knee pads, elbow pads, and helmets are recommended.", "Helmet, knee pads, elbow pads, wrist pads, shirt, pants, shoes.", "Skateboarders usually wear hoodies, jeans, and sneakers.", "Skateboarders are usually seen wearing a pair of pants, a shirt, a hoodie, and a pair of shoes.", "Helmets.", "Safety equipment should be worn by these people.", "Wear a helmet, knee pads, elbow pads, and wrist guards to help prevent injury.", "Skateboarding is an action sport which involves riding and performing tricks using a skateboard.", "A helmet is a form of protective gear worn to protect the head from injuries.", "A helmet is a form of protective gear worn on the head to protect it from injuries.", "There are many different types of helmets, but they all have one thing in common: they are designed to protect your head.", "A helmet is a form of protective gear worn to protect the head from injuries. More specifically, a helmet aids the skull in protecting the human brain. Ceremonial or symbolic helmets (e.g., English police motorcycle helmets) without protective function are sometimes used. The oldest known use of helmets was by Assyrian soldiers in 900 BC, who wore thick leather or bronze helmets to protect the head from blunt object and sword blows and arrow strikes in combat. Soldiers still wear helmets, now often made from lightweight plastic materials.", "Skateboarding is an action sport which involves riding and performing tricks using a skateboard. Skateboarding can also be considered a recreational activity, an art form, a job, or a method of transportation.", "Safety equipment helps prevent injury and death.", "A skatepark, or skate park, is a purpose-built recreational environment made for skateboarding, BMX, scooter, wheelchair, and aggressive inline skating."]