["A Buddhist temple is the place of worship for Buddhists, the followers of Buddhism. They include the structures called vihara, chaitya, stupa, wat and pagoda in different regions and languages. Temples in Buddhism represent the pure land or pure environment of a Buddha. Traditional Buddhist temples are designed to inspire inner and outer peace.", "The Buddhist temple is a place of worship for Buddhists.", "The temple is a place where Buddhists go to worship.", "A Buddhist temple is the place of worship for Buddhists, the followers of Buddhism.", "A Buddhist temple is the place of worship for Buddhists, the followers of Buddhism. They include the structures called vihara, chaitya, stupa, wat and pagoda in different regions and languages.", "The temple is a Buddhist temple.", "This is a Buddhist temple.", "Buddhist temples are generally the place where Buddhists go for worship.", "A temple is a building reserved for religious or spiritual rituals and activities such as prayer and sacrifice.", "A temple is a structure reserved for religious or spiritual rituals and activities such as prayer and sacrifice.", "A temple is a structure reserved for religious or spiritual activities such as prayer and sacrifice.", "Buddhist temples are an important part of the landscape and culture of China.", "A temple is a building reserved for religious or spiritual rituals and activities such as prayer and sacrifice. It is typically used for such buildings belonging to all faiths where a more specific term such as church, mosque or synagogue is not generally used in English. These include Hinduism, Buddhism, and Jainism among religions with many modern followers, as well as other ancient religions such as Ancient Egyptian religion.", "A temple is a building reserved for religious or spiritual rituals and activities such as prayer and sacrifice. It is typically used for such buildings belonging to all faiths where a more specific term such as church, mosque or synagogue is not generally used in English.", "A temple is a place where people worship.", "A temple is a structure reserved for religious or spiritual activities such as prayer and sacrifice. It is typically used for such buildings belonging to all faiths where a more specific term such as church, mosque or synagogue is not generally used in English.", "A temple is a structure reserved for religious or spiritual rituals and activities such as prayer and sacrifice. It is typically used for such buildings belonging to all faiths where a more specific term such as church, mosque or synagogue is not generally used in English.", "Buddhist temples are an important part of the Korean landscape. This temple, dating to the 7th century, is located near the historic capital of Kyongju.", "Buddhist temples are an important part of the Korean landscape.", "Buddhism is a religion and dharma that encompasses a variety of traditions, beliefs and spiritual practices largely based on teachings attributed to the Buddha.", "The temple is located in the city of Kyoto, Japan.", "Buddhism is the world's fourth-largest religion with over 520 million followers, or over 7% of the global population, known as Buddhists.", "Buddhism is a religion and philosophy encompassing a variety of traditions, beliefs and practices, largely based on teachings attributed to Siddhartha Gautama, commonly known as the Buddha, \"the awakened one\".", "The monastery is a place where monks live.", "Buddhism is a religion based on the teachings of Siddhartha Gautama, who lived about 25 centuries ago in what is now Nepal and northern India. He came to be called \"the Buddha,\" which means \"awakened one,\" after he experienced a profound realization of the nature of life, death, and existence.", "A monastery is a building or complex of buildings comprising the domestic quarters and workplaces of monastics, monks or nuns, whether living in communities or alone (hermits).", "A monastery is a building or complex of buildings comprising the domestic quarters and workplaces of monastics, monks or nuns, whether living in communities or alone.", "The Great Buddha of Kamakura is a bronze statue of Amida Buddha, which stands on the grounds of the Kotokuin Temple in Kamakura, Kanagawa Prefecture, Japan. With a height of 13.35 meters, it is the second tallest bronze Buddha statue in Japan, surpassed only by the statue in Nara's Todaiji Temple.", "This is a place of worship."]