["Desserts are typically sweet foods, such as cakes, pastries, ice creams, pies, puddings, and candies.", "It is a dessert.", "A dessert is a sweet dish or a course of food, usually eaten at the end of a meal. It may be a sweet or a savory dish.", "A dessert is a course that concludes a meal. The course usually consists of sweet foods, but may include other items.", "A dessert is a course that concludes a main meal. The course usually consists of sweet foods, but may include other items.", "Dessert is a course that concludes a meal. The course usually consists of sweet foods, but may include other items.", "A dessert is a course that concludes a meal.", "Dessert is a course that concludes a main meal. The course usually consists of sweet foods, such as confections dishes or fruit, and possibly a beverage such as dessert wine or liqueur, but may include coffee, cheeses, nuts, or other savory items.", "Dessert is a sweet course that concludes a meal.", "A dessert is a course that concludes a meal. The course usually consists of sweet foods and beverages, such as dessert wine or liqueurs, but may include coffee, cheeses, nuts, or other savory items.", "A dessert is a course that concludes a meal. The course usually consists of sweet foods, and possibly a beverage such as dessert wine or liqueur, but may include coffee, cheeses, nuts, or other savory items.", "A dessert is a course that concludes a main meal.", "Dessert is a course that concludes a main meal. The course usually consists of sweet foods and beverages, such as dessert wine or liqueurs, but may include coffee, cheeses, nuts, or other savory items.", "Dessert is a course that concludes a meal.", "A dessert is typically the sweet course that concludes a meal in the culture of many countries, particularly Western culture. The course usually consists of sweet foods, but may include other items.", "A dessert is typically the sweet course that concludes a meal in the culture of many countries, including the western world. The course usually consists of sweet foods, but may include other items.", "Dessert is a course that concludes a main meal.", "A dessert is typically the sweet course that concludes a meal in the culture of many countries, particularly Western culture.", "a dessert is a course that concludes an evening meal.", "A dessert is typically the sweet course that concludes a meal in the culture of many countries, including the western world.", "Dessert is a course that concludes an evening meal.", "Dessert is a confectionery course that concludes a main meal.", "Desserts are typically the sweet course that concludes a meal in the culture of many countries, including the western world.", "This is a dessert.", "Ice cream is a sweetened frozen food.", "Ice cream (derived from earlier iced cream or cream ice) is a sweetened frozen food typically eaten as a snack or dessert.", "Ice cream is a sweetened frozen food typically eaten as a snack or dessert. It is usually made from dairy products, such as milk and cream, and often combined with fruits or other ingredients and flavors.", "Ice cream is a frozen dessert usually made from dairy products, such as milk and cream, and often combined with fruits or other ingredients and flavors. Most varieties contain sugar, although some are made with other sweeteners.", "Ice cream is a frozen dessert usually made from dairy products, such as milk and cream, and often combined with fruits or other ingredients and flavors."]