["In the 90s, people wore jeans, crop tops, and overalls.", "In the 1990s, the most commonly worn was a shirt and pants.", "The most commonly worn objects of clothing in the 90s were jeans, t-shirts and sneakers.", "The 90s was known for its baggy jeans, tight shirts, and flannels.", "Shorts, skirts, and dresses were most commonly worn in the 90s.", "In the late 90s, the most popular clothing trend was to wear baggy clothing.", "The 1990s fashion scene was full of flannel shirts, ripped jeans, choker necklaces, and more.", "Clothes in the 1990s were very colorful.", "Shirts were commonly worn in the 90s.", "90s fashion is often remembered as a decade of extremes. It was a time of grunge, hip-hop, and the beginning of skater culture.", "A common item of clothing worn in the 1990s was a denim jacket.", "The 90s were known for the grunge fashion trend.", "the shirt was worn in the 90s.", "In the 90s, people wore flannel shirts.", "The 90s is a decade of the Gregorian calendar that began on January 1, 1990 and ended on December 31, 1999.", "The most common objects of clothing that were worn in the 90s are blue shirt.", "The 1990s was a decade of the Gregorian calendar that began on January 1, 1990, and ended on December 31, 1999.", "The 1990s was a decade of the Gregorian calendar that began on 1 January 1990, and ended on 31 December 1999.", "The 90s was a decade of the Gregorian calendar that began on January 1, 1990, and ended on December 31, 1999.", "The 1990s was a decade of the Gregorian calendar that began on January 1, 1990, and ended on December 31, 2000.", "The 1990s was the decade that started on January 1, 1990 and ended on December 31, 1999.", "The 1990s was a decade that ran from 1 January 1990, to 31 December 1999.", "The 1990s was a decade of the Gregorian calendar that began on January 1, 1990, and ended on December 31, 2000. The 1990s are characterized by the rise of multiculturalism and alternative media, which continued into the 2000s and 2010s.", "In the 1990s, fashion was defined by a return to minimalist fashion, in contrast to the more elaborate and flashy trends of the 1980s.", "A pair of jeans, a t-shirt and a pair of sneakers.", "In the 1990s, the fashion scene was dominated by grunge, hip hop, and the supermodels of the late 1980s.", "In the 1990s, the fashion scene was dominated by grunge, hip-hop, and the supermodels of the moment.", "In the 1990s, the waistlines of women's fashion moved higher, while men's waistlines moved lower, and baggy clothing became more popular.", "In the 90s, people wore blue shirts.", "The fanny pack was a popular item of clothing in the 90s.", "Jeans are a type of pants.", "Pants are an item of clothing worn from the waist to the ankles.", "A pair of jeans is a type of pants.", "In the 1990s, the waistline of women's dresses was very low.", "shoes, socks, pants, shorts, skirts, shirts, dresses, undergarments, and headgear.", "A dress, shirt, pants, and a hat.", "A tracksuit is an article of clothing consisting of two parts: trousers and a jacket usually with front zipper. It was originally intended for use in sports, mainly as what athletes wore over competition clothing (e.g., running, track and field) when they were not competing.", "Tennis shoes."]