["Cake is a form of sweet dessert that is typically baked.", "The cake is a chocolate cake.", "The cake is chocolate cake.", "Cake is a form of sweet dessert that is typically baked. In its oldest forms, cakes were modifications of breads, but cakes now cover a wide range of preparations that can be simple or elaborate, and that share features with other desserts such as pastries, meringues, custards, and pies.", "The cake is a vanilla cake.", "Cake is a form of sweet food made from flour, sugar, and other ingredients, that is usually baked.", "Cake is made from a batter and baked in a pan.", "Chocolate cake is a chocolate flavored cake.", "The cake is a wedding cake.", "The cake was chocolate cake.", "The cake is made of chocolate.", "The cake is chocolate flavor.", "The cake is chocolate.", "This cake is made of chocolate.", "The cake is usually made of sponge cake, layered with jam and custard, and coated in fondant icing.", "The flavor of a cake is usually vanilla, chocolate, or red velvet.", "The cake is white.", "The two most popular wedding cake flavors are vanilla and chocolate.", "Chocolate cake is a cake flavored with melted chocolate or cocoa powder.", "The flavor of the cake is often butter, vanilla, chocolate, strawberry, or red velvet.", "The wedding cake is a multi-layered cake that is served at the wedding reception.", "The three-layer cake is chocolate.", "Cakes are often made to celebrate special occasions such as weddings, anniversaries, and birthdays.", "A wedding cake is a cake that is usually served at wedding receptions following dinner.", "A wedding cake is usually a multi-layered, frosted cake that is served at a wedding reception.", "The cake is a plain sponge cake.", "The cake is a three-layer strawberry cake filled with strawberry buttercream and strawberry preserves.", "A wedding cake is the traditional cake served at wedding receptions following dinner.", "Wedding cake is usually white or off-white.", "Cakes are often baked in a cake tin or muffin tin, often coated with flour to prevent sticking and often lined with parchment paper. Cake tins come in a large variety of shapes, such as round, square, rectangular, and novelty.", "Butter cake is a type of cake in which one of the main ingredients is butter.", "Wedding cakes are often white.", "chocolate and vanilla are most common flavors.", "Chocolate is a typically sweet, usually brown food preparation of Theobroma cacao seeds, roasted and ground, often flavored, as with vanilla.", "Vanilla is a flavoring derived from orchids of the genus Vanilla, primarily from the Mexican species, flat-leaved vanilla."]