["Buses can use a variety of energy sources, including electricity, diesel, gasoline, natural gas, and hydrogen.", "Buses are powered by electricity or diesel fuel.", "The bus uses electricity as its source of energy.", "Buses are powered by diesel engines and use diesel fuel.", "Buses can be powered by diesel, gasoline, or electricity.", "Buses are usually powered by diesel engines.", "Buses are powered by diesel fuel.", "The bus uses diesel fuel.", "the bus uses diesel as fuel.", "The bus is powered by diesel fuel.", "The buses are powered by diesel fuel.", "Buses can use gasoline, diesel, natural gas, or electricity.", "Buses use diesel fuel.", "Buses use diesel as fuel.", "The bus uses diesel.", "Most buses use diesel fuel.", "Buses are powered by electricity.", "Most buses use diesel fuel, but some use biodiesel or electricity.", "The bus runs on diesel fuel.", "Many buses use diesel fuel.", "The bus is a form of road transport designed to carry passengers.", "Buses are a common form of transportation in many cities.", "The bus uses electricity to run.", "The bus is powered by electricity.", "The bus uses fossil fuel.", "The bus uses gasoline.", "A bus is a road vehicle designed to carry passengers.", "A bus is a road vehicle designed to carry many passengers.", "A bus is a road vehicle designed to carry many passengers. Buses can have a capacity as high as 300 passengers. The most common type of bus is the single-deck rigid bus, with larger loads carried by double-decker and articulated buses, and smaller loads carried by midibuses and minibuses; coaches are used for longer-distance services.", "A bus is a road vehicle designed to carry many passengers. Buses can have a capacity as high as 300 passengers. The most common type of bus is the single-decker rigid bus, with larger loads carried by double-decker and articulated buses, and smaller loads carried by midibuses and minibuses; coaches are used for longer-distance services.", "A bus is a road vehicle designed to carry many passengers. Buses can have a capacity as high as 300 passengers.", "The bus is powered by an electric motor.", "Diesel fuel is used to power most buses, though some operate on natural gas or electricity.", "A bus is a large wheeled vehicle.", "A bus (archaically also omnibus, multibus, motorbus, autobus) is a road vehicle designed to carry many passengers.", "School buses are powered by diesel fuel.", "A bus powered by electricity is a type of bus that uses electricity as its primary power source.", "The energy source of a vehicle is the source of energy that it uses to move. The most common source of energy is the combustion of fossil fuels.", "Public transport is a system of transport for passengers by group travel systems available for use by the general public, typically managed on a schedule, operated on established routes, and that charge a posted fee for each trip."]