["The sign means that traffic should turn right.", "A sign with an arrow indicates the direction of the road.", "A sign is a traffic sign that is used to indicate the direction of travel.", "The sign is used to indicate a right turn.", "A white sign with an arrow means that the driver must turn in that direction at the next intersection.", "The sign with the arrow means that the street is one-way.", "The sign with the arrow means there is a street ahead.", "The sign with the arrow means that the intersection has a traffic light.", "a sign indicating a left turn", "The white sign with the arrow means that there is a traffic light ahead.", "A road sign is a traffic sign that conveys a message on the road.", "A sign with an arrow means that you are allowed to turn in that direction.", "A road sign is a traffic sign that conveys information to road users.", "The white sign with the arrow means that the road is going to be closed ahead.", "A traffic sign is a type of sign used to give instructions or provide information to road users.", "The street sign with the arrow means the street is one-way.", "A traffic sign is a type of sign which conveys a message to road users, indicating a regulation, warning, or guidance.", "A street sign is a traffic sign that indicates where a street is located.", "This road sign means that the road ahead will be closed.", "A street sign is a traffic sign that indicates the name of a street or road.", "A street sign is a traffic sign that indicates the name of a street.", "A sign with a white arrow means you can turn in the direction of the arrow.", "The sign means you can only turn right.", "The standard road sign for traffic lights is a red circle with a white horizontal bar above it, with an arrow underneath the circle indicating the direction of traffic controlled by the lights.", "A street sign is a traffic sign that indicates the name of street or road.", "The white sign with the arrow means the right turn.", "The white sign with the arrow means turn left.", "The white sign is used to indicate the direction of the traffic flow.", "A street sign is a traffic sign that indicates the name of a street, highway, or other route that is posted, typically at street corners or other locations in cities and towns.", "A street sign is a traffic sign that indicates the name of a street, usually at an intersection.", "The white arrow on a green background indicates the direction of traffic.", "The white sign with the arrow means you must turn left.", "A traffic sign is a type of sign which uses a shape, color or symbol to convey a message to drivers and pedestrians.", "A sign with an arrow means you can make a u-turn.", "a sign that says “no left turn”.", "The sign indicates that the turn is allowed, but not required.", "A sign is a visual object that is used to communicate a message to a particular group of people.", "A green arrow means that you can turn.", "A sign is an object, quality, event, or entity whose presence or occurrence indicates the probable presence or occurrence of something else.", "It means turn right.", "A green arrow means you can go.", "A sign is a visual communication device that conveys information.", "A sign pointing the way to a hospital.", "Road signs in the Republic of Ireland are mostly based on the Vienna Convention on Road Signs and Signals, with some signs unique to Ireland.", "A yield sign is a traffic sign that indicates drivers must slow down and prepare to stop if necessary to let a driver on another approach proceed.", "Turn right at the next intersection."]