["Children are young humans.", "Children are the young of the human species.", "Children are the youth of human beings.", "Children are human beings between the stages of birth and puberty.", "Children are people between the ages of birth and puberty.", "Children are the human offspring of two people.", "Children are the human beings between the stages of birth and puberty.", "Children are young people.", "Children are the human offspring of two people, the male and the female.", "Children are human beings between the stages of birth and puberty, or between the developmental period of infancy and puberty.", "Children are people who are not yet adults.", "Children are human offspring under the age of majority.", "They are children.", "Children are the human offspring of two people, typically a man and a woman.", "The children are children.", "children.", "These are children.", "Children are the human offspring of a man and a woman.", "The children are adults.", "Children are people who have not yet reached the age of majority.", "A child is a human being between the stages of birth and puberty, or between the developmental period of infancy and puberty.", "A child is a young human being between the stages of birth and puberty.", "Children (plural) is a English word, which refers to the young offspring of humans.", "A child is a human being between the stages of birth and puberty.", "Child is a human between the stages of birth and puberty.", "child is a human between the stages of birth and puberty.", "The two people are children.", "These two boys are children.", "The two children are boys.", "The term child may refer either to a male or to a female, or to either of the two sexes. The term child may refer either to a male or to a female, or to either of the two sexes.", "children have smaller nose and mouth than adults.", "The children are smiling.", "The young boy is a child.", "The main difference between children and adults is that children are unable to make rational decisions due to a lack of maturity.", "child."]