["Bicycles and motorcycles are forms of transportation.", "Motorcycles and bicycles are both forms of transportation.", "There are bicycles, motorcycles, scooters, trains, boats, and cars.", "There are many forms of transportation including cars, trains, boats, airplanes, and motorcycles.", "cars and planes are the main forms of transportation.", "There are motorcycles, scooters and cars.", "There are motorcycles, cars, and scooters.", "A motorcycle (or motorbike) is a vehicle used to transport people from one place to another. It has two wheels and one seat.", "There are many different forms of transportation, including cars, buses, trains, subways, planes, boats, and bikes.", "There are motorcyles and scooters.", "A motorcycle (also called a motorbike, bike, or cycle) is a two- or three-wheeled motor vehicle.", "There are many forms of transportation.", "A motorcycle, often called a bike, motorbike, or cycle, is a two- or three-wheeled motor vehicle.", "There are many different forms of transportation.", "Motorcycles are motor vehicles with two wheels.", "A motorcycle is a two-wheeled motor vehicle.", "There are motorcycles and scooters.", "A motorcycle (also called a motorbike, bike, or cycle) is a two- or three-wheeled motor vehicle. Motorcycle design varies greatly to suit a range of different purposes: long distance travel, commuting, cruising, sport including racing, and off-road riding.", "There are many types of transportation.", "A motorcycle (also called a motorbike, bike, moto or cycle) is a two-or three-wheeled motor vehicle.", "A motorcycle is a two-wheeled motor vehicle. They are one of the most affordable forms of motorized transport in many parts of the world and, for most of the world's population, they are also the most common type of motor vehicle.", "A motorcycle, often called a bike, motorbike, or cycle, is a two- or three-wheeled motor vehicle. Motorcycle design varies greatly to suit a range of different purposes: long distance travel, commuting, cruising, sport including racing, and off-road riding. Motorcycling is riding a motorcycle and related social activity such as joining a motorcycle club and attending motorcycle rallies.", "A motorcycle is a two-wheeled motor vehicle. They are very fast.", "The most common forms of transportation are planes, trains, automobiles, and buses.", "Forms of transportation include air, water, road, rail, cable, pipeline and space.", "Bicycle, bus, car, train, plane, boat, motorcycle.", "Bicycle, motorcycle, car, bus, truck, train, plane, boat, ship, etc.", "Bicycle, Car, Train, Bus, Motorcycle, Plane, Boat, Ship, Helicopter, Subway, Van, Truck.", "A motorcycle is a vehicle.", "Scooters are a type of two-wheeled motor vehicle.", "Transportation is the movement of people, animals and goods from one location to another.", "Bicycles are human powered vehicles with two wheels attached to a frame, one behind the other.", "A bicycle is a vehicle that has two wheels, one behind the other, a steering handle, and a saddle seat or seats and is usually propelled by the action of a rider's feet upon pedals.", "A mode of transport is a solution that makes use of a particular type of vehicle, infrastructure, and operation.", "Intercity bus service is the dominant form of transportation.", "A vehicle is a mobile machine that transports people or cargo.", "Airplanes are found at airports."]