["A school is a place where people go to learn.", "The school is located nearby.", "A school bus is a bus that has been designed to carry children to and from school.", "Schools are places where people go to learn.", "Schools are nearby.", "Schools are located in cities.", "A school is an institution designed for the teaching of students (or \"pupils\") under the direction of teachers.", "A school is an educational institution designed to provide learning spaces and learning environments for the teaching of students (or \"pupils\") under the direction of teachers.", "Most schools are near a bus stop.", "The school is near the bus stop.", "Schools are often located near bus stops.", "A school is an educational institution designed to provide learning spaces and learning environments for the teaching of students (or \"pupils\") under the direction of teachers. Most countries have systems of formal education, which is commonly compulsory.", "Schools are often located in the center of a city.", "A school bus is a type of bus owned, leased, contracted to, or operated by a school or school district. It is regularly used to transport students to and from school or school-related activities, but not including a charter bus or transit bus.", "A school bus is a type of bus owned, leased, contracted to, or operated by a school or school district and regularly used to transport students to and from school or school-related activities, but not including a charter bus or transit bus.", "A school is an institution designed for the teaching of students under the direction of teachers.", "The school is the primary place of education for children.", "A school is an institution designed to provide learning spaces and learning environments for the teaching of students (or \"pupils\") under the direction of teachers.", "The bus is a school bus.", "A school bus is a type of bus owned, leased, contracted to, or operated by a school or school district.", "Bus stops are usually located near schools.", "School buses are used for student transport: carrying students to and from school or school events.", "A school bus is a bus owned, leased, contracted to, or operated by a school or school district.", "A school is an educational institution designed to provide learning spaces and learning environments for the teaching of students under the direction of teachers.", "A school is an institution designed to provide learning spaces and learning environments for the teaching of students under the direction of teachers.", "School is an educational institution designed to provide learning spaces and learning environments for the teaching of students under the direction of teachers.", "The school is nearby because the bus is parked in front of the building.", "The school is the place where children learn basic knowledge and skills.", "The school is nearby because the man is carrying many backpacks.", "School buses are yellow.", "Students carry backpacks to school.", "The bus is painted in the colors of a school bus.", "The students are walking to school.", "The backpack is a school bag.", "The man has a backpack.", "A backpack is a cloth sack carried on one's back and secured with two straps that go over the shoulders, but there can be variations to this basic design.", "There are many college students in the city.", "The man is walking down the sidewalk with many backpacks.", "There are many students walking on the sidewalk."]