["A kite is traditionally a tethered heavier-than-air craft with wing surfaces that react against the air to create lift and drag.", "A kite is a tethered heavier-than-air craft with wing surfaces that react against the air to create lift and drag. A kite consists of wings, tethers and anchors.", "A kite is a tethered heavier-than-air craft with wing surfaces that react against the air to create lift and drag.", "A kite is a tethered heavier-than-air craft with wing surfaces that react against the air to create lift and drag. A kite consists of wings, tethers and anchors. Kites often have a bridle and tail to guide the face of the kite so the wind can lift it.", "A kite is a tethered heavier-than-air craft with wing surfaces that react against the air to create lift and drag. A kite consists of wings, tethers and anchors. Kites often have a bridle to guide the face of the kite at the correct angle so the wind can lift it.", "The kite is a toy. A kite is traditionally a tethered heavier-than-air craft with wing surfaces that react against the air to create lift and drag.", "The man flys a kite for fun.", "A kite is a flying object which is tethered to the ground and controlled by a string.", "A kite is traditionally a tethered heavier-than-air craft with wing surfaces that react against the air to create lift and drag. A kite consists of wings, tethers, and anchors. Kites often have a bridle to guide the face of the kite at the correct angle so the wind can lift it.", "This man flies kites for fun.", "The man flies a kite for fun.", "The kite is a tethered heavier-than-air craft with wing surfaces that react against the air to create lift and drag.", "Kites are tethered flying objects which fly by using aerodynamic lift, requiring wind, (or towing), for generation of airflow over the lifting surfaces.", "For many people, kites are a fun and easy way to get into the sport of flying. Kites are also used for recreation.", "A kite is a tethered aircraft.", "The kite is an object that flies in the sky connected to the ground by a rope or string.", "Kite flying is a popular pastime for many people in the world.", "The man flys a kite.", "The man flies a kite.", "Kites are flown for recreation, art or other practical uses. Sport kites can be flown in aerial ballet, sometimes as part of a competition.", "Kite flying is one of the most popular sports and festival in the world.", "Kites have been flown for thousands of years, and kite flying remains popular today.", "The man flies a diamond kite.", "The most common kite shape is the diamond. Other common shapes include the delta, the sled, and the parafoil."]