["The Conair company manufactures hair dryers.", "The brand name of the hair dryer is Conair.", "The brand of the hair dryer is Conair.", "The hair dryer brand is \"Conair\".", "The hair dryer brand name is Conair.", "The hair dryer brand name is \"Dyson\".", "The hair dryer is a Conair.", "The hair dryer is Conair.", "Hair dryers are made by many different companies, including Conair, Remington, and Revlon.", "Hair dryers are made by many different companies.", "This is a hair dryer.", "In the image, the hair dryer is a Conair.", "The hair dryer brand name shown in this picture is \"Blow-Pro\".", "The hair dryer is used to blow dry your hair.", "Hair dryer is a device used to dry hair by blowing hot air.", "Hair dryers are electrical devices used to blow dry hair.", "A hair dryer is an electrical device used to dry and style hair.", "Hair dryers can be made by many different companies.", "Hair dryer is an electrical device used to dry hair.", "The hair dryer is a handheld device used to dry and style hair.", "A hair dryer, hairdryer or blow dryer is an electromechanical device designed to blow normal or hot air over damp hair to accelerate the evaporation of water particles and dry the hair.", "A hair dryer, hairdryer or blow dryer is an electromechanical device that blows ambient or hot air over damp hair to speed the evaporation of water to dry the hair.", "A hair dryer is an electromechanical device designed to blow normal or hot air over damp hair to accelerate the evaporation of water particles and dry the hair.", "The hair dryer is a Conair 1875 Watt Ionic Ceramic Hair Dryer.", "Hair dryers were invented in the 1800s.", "The brand name of this hair dryer is \"Revlon\".", "The first hair dryer was invented in France in 1890 by Alexander Godefroy.", "BaByliss is a brand of hair dryer.", "The brand name is Conair.", "Dyson is a British technology company that designs and manufactures vacuum cleaners, hand dryers, bladeless fans, heaters and hair dryers.", "The Conair Corporation is an American company based in Stamford, Connecticut. It manufactures personal care and kitchen appliances.", "Conair is an American company based in Stamford, Connecticut, that manufactures personal care and household products.", "Conair Corporation, is an American company based in Stamford, Connecticut that manufactures personal care and household products.", "Dyson is a British technology company that designs and manufactures vacuum cleaners, hand dryers, bladeless fans, heaters, hair dryers, and lights.", "Dyson is a British technology company founded in 1993 by James Dyson. It designs and manufactures household appliances such as vacuum cleaners, air purifiers, hand dryers, bladeless fans, heaters, hair dryers, and lights."]