["The words on the front indicate that the bus is a bus for cross county.", "The words on the front indicate that the bus is a cross county bus.", "The words on the front of the bus indicate that the bus goes to cross county.", "The words on the front of the bus indicate that the bus is going to cross county.", "The words on the front indicate the bus is going to cross county.", "The word “Cross” on the front of the bus indicates that the bus is going across the county.", "The words on the front indicate the bus line.", "The words on the front indicate that it is a bus.", "The bus is named Cross County.", "The words on the front indicate the bus route.", "The words on the front of a bus indicate the destination.", "The words on the front indicates the name of the bus.", "The words on the front of the bus indicate the route of the bus.", "The words on the front indicate the destination of the bus.", "The words on the front of the bus indicate the bus is a public transport.", "The name of the bus.", "The words on the front indicate the bus number.", "Bus is a large vehicle designed to transport passengers by road.", "The words on the front indicate that the bus will go to the airport.", "A bus is a road vehicle designed to carry many passengers.", "a bus route is a service of transit buses that follow a particular route.", "The words on the front indicate the name of the company that owns the bus.", "A crossroads is an intersection of two or more roads.", "A crossroads is an intersection where two or more roads meet or cross.", "A crossroads is a junction where two or more roads meet.", "The crossroads is a place where two roads meet.", "A crossroads is a place where two roads meet, usually a busy one with shops, etc.", "The words on the front of the bus indicate the route number.", "The word crossroads is a common noun, which refers to a place where two roads cross. Crossroads is the name of a particular crossroads.", "A bus route is a group of stops served by a specific bus. In some cities, buses may have a route number.", "The word crossroads is a noun.", "Cross Country is a bus line.", "Cross County is a bus line.", "The bus is a school bus.", "A bus is a road vehicle designed to carry many passengers. Buses can have a capacity as high as 300 passengers.", "A bus is a road vehicle designed to carry many passengers. Buses can have a capacity as high as 300 passengers. The most common type of bus is the single-deck rigid bus, with larger loads carried by double-decker and articulated buses, and smaller loads carried by midibuses and minibuses; coaches are used for longer-distance services.", "Cross County is the name of a bus route in New York City.", "Cross Country Buses.", "Bus service is provided by the Cross County Connection Transportation Management Association (CCCTMA), which is the transportation management organization for Camden, Gloucester and Salem Counties.", "Cross County is a bus route operated by the Maryland Transit Administration in Baltimore and its suburbs.", "Cross County is a bus route in New York City, United States, running mostly along Webster Avenue in the Bronx.", "Cross County is a bus route in Westchester County, New York.", "The words on the front indicate \"cross county\".", "The Cross County Connection (CCCT) is a shared ride bus service in southern New Jersey.", "The words on the front indicate the company name.", "The Cross County Connection (CCC) is a regional transportation management association serving Camden, Gloucester and Salem counties in New Jersey."]