["The temperature is warm.", "The temperature is hot.", "The temperature is cold.", "The temperature is warm and sunny.", "Kites can be flown on a windy day.", "Kites fly best when it is very windy.", "Kites fly best when it is not too windy.", "Kites fly best when the wind is steady.", "The temperature is around 20 degrees.", "Kites fly best when there is little or no wind at all.", "Kites are flown for recreation, art or other practical uses.", "Kites are tethered flying objects which fly by using aerodynamic lift, requiring wind, (or towing), for generation of airflow over the lifting surfaces.", "A kite is traditionally a tethered heavier-than-air craft with wing surfaces that react against the air to create lift and drag. A kite consists of wings, tethers and anchors.", "Kites can be flown in any weather.", "A kite is a tethered heavier-than-air craft with wing surfaces that react against the air to create lift and drag. A kite consists of wings, tethers and anchors. A kite is traditionally flown with a string and is tethered to the ground.", "A kite is a tethered heavier-than-air craft with wing surfaces that react against the air to create lift and drag. A kite consists of wings, tethers and anchors.", "A kite is a tethered heavier-than-air craft with wing surfaces that react against the air to create lift and drag.", "Kites fly best with the wind blowing from 4 to 10 mph.", "Kites are flown for recreation and sport, and they have been used in the military.", "Kites have been flown since ancient times and have been used in warfare, science, and kite flying.", "It is warm enough to fly kites outside.", "The wind speed required to fly a kite varies depending on the design and weight of the kite.", "The weather is sunny and warm.", "Kites have a long and varied history and many different types were invented by different cultures around the world.", "The temperature is a measure of the hotness or coldness of an object or substance with reference to a standard value.", "The temperature is the degree of hotness or coldness of an object or substance with reference to a standard value.", "The temperature is about 47 degrees F.", "The temperature is a physical property of a system that underlies the common notions of hot and cold; something that feels hotter generally has the higher temperature.", "The temperature will be about 60 degrees F.", "It is hot.", "The temperature of the air is about 70 degrees.", "temperature is a measure of the average kinetic energy of the particles in a sample of matter.", "The temperature in the beach is hot.", "The wind is blowing.", "It is a windy day.", "The temperature of the Earth's surface varies from place to place.", "It is cold because they are wearing jackets."]