["Traditional hamburger condiments include ketchup, mustard, mayonnaise, pickles, and onions.", "A traditional burger fixing is ketchup.", "The traditional burger fixing is ketchup.", "Condiments are sometimes added to food after it has been cooked, such as mustard on a hot dog.", "A traditional burger fixing is a condiment that is often used on hamburgers.", "A burger is a sandwich consisting of one or more cooked patties of ground meat, usually beef, placed inside a sliced bread roll or bun.", "Ketchup is a sauce used as a condiment.", "Ketchup is a table condiment.", "Many hamburger restaurants offer a selection of condiments to their customers.", "A hamburger (also burger for short) is a sandwich consisting of one or more cooked patties of ground meat, usually beef, placed inside a sliced bread roll or bun.", "ketchup is a traditional burger fixing.", "Ketchup is a traditional burger fixing.", "Ketchup or catsup is a sauce used as a condiment.", "Condiments are a type of food that adds flavor to other foods.", "A traditional burger fixing is mustard.", "Mustard is a traditional burger fixing.", "A hamburger (also called a burger) is a sandwich consisting of one or more cooked patties of ground meat, usually beef, placed inside a sliced hamburger bun.", "The hamburger is a sandwich consisting of one or more cooked patties of ground meat, usually beef, placed inside a sliced bread roll or bun.", "A hamburger is a sandwich consisting of one or more cooked patties of ground meat, usually beef, placed inside a sliced bread roll or bun. The patty may be pan fried, grilled, or flame broiled.", "A hamburger, beefburger or burger is a sandwich consisting of one or more cooked patties of ground meat, usually beef, placed inside a sliced bread roll or bun.", "The hamburger is a sandwich consisting of one or more cooked patties of ground meat, placed inside a sliced bread roll or bun.", "Hot dogs are often eaten with ketchup, mustard, relish, or other condiments.", "A condiment is a spice, sauce, or preparation that is added to food to impart a particular flavor, to enhance its flavor, or to complement the dish.", "A condiment is a spice, sauce, or, preparation that is added to food to impart a particular flavor, to enhance its flavor, or in some cultures, to complement the dish.", "A condiment is a spice, sauce, or preparation that is added to food to impart a particular flavor, enhance its flavor, or in some cultures, to complement the dish, but can not stand alone as a dish.", "A hamburger is a sandwich consisting of one or more cooked patties of ground meat, usually beef, placed inside a sliced bread roll or bun.", "Condiments are sometimes added to food after it has been cooked.", "ketchup is a condiment typically made from tomatoes, vinegar, a sweetener, and assorted seasonings and spices.", "A hamburger is a sandwich consisting of a cooked patty of ground meat usually placed inside a sliced bun.", "Mustard is a condiment made from the seeds of a mustard plant.", "Mayonnaise is a traditional burger fixing.", "A hot dog (also spelled hotdog), also known as a frankfurter (sometimes shortened to frank), dog, or wiener, is a cooked sausage, traditionally grilled or steamed and served in a partially sliced bun.", "A hot dog, or frankfurter, is a cooked sausage, traditionally grilled or steamed and served in a partially sliced bun.", "The hot dog (also spelled hotdog) is a grilled or steamed sausage sandwich where the sausage is served in the slit of a partially sliced bun."]