["A skateboard is a type of sports equipment used primarily for the activity of skateboarding.", "A skateboard is a type of sports equipment used primarily for the sport of skateboarding.", "Skateboard is a type of sports equipment used primarily for the activity of skateboarding.", "Skateboarding is a sport in which the participant rides a skateboard.", "A skateboard is a type of sports equipment used primarily for the activity of skateboarding. It usually consists of a specially designed maplewood board combined with a polyurethane coating used for making smoother slides and stronger durability.", "A skateboard is a type of sports equipment used primarily for the sport of skateboarding. It usually consists of a specially designed maplewood board combined with a polyurethane coating used for making smoother slides and stronger durability.", "a skateboard is a type of sports equipment used primarily for the sport of skateboarding. It usually consists of a specially designed maplewood board combined with a polyurethane coating used for making smoother slides and stronger durability.", "Skateboarding is an action sport which involves riding and performing tricks using a skateboard.", "Skateboarding is the act of riding and performing tricks using a skateboard.", "Skateboarding is a sport where a person rides on a skateboard.", "Skateboards are small boards with wheels that riders use to do tricks or get around.", "skateboarding is the act of riding and performing tricks using a skateboard. a person who skateboards is most often referred to as a skateboarder, or colloquially within the skateboarding community, a skateboarder.", "Skateboarding is an action sport which involves riding and performing tricks using a skateboard, as well as a recreational activity, an art form, an entertainment industry job, and a method of transportation.", "Skateboarding is an action sport which involves riding and performing tricks using a skateboard, as well as a recreational activity, an art form, a entertainment industry job, and a method of transportation.", "Skateboarding is an action sport which involves riding and performing tricks using a skateboard. Skateboarding can also be considered a recreational activity, an art form, a job, or a method of transportation.", "Skateboards are a type of board used for skateboarding. They are usually made of maple wood and are about 32 inches (81 cm) long and 9 inches (23 cm) wide.", "Skateboards are made of wood.", "skateboard", "Skateboards are typically made of maple plywood.", "They are riding skateboards.", "Skateboards.", "They are riding on skateboards.", "The skateboard is a popular mode of transportation.", "Skateboarders ride on a skateboard, which is a small piece of wood with wheels attached to the bottom.", "Skateboards are made of maple.", "Skateboards are propelled by pushing with one foot while the other remains on the board, or by pumping one's legs in structures such as a bowl or half pipe.", "Skateboards are typically made of 7 plies of Canadian maple wood."]