["The plane is over the mountains.", "The plane is over a mountain.", "This plane is over the Swiss Alps.", "The plane is flying over mountains.", "This plane is flying over the Alps, a mountain range in Europe.", "The airplane is flying over a mountain range.", "The plane is over a snowy mountain.", "It is over snowy mountain.", "The plane is flying over a snowy mountain.", "It is over the mountain.", "Planes fly over mountains.", "The airplane is flying over a snowy mountain.", "The jet is flying over the Rocky Mountains.", "The airplane is over the snowy terrain.", "The harsh terrain is the mountain.", "Tundra is a type of biome where the tree growth is hindered by low temperatures and short growing seasons.", "a mountain", "Tundra is a biome where the tree growth is hindered by low temperatures and short growing seasons.", "Tundra is a type of biome where the tree growth is hindered by low temperatures and short growing seasons. The term tundra comes through Russian тундра (tûndra) from the Kildin Sami word tūndâr \"uplands\", \"treeless mountain tract\".", "The plane is over a desert.", "The Swiss Alps.", "The Swiss Alps is the name given to the Alpine mountain range in Europe.", "A mountain is a large landform that rises above the surrounding land in a limited area, usually in the form of a peak.", "The Swiss Alps are the portion of the Alps mountain range that lies within Switzerland.", "A mountain is a large landform that stretches above the surrounding land in a limited area, usually in the form of a peak.", "A mountain is a large landform that rises above the surrounding land in a limited area, usually in the form of a peak. A mountain is generally steeper than a hill.", "Mountains are large landforms that rise above the surrounding land in a limited area, usually in the form of a peak.", "Mountain.", "Airplanes fly over the ocean.", "The Swiss Alps (German: Schweizer Alpen, French: Alpes suisses, Italian: Alpi svizzere, Romansh: Alps svizras) are the portion of the Alps mountain range that lies within Switzerland.", "The Alps are the highest and most extensive mountain range system that lies entirely in Europe, stretching approximately 1,200 kilometres across eight Alpine countries: France, Switzerland, Monaco, Italy, Liechtenstein, Austria, Germany, and Slovenia.", "An airplane is a powered, fixed-wing aircraft that is propelled forward by thrust from a jet engine, propeller or rocket engine.", "The terrain is snowy.", "A jet is an aircraft powered by jet engines.", "A jet is a jet engine.", "Switzerland, officially the Swiss Confederation, is a federal republic in Europe.", "The airplane is a Swiss Air Force F/A-18C Hornet.", "A plane is a flat surface that extends infinitely in two dimensions."]