["Sheep wool is the most used product from sheep.", "Wool is the most used product from sheep.", "Sheep's wool is the most used product from this animal.", "Sheep are most often used for wool, meat and milk.", "Sheep products include wool, meat, and milk.", "The most common products of the sheep are meat, milk and wool.", "Wool is a product from sheep.", "Wool is a common product from sheep.", "The wool from sheep is the most used product.", "Sheep's wool is used for clothing.", "Sheep's wool is the most widely used animal fiber, and is usually harvested by shearing.", "Sheep are raised for their wool, milk, and meat.", "Sheep are commonly raised for their meat, milk, and fiber. They also yield sheepskin and parchment.", "Wool is the textile fiber obtained from sheep and certain other animals, including cashmere and mohair from goats, qiviut from muskoxen, hide and fur clothing from bison, angora from rabbits, and other types of wool from camelids.", "Wool is the textile fiber obtained from sheep and other animals, including cashmere and mohair from goats, qiviut from muskoxen, hide and fur clothing from bison, angora from rabbits, and other types of wool from camelids.", "Sheep are most commonly raised for their meat, milk and fiber.", "Wool is the textile fiber obtained from sheep and other animals, including cashmere and mohair from goats, qiviut from muskoxen, angora from rabbits, and other types of wool from camelids.", "Wool is the textile fiber obtained from sheep and other animals, including cashmere and mohair from goats, qiviut from muskoxen, angora from rabbits, and other types of wool from camelids; additionally, the Highland and the Mangalica breeds of cattle and swine, respectively, possess wooly coats.", "Sheep's milk is the milk of domestic sheep. It is commonly used to make cultured dairy products such as cheese.", "Sheep are raised for their meat, milk, and fiber.", "Sheep milk is the milk of domestic sheep. It is commonly used to make cultured dairy products such as cheese.", "The meat of sheep is called lamb.", "Sheepskin is the hide of a sheep, sometimes also called lambskin. Unlike common leather, sheepskin is tanned with the fleece intact, as in a pelt. Sheepskin numnahs, saddle pads, saddle seat savers, sheepskin horse boots, tack linings and girth tubes are also made and used in equestrianism.", "Sheepskin is the hide of a sheep, sometimes also called lambskin. Unlike common leather, sheepskin is tanned with the fleece intact, as in a pelt. Sheepskin numnahs, saddle pads, saddle seat covers, sheepskin horse boots, tack linings and girth tubes are also made and used in equestrianism.", "Sheepskin is the hide of a sheep, sometimes also called lambskin. Unlike common leather, sheepskin is tanned with the fleece intact, as in a pelt.", "Wool is the most used product from this animal.", "Sheep milk is the milk of domestic sheep.", "Sheepskin is the hide of a sheep, sometimes also called lambskin.", "Lamb, hogget, and mutton are the meat of domestic sheep at different ages. A sheep in its first year is called a lamb, and its meat is also called lamb.", "Sheep meat is mutton.", "The wool is the most used product.", "Lamb is a sheep less than one year old, and its meat is also called lamb.", "wool", "The most used product from this animal is meat."]