["Horses can display a wide range of emotions.", "Horses are social, curious, playful animals, and they can be affectionate and loyal to people.", "Horses are very social animals. They like to be with other horses.", "Horses are very social animals and love to be around other horses.", "Horses are affectionate.", "Horses can be very affectionate towards humans and each other.", "Horses are very expressive animals, and they show a wide range of emotions.", "Horses have different emotions.", "The horse is displaying affection.", "Horses are intelligent animals with a range of emotions.", "Horses are capable of showing a wide range of emotions.", "Horses are social animals.", "Horses are very social animals.", "Horses are friendly.", "Horses are social animals and live in groups called herds.", "The horse is showing curiosity.", "The horse is a very social animal and forms close bonds with humans and other horses.", "The horse is curious.", "Horses are able to read human emotional cues and respond appropriately. They can distinguish between a smiling and a neutral face.", "The horse is happy.", "The horse is happy to see another horse.", "The horse is sad.", "Horses are kept in stables.", "A horse is a hoofed herbivorous mammal of the family Equidae.", "The small horse is expressing love to the big horse.", "Horses are often used as therapy animals, for example for children with autism or other conditions.", "Horses are a prey animal, and their first instinct is to flee.", "A horse is a mammal in the genus Equus, which consists of seven extant species.", "The white horse is happy.", "Horses are prey animals with an inborn fight or flight instinct. Their first reaction to threat is to startle and usually flee, although they will stand their ground and defend themselves when flight is impossible or if their young are threatened.", "Horses display a diverse array of coat colors and distinctive markings, described by a specialized vocabulary. Often, a horse is classified first by its coat color, before breed or sex.", "The horse is a large, four-legged animal with a long, slender body, a slender neck, and a long, slender tail.", "Horses display a diverse array of coat colors and distinctive markings, described by a specialized vocabulary.", "The pony is happy.", "The emotion of love is displayed in the image.", "emotions is a natural instinctive state of mind deriving from one's circumstances, mood, or relationships with others.", "A pony is a small horse. Depending on context, a pony may be a horse that is under an approximate or exact height at the withers or a small horse with a specific conformation and temperament."]