["Silverware is made of metal.", "Spoon is made of metal.", "The spoon is made of metal.", "Silver is a chemical element with the chemical symbol Ag and atomic number 47. A soft, white, lustrous transition metal, it exhibits the highest electrical conductivity, thermal conductivity, and reflectivity of any metal.", "Silver is a chemical element with symbol Ag and atomic number 47. A soft, white, lustrous transition metal, it exhibits the highest electrical conductivity, thermal conductivity, and reflectivity of any metal.", "Spoons are made of metal, wood, plastic, or ceramic.", "Spoons are made from metal, plastic, wood, or ceramic.", "Silver is a chemical element with the symbol Ag (from the Latin argentum, derived from the Proto-Indo-European h₂erǵ: \"shiny\" or \"white\") and atomic number 47. A soft, white, lustrous transition metal, it exhibits the highest electrical conductivity, thermal conductivity, and reflectivity of any metal.", "Spoons are made of metal.", "Spoons are made of metal and plastic.", "Spoons are made from metal or wood.", "Metal is a material (an element, compound, or alloy) that is typically hard, opaque, shiny, and has good electrical and thermal conductivity.", "The spoon is a utensil consisting of a small shallow bowl, oval or round, at the end of a handle. A type of cutlery, especially as part of a place setting, it is used primarily for serving. Spoons are also used in food preparation to measure, mix, stir and toss ingredients.", "A spoon is a utensil consisting of a small shallow bowl, oval or round, at the end of a handle. A type of cutlery, especially as part of a place setting, it is used primarily for serving.", "A spoon is a utensil consisting of a small shallow bowl, oval or round, at the end of a handle.", "The metal spoon is a utensil used for eating.", "A spoon is a utensil consisting of a small shallow bowl, oval or round, at the end of a handle. A type of cutlery (sometimes called flatware in the United States), especially as part of a place setting, it is used primarily for serving. Spoons are also used in food preparation to measure, mix, stir and toss ingredients.", "A spoon is a utensil consisting of a small shallow bowl, oval or round, at the end of a handle. A type of cutlery (sometimes called flatware in the United States), especially as part of a place setting, it is used primarily for transferring food to the mouth. Spoons are also used in food preparation to measure, mix, stir and toss ingredients.", "A metal is a material that is typically hard, opaque, shiny, and has good electrical and thermal conductivity.", "A metal is a material (an element, compound, or alloy) that is typically hard when in solid state, opaque, shiny, and has good electrical and thermal conductivity.", "Spoon is a utensil consisting of a small shallow bowl, oval or round, at the end of a handle.", "The spoon is a utensil consisting of a small shallow bowl, oval or round, at the end of a handle.", "There is a spoon in the picture.", "A spoon is a utensil consisting of a small shallow bowl (also known as a head), oval or round, at the end of a handle.", "A metal is a material that is typically hard when in solid state, opaque, shiny, and has good electrical and thermal conductivity.", "Metals are a class of chemical elements.", "silver metal", "spoon, plate", "The picture shows a plate of food with spoons.", "Silver is a chemical element with the chemical symbol Ag and atomic number 47.", "Silver is a chemical element with symbol Ag and atomic number 47.", "Metals are a broad class of chemical elements whose metalic properties are highly conductive of heat and electricity.", "Silver is a chemical element with symbol Ag (from the Latin argentum, derived from the Proto-Indo-European h₂erǵ: \"shiny\" or \"white\") and atomic number 47.", "Silverware is made from a variety of metals, including silver, stainless steel, silver-plated steel, aluminum, and titanium.", "The spoons are made from the metal, and the spoons are made from the metal, and the spoons are made from the metal, and the spoons are made from the metal, and the spoons are made from the metal, and the spoons are made from the metal, and the spoons are made from the metal, and the spoons are made from the metal, and the spoons are made from the metal, and the spoons are made from the metal, and the spoons are made from the metal, and the spoons are made from the metal, and the spoons are made from the", "Steel is an alloy of iron and carbon, and sometimes other elements. Because of its high tensile strength and low cost, it is a major component used in buildings, infrastructure, tools, ships, automobiles, machines, appliances, and weapons.", "Steel is an alloy of iron and carbon, and sometimes other elements.", "The plate is made of metal."]