["Birds evolved from dinosaurs.", "The bird evolved from a dinosaur.", "The birds evolved from dinosaurs.", "The birds evolved from the dinosaurs.", "Birds evolved from theropod dinosaurs.", "Birds evolved from theropod dinosaurs during the Jurassic Period and, consequently, they are often referred to as avian dinosaurs.", "The ancestor of the modern bird was a small, feathered dinosaur called theropod.", "The bird evolved from a reptile.", "Birds evolved from theropod dinosaurs during the Jurassic period.", "Birds evolved from theropod dinosaurs during the Jurassic Period.", "The ancestors of birds evolved from theropod dinosaurs during the Jurassic Period.", "Birds evolved from theropod dinosaurs during the Jurassic Period, around 150 million years ago.", "Birds evolved from theropod dinosaurs during the Jurassic period, around 150 million years ago.", "Birds evolved from theropod dinosaurs during the Mesozoic Era.", "The bird evolved from a small bird that was perched on a perch.", "Birds evolved from theropod dinosaurs during the Jurassic period, around 150 million years ago, and the earliest known bird is the Late Jurassic Archaeopteryx.", "The common ostrich belongs to the phylum chordata, class aves, and order struthioniformes.", "The ostrich or common ostrich (Struthio camelus) is either of two species of large flightless birds native to Africa, the only living member of the genus Struthio, which is in the ratite family.", "Birds evolved from theropod dinosaurs during the Jurassic Period and, together with Crocodilians, are the only surviving dinosaurs according to cladistics.", "The ancestors of birds are small, carnivorous dinosaurs.", "The bird is a common bird.", "The common ancestor of all birds and all crocodilians was the archosaur.", "A bird is a feathered, winged, bipedal, warm-blooded, egg-laying, vertebrate.", "A bird is a warm-blooded egg-laying feathered vertebrate animal distinguished by the possession of feathers, wings, and a beak and (typically) by being able to fly.", "A bird is an animal that has wings and is covered with feathers.", "A bird is a warm-blooded animal that lays eggs.", "The common raven (Corvus corax), also known as the northern raven, is a large all-black passerine bird."]