["The casserole dish contains broccoli.", "The vegetable in the casserole dish is broccoli. Broccoli is an edible green plant in the cabbage family whose large flowering head is eaten as a vegetable.", "Broccoli is in the casserole dish.", "The casserole dish is filled with broccoli.", "The casserole dish contains broccoli and tomatoes.", "This is a casserole dish with broccoli and tomatoes.", "Broccoli is a vegetable.", "The vegetable is broccoli.", "Broccoli", "Broccoli is a green vegetable.", "Broccoli is an edible green plant in the cabbage family whose large flowering head and stalk is eaten as a vegetable.", "Broccoli is a vegetable. It is a form of cabbage, consisting of a green head of tightly clustered flower buds.", "Broccoli is an edible green plant in the cabbage family whose large flowering head is eaten as a vegetable.", "Broccoli is a member of the cabbage family.", "Broccoli is a cruciferous vegetable, a green plant with dense clusters of buds.", "Brocoli is in the casserole dish.", "Broccoli is a vegetable in the cabbage family (family Brassicaceae, genus Brassica) whose large flowering head is eaten as a vegetable. The word broccoli comes from the Italian plural of broccolo, which means \"the flowering crest of a cabbage\", and is the diminutive form of brocco, meaning \"small nail\" or \"sprout\".", "A casserole is a large, deep dish used both in the oven and as a serving vessel.", "Casserole is a large, deep dish used both in the oven and as a serving vessel.", "The casserole is a large, deep dish used both in the oven and as a serving vessel.", "A casserole is a large, deep pan used both in the oven and as a serving vessel.", "A casserole dish is a large, deep dish with a cover. It is used both in the oven and as a serving dish.", "A casserole is a large, deep dish used both in the oven and as a serving vessel. The word is also used for the food cooked and served in such a vessel, with the cookware itself called a casserole dish or casserole pan.", "Broccoli, Tomatoes, Carrots, Peas, and Spinach.", "A casserole is a large, deep pan used both in the oven and as a serving vessel. The word is also used for the food cooked and served in such a vessel, with the cookware itself called a casserole dish or casserole pan."]