["The college student's room is messy.", "Some college students are messy.", "College students are messy.", "College students have messy rooms.", "College students are usually messy.", "A college student's room would be messy.", "A messy room is a room that is messy.", "If this is a college student, the room is messy.", "A messy room is a room that is not clean and neat.", "A messy room is a room that has a lot of things that are not in the right place.", "If this is a college student is the room messy or clean?", "If a college student’s room is messy, they are probably very busy.", "A messy room is a room that is not neat, or is untidy.", "The room is messy.", "A messy room is a room that is not clean.", "A messy room is a room that is not clean and organized.", "The messy room is clean, the messy room is dirty.", "A messy room is a room that is not clean or organized.", "a messy room.", "College students are often stereotyped as being messy and not taking care of their rooms.", "Messy rooms are a sign of intelligence, study finds.", "Students are often messy.", "In a study of college students, it was found that students with messy rooms had higher levels of creativity.", "A messy room can be a sign of a creative mind.", "College students have a reputation for being messy.", "A messy room is a sign of a creative mind.", "It is messy.", "A college student is a person who is enrolled in a college.", "A college student is a person enrolled in a college or university.", "College students are a demographic group of young adults who usually live away from their parents and are enrolled at a university.", "A college student is a person who is enrolled in an educational institution of higher education.", "A college student is a person who is enrolled in an educational institution of post-secondary education.", "A college student is a person who is enrolled in an institution of higher education or a student who attends college.", "A student or pupil is a learner, or someone who attends an educational institution. In Britain those attending university are termed \"students\"."]