["A runner is the player who scores by running around first, second, and third base, and then touching home plate.", "A run is a score in baseball made by a runner who advances around first, second and third base and returns safely to home plate, touching the bases in that order, before three outs are recorded and all obligations to reach base safely on batted balls are met or assured.", "a run is when a baseball player runs all the way around the bases.", "A run is a score in baseball made by a runner touching all four bases safely in order.", "A baseball runner is a player who is running the bases.", "The batter-runner is a runner on the bases.", "The runner got a run.", "The runner ran after the baseball.", "the runner ran to home plate.", "The runner ran to home plate.", "The runner runs to home plate.", "The runner hit the baseball.", "The runner got a home run.", "A run is scored when a runner advances around first, second and third base and returns safely to home plate, touching the bases in that order, before three outs are recorded and all obligations to reach base safely on batted balls are met or assured.", "The runner ran to the home plate.", "The runner ran to home plate after hitting a home run.", "A run is scored when a runner crosses home plate without being put out.", "A runner is a person who runs, especially as a sport.", "The runner scored a run.", "The runner ran.", "A run is scored when a player advances around first, second and third base and returns safely to home plate, touching the bases in that order, before three outs are recorded and all obligations to reach base safely on batted balls are met or assured.", "A runner is a person who runs.", "The runner is running to the home plate.", "In baseball, a runner must touch first, second, third base before home plate to score a run.", "The runner is running to home plate.", "A home run is a play in baseball in which a batter hits the ball and runs around the four bases, scoring a run.", "A runner is a person who is running.", "In baseball, a runner is the player who is on base and attempting to advance to the next base. Runners on second or third base are considered to be in scoring position since a normal hit, even a single, will often score them.", "The runner ran to first base.", "The runner ran home.", "A runner is a person running on a road or path.", "A runner is a person who is running, either competing in a foot race or by training.", "He runs to home plate.", "He hit a home run.", "In baseball, a batter or batter-runner is a person whose turn it is to face the pitcher.", "The batter-runner must reach first base safely. If he is tagged out while running, or if he overruns first base, he is out.", "A batter is a person whose role in baseball is to attempt to hit the pitched ball with the bat.", "A batter is a person in baseball who tries to hit the ball with a bat.", "Baseball is a bat-and-ball game played between two opposing teams who take turns batting and fielding.", "Running is a method of terrestrial locomotion allowing humans and other animals to move rapidly on foot."]