["A Volkswagen bus is a vehicle designed to transport passengers.", "This is a Volkswagen bus.", "The VW bus is a car.", "The VW Bus is a van.", "The VW bus is a very popular vehicle to drive.", "VW buses are used for transportation.", "A man is a male human.", "Vw is a car.", "A bus is a large motor vehicle used for transporting large numbers of people.", "VW is a manufacturer of automobiles.", "A bus is a road vehicle designed to carry many passengers.", "You can use it to get around.", "A vehicle is a machine that transports people or cargo.", "You can drive it.", "A beard is the collection of hair that grows on the chin, upper lip, cheeks and neck of humans and some non-human animals.", "A beard is the collection of hair that grows on the chin and cheeks of humans and some non-human animals.", "A beard is the hair that grows on the chin, upper lip, cheeks and neck of humans and some non-human animals.", "The Volkswagen Type 2, known officially as the Transporter, Kombi or Microbus, or, informally, as the Bus (US) or Camper (UK), is a forward control panel van introduced in 1950 by the German automaker Volkswagen as its second car model.", "A Volkswagen Type 2, known officially as the Transporter, Kombi or Microbus, or, informally, as the Bus (US) or Camper (UK), is a forward control panel van introduced in 1950 by the German automaker Volkswagen as its second car model.", "The Volkswagen Type 2, known officially (depending on body type) as the Transporter, Kombi or Microbus, or, informally, as the Bus (US) or Camper (UK), is a forward control panel van introduced in 1950 by the German automaker Volkswagen as its second car model.", "A Volkswagen Type 2, known officially (depending on body type) as the Transporter, Kombi or Microbus, or, informally, as the Bus (US) or Camper (UK), is a panel van introduced in 1950 by the German automaker Volkswagen as its second car model.", "The Volkswagen Type 2, known officially as the Transporter, Kombi or Microbus, or, informally, as the Bus or Camper, is a forward control panel van introduced in 1950 by the German automaker Volkswagen as its second car model.", "VW engineers are a type of engineer that work for Volkswagen.", "A bus is a road vehicle designed to carry many passengers. Buses can have a capacity as high as 300 passengers. The most common type of bus is the single-deck rigid bus, with larger loads carried by double-decker and articulated buses, and smaller loads carried by midibuses and minibuses.", "A bus is a road vehicle designed to carry many passengers. Buses can have a capacity as high as 300 passengers.", "The VW bus is a great car.", "The beard is used to make the man look more masculine.", "A van is a type of vehicle used for transporting goods or people.", "The man is a mechanic.", "The man is smiling.", "You can do anything you want with it.", "A car (or automobile) is a wheeled motor vehicle used for transportation.", "You can use it as a car.", "You can use it to take a trip.", "You can use this to transport goods.", "Volkswagen, shortened to VW, is a German automaker founded on 28 May 1937 by the German Labour Front, and headquartered in Wolfsburg.", "You can ride on a bus.", "You drive it.", "You can move around in it.", "Volkswagen has had a long-standing reputation for building quality vehicles.", "The man is wearing a t-shirt with the VW logo on it."]