["The fire hydrant is used by the firefighters.", "Firefighters use a fire hydrant to put out fires.", "Firefighters use fire hydrants to put out fires.", "The fire hydrant is used by firefighters to extinguish fires.", "Firefighters use fire hydrants to extinguish fires.", "Firefighters use fire hydrants to fight fires.", "Firefighters use fire hydrants.", "Firefighters use fire hydrants to get water to put out a fire.", "Fire hydrants are used by firefighters.", "The fire department uses the fire hydrant.", "The fire hydrant is used by the fire department.", "Fire hydrants are used by firefighters and fire service to obtain water to extinguish fires.", "A fire hydrant is a connection point by which firefighters can tap into a water supply. It is a component of active fire protection.", "A fire hydrant is a connection point by which firefighters can tap into a water supply.", "Firefighters use fire hydrants to get water from the hydrant to the fire truck.", "A fire hydrant is a structure for supplying water to put out a fire.", "Fire hydrant is a connection point by which firefighters can tap into a water supply.", "A fire hydrant is an active fire protection measure, and a source of water provided in most urban, suburban and rural areas with municipal water service to enable firefighters to tap into the municipal water supply to assist in extinguishing a fire.", "A fire hydrant, also called fireplug, is a connection point by which firefighters can tap into a water supply.", "A fire hydrant is a component of a fire sprinkler system that is used to deliver large quantities of water to suppress fires.", "A fire hydrant is a component of a fire sprinkler system that is used to deliver large volumes of water to extinguish a fire.", "A fire hydrant, also called a fireplug, fire pump, johnny pump, or simply pump, is a connection point by which firefighters can tap into a water supply.", "Firefighters use this white item.", "firefighters", "A firefighter.", "A firefighter is a rescuer extensively trained in firefighting, primarily to extinguish hazardous fires that threaten life, property and the environment as well as to rescue people and animals from dangerous situations."]