["The tennis racquet is made of wood.", "A tennis racquet is made of wood.", "The material of the tennis racket is wood.", "A tennis racquet is made of wood and leather.", "A tennis racket is made of wood, fiberglass, graphite, or other materials.", "Tennis racquets are made of a variety of materials, including wood, metal and graphite.", "A tennis racquet is made from a variety of materials.", "The tennis racquet is made of a variety of materials.", "A tennis racquet is made from carbon fiber composite (graphite reinforced plastic), which may be augmented by a variety of materials.", "A tennis racquet is made of various materials, such as aluminum, steel, graphite, titanium and Kevlar.", "A tennis racquet is made of carbon fiber composite (graphite reinforced plastic), which may be augmented by a variety of materials.", "Tennis racquets are made from a variety of materials, including carbon fiber, fiberglass, and aluminum.", "The material from which this bat is made of is wood.", "A tennis racket is made of graphite or other lightweight materials.", "A tennis racquet is made of graphite.", "A tennis racquet is made of a frame and strings.", "A tennis racquet is made of carbon fiber.", "A tennis racquet is made of a frame, strings, a handle, and a head.", "The material used to make the racquet is usually graphite, Kevlar, boron, titanium or other special composites.", "The material used to make tennis rackets is usually carbon fiber or graphite.", "The tennis racket is made of aluminum.", "A tennis racket is made of carbon fiber, Kevlar, or fiberglass.", "The most common materials for tennis rackets are graphite, carbon fiber and Kevlar.", "A tennis racquet is a sports implement consisting of a handled frame with an open hoop across which a network of strings or catgut is stretched tightly.", "A tennis racquet or racquet is a sports implement consisting of a handled frame with an open hoop across which a network of strings or catgut is stretched tightly.", "A tennis racket or racquet is the implement used to strike the tennis ball.", "Wood is the material from which bats are made.", "A racket or racquet is a sports implement consisting of a handled frame with an open hoop across which a network of strings or catgut is stretched tightly.", "The material of the bat is wood.", "The bat is made of wood.", "The bat is made of wood, usually ash, maple, or hickory.", "The bat is made of wood, usually salix alba (white willow), and has the shape of a blade topped by a cylindrical handle.", "A bat is a piece of wood that is used to hit a ball.", "It is made of wood.", "It is made from wood.", "A bat is a tool used in sports.", "A baseball bat is a smooth wooden or metal club used in the sport of baseball to hit the ball after it is thrown by the pitcher.", "A bat is a piece of equipment used by a batter to hit a ball thrown by the pitcher.", "Wood is a porous and fibrous structural tissue found in the stems and roots of trees and other woody plants."]