["Elephants live near trees.", "Elephants live in trees.", "elephants, monkeys, birds", "Elephants are animals that live in trees.", "The animals that might be seen in the trees are monkeys and birds.", "Elephants in the wild have been observed to be arboreal, climbing trees to feed on leaves and bark.", "Birds, monkeys and orangutans are animals that live in trees.", "Monkeys are often seen in trees.", "Monkeys and birds are commonly seen in trees.", "In an area like this monkeys might be seen in the trees.", "In an area like this, monkeys might be seen in the trees.", "Elephants are mammals.", "Elephants are mammals of the family Elephantidae and the largest living land animals.", "Elephants are mammals of the family Elephantidae and the largest existing land animals.", "A monkey is a primate that lives in trees.", "In the tropical rainforests of Africa, monkeys can be found in the trees.", "Elephants are mammals of the family Elephantidae and the largest existing land animals. Three species are currently recognised: the African bush elephant, the African forest elephant, and the Asian elephant.", "There are many different types of animals that live in trees.", "elephants are the largest land animals on Earth.", "The African bush elephant is the largest living terrestrial animal.", "Elephants live in a wide variety of habitats, including savannahs, forests, deserts, and marshes.", "In an area like this you might see monkeys, birds, and other animals.", "In an area like this, you might see monkeys.", "Birds, monkeys, insects.", "Monkeys", "Elephants are large mammals of the family Elephantidae and the order Proboscidea.", "Monkeys, parrots, and other birds.", "In the wild, elephants live in groups of related females called a herd. The leader of the herd is called the matriarch. She is usually the oldest and most experienced female. The only males in the herd are the calves, the young elephants.", "Elephant", "The forest is also home to around 50 species of mammal, including the Asian elephant, tiger, leopard and wild boar.", "Parrots, monkeys, and lizards", "The African elephant is found in the savannahs of sub-Saharan Africa and the rainforests of Central and West Africa.", "Lions, tigers, bears, monkeys, and other animals.", "A monkey is a primate of the Haplorrhini suborder and simian infraorder, either an Old World monkey or a New World monkey, but excluding apes and humans.", "The elephant is the only living species of the genus Loxodonta and the family Loxodontidae.", "Giraffes are the tallest mammals on Earth.", "In biology, a tree is a perennial plant with an elongated stem, or trunk, supporting branches and leaves in most species."]