["A freight train is a train that carries freight.", "a freight train is a train that carries goods.", "Freight trains are trains that haul cargo or carry passengers to their destination.", "A freight train or goods train is a group of freight cars hauled by one or more locomotives on a railway, ultimately transporting cargo between a shipper and a receiver.", "A freight train is a group of freight cars traveling on a railway.", "A freight train is a group of freight cars or goods wagons hauled by one or more locomotives on a railway, ultimately transporting cargo between a railway station and a destination.", "The train is a freight train.", "A freight train is a group of freight cars (US) or goods wagons (International Union of Railways) hauled by one or more locomotives on a railway.", "A freight train or goods train is a group of freight cars (US) or goods wagons (International Union of Railways) hauled by one or more locomotives on a railway, transporting cargo all or some of the way between the shipper and the intended destination as part of the logistics chain.", "A freight train is a group of freight cars or goods wagons hauled by one or more locomotives on a railway, transporting cargo all or some of the way between the shipper and the intended destination as part of the logistics chain.", "A freight train carries freight.", "A freight train is a train that carries cargo. A passenger train is a train that carries passengers.", "A freight train or goods train is a group of freight cars (US) or goods wagons (International Union of Railways) hauled by one or more locomotives on a railway, ultimately transporting cargo between two points as part of the logistics chain.", "A freight train is a group of freight cars (US) or goods wagons (International Union of Railways) hauled by one or more locomotives on a railway, ultimately transporting cargo between two points as part of the logistics chain.", "The train is freight.", "The type of train is freight.", "The train is carrying freight.", "Freight trains are used to transport goods or materials.", "Freight trains carry cargo.", "A freight train is a group of freight cars (US) or goods wagons (UIC) hauled by one or more locomotives on a railway, ultimately transporting cargo between a shipper and a receiver.", "A freight train is a group of freight cars (US) or goods wagons (UIC) hauled by one or more locomotives on a railway, ultimately transporting cargo between a shipper and a receiver. Similarly, a train may consist entirely of passenger carrying coaches, some or all of which are powered as a \"multiple unit\".", "A freight train is a group of freight cars (US) or goods wagons (UIC) hauled by one or more locomotives on a railway, ultimately transporting cargo between two points as part of the logistics chain. Trains may haul bulk material, intermodal containers, general freight or specialized freight in purpose-designed cars.", "A freight train or goods train is a group of freight cars (US) or goods wagons (UIC) hauled by one or more locomotives on a railway, transporting cargo all or some of the way between the shipper and the intended destination as part of the logistics chain.", "Freight trains carry goods.", "A freight train is a group of freight cars (US) or goods wagons (UIC) hauled by one or more locomotives on a railway, transporting cargo all or some of the way between the shipper and the intended destination as part of the logistics chain.", "This is a freight train.", "Passenger trains are the trains that carry people. Freight trains are the trains that carry goods.", "Freight train", "freight train", "This is a freight train", "Freight trains are used for the transportation of goods. Passenger trains are used for the transportation of people.", "Passenger trains are for carrying people.", "A train is a form of rail transport consisting of a series of connected vehicles that generally run along a railroad track to transport cargo or passengers.", "Freight trains transport goods, raw materials and products, such as coal, grain, steel, automobiles and consumer goods, between cities and towns.", "The train is a passenger train.", "The term freight train is used by the International Union of Railways (UIC), while the term goods train is used in Great Britain.", "A passenger train or passenger rail service is a form of rail transport that carries passengers.", "A passenger train is one which includes passenger-carrying vehicles which can often be very long and fast.", "Freight trains do not carry passengers."]