["The building is made of bricks.", "The building is made of brick and concrete.", "the building is made of brick.", "The building is made of brick.", "It is a building made of stone and brick.", "The building is made of brick and glass.", "Buildings are made of wood, bricks, concrete, steel and glass.", "A building's structure generally is constructed of wood, masonry, or structural steel.", "The material of which a building is built.", "The building has a brick facade.", "The building is made of stone.", "A building material is any material which is used for construction purposes.", "A building is a man-made structure with a roof and walls standing more or less permanently in one place, such as a house or factory. Buildings come in a variety of sizes, shapes, and functions, and have been adapted throughout history for a wide number of factors, from building materials available, to weather conditions, land prices, ground conditions, specific uses, and aesthetic reasons.", "a building is a structure with a roof and walls standing more or less permanently in one place, such as a house or factory. buildings come in a variety of sizes, shapes, and functions, and have been adapted throughout history for a wide number of factors, from building materials available, to weather conditions, land prices, ground conditions, specific uses, and aesthetic reasons.", "A building is a structure with a roof and walls standing more or less permanently in one place, such as a house or factory. Buildings come in a variety of sizes, shapes, and functions, and have been adapted throughout history for a wide number of factors, from building materials available, to weather conditions, land prices, ground conditions, specific uses, and aesthetic reasons.", "The building is made of glass and steel.", "The building is made of wood.", "A building is a structure with a roof and walls standing more or less permanently in one place, such as a house or factory.", "A building is a structure that has a roof and walls and stands more or less permanently in one place.", "It is made of concrete and steel.", "The building is made of red bricks.", "The most common building material is wood, while other common materials are bricks, building stone such as marble, granite, and limestone, synthetic materials such as concrete and steel, glass, and plastics.", "A building, or edifice, is a structure with a roof and walls standing more or less permanently in one place, such as a house or factory.", "Brick is a building material used to make walls, pavements and other elements in masonry construction. Traditionally, the term brick referred to a unit composed of clay, but it is now used to denote rectangular units made of clay-bearing soil, sand, and lime, or concrete materials.", "Brick is a building material used to make walls, pavements and other elements in masonry construction. Traditionally, the term brick referred to a unit composed of clay, but it is now used to denote any rectangular units laid in mortar.", "Brick is a block of ceramic material used in masonry construction and sized to be layed with one hand using mortar.", "Brick and mortar is a phrase used to refer to brick and mortar stores.", "Concrete, usually Portland cement concrete, is a composite material composed of fine and coarse aggregate bonded together with a fluid cement (cement paste) that hardens over time—most frequently a lime-based cement binder, such as Portland cement, but sometimes with other hydraulic cements, such as a calcium aluminate cement."]