["The person is a famous skier.", "a skier is a person who participates in the sport of skiing.", "Sven Hannawald is a famous ski jumper.", "A famous person for this sport is the skier Jon Olsson.", "A skier is a person who skis.", "The most famous ski jumper is Eddie Edwards.", "A ski jumper is an athlete who participates in the sport of ski jumping.", "The most famous skier is Lindsey Vonn.", "The most famous skiers are Lindsey Vonn, Bode Miller, and Mikaela Shiffrin.", "Erik Robert Johnsen, a Norwegian ski jumper.", "skiing is a sport.", "Eddie the Eagle is a famous ski jumper.", "Erik Guay is a famous skier.", "A famous skier is Lindsey Vonn.", "The sport of Ski Jumping is dominated by the Norwegians and Austrians.", "The sport is ski jumping.", "A skier is a person who participates in skiing, using skis to glide on snow.", "Johan Remen Evensen is a famous skier.", "As of 2018, the most successful ski jumper is Kamil Stoch from Poland, who has won two individual gold medals at the Winter Olympics, two individual World Championships gold medals, and four individual Four Hills Tournament gold medals.", "Ski jumping is a winter sport in which competitors aim to achieve the longest jump after descending from a specially designed ramp on their skis. Along with jump length, competitor's style and other factors affect the final score. Ski jumping was first contested in Norway in the late 19th century, and later spread through Europe and North America in the early 20th century. Along with cross-country skiing, it constitutes the traditional group of Nordic skiing disciplines.", "Ski jumping is a winter sport in which competitors aim to achieve the longest jump after descending from a specially designed ramp on their skis.", "Lindsey Vonn is a famous skier.", "Ski jumping is a form of nordic skiing. It is a winter sport in which competitors aim to achieve the longest jump after descending from a specially designed ramp on their skis.", "The first Winter Olympics were held in 1924 in Chamonix, France.", "The first Winter Olympics was held in 1924 in Chamonix, France.", "The first Winter Olympic Games were held in 1924, in Chamonix, France.", "Johan Remen Evensen is a Norwegian ski jumper.", "Ski jumping is a sport in which skiers go down a take-off ramp, jump and attempt to land as far as possible down the hill below.", "The history of skiing and ski jumping goes back to prehistoric times, when early humans used skis to hunt game.", "Bode Miller is a famous skier.", "Johan Remen Evensen (born 22 March 1990) is a Norwegian ski jumper.", "Erik Guay is a Canadian World Cup alpine ski racer.", "Erik Guay is a Canadian World Cup alpine ski racer. He is a World Champion and Olympic medalist.", "Erik Guay is a Canadian World Cup alpine ski racer. He competes in the speed events of downhill, super-G, and super combined.", "Espen Bredesen is a famous skier.", "Erik Guay is a Canadian World Cup alpine ski racer from Mont-Tremblant, Quebec.", "Nordic combined is a winter sport in which athletes compete in cross-country skiing and ski jumping.", "Espen Bredesen is a Norwegian ski jumper.", "Lindsey Vonn is an American World Cup alpine ski racer on the US Ski Team. She has won four overall World Cup championships—one of only two female skiers to do so, along with Annemarie Moser-Pröll—with three consecutive titles in 2008, 2009, and 2010, plus another in 2012.", "Athletes compete in the freestyle skiing and snowboarding disciplines of moguls, aerials, ski cross, half-pipe, slopestyle, and snowboard cross.", "Lindsey Vonn is an American World Cup alpine ski racer on the US Ski Team. She has won four World Cup overall championships—one of only two female skiers to do so, along with Annemarie Moser-Pröll—with three consecutive titles in 2008, 2009, and 2010, plus another in 2012. Vonn won the gold medal in downhill at the 2010 Winter Olympics, the first one for an American woman. She has also won a record eight World Cup season titles in the downhill discipline (2008–2013, 2015, 2016), five titles in super-G (2009–2012, 2015),", "Johan Olav Koss is a Norwegian former speed skater and physician.", "Tiger Woods is famous for golf.", "Eddie the Eagle", "Takanobu Okabe is a Japanese professional skier."]