["The bathtub is a claw foot tub.", "The bathtub is a clawfoot tub.", "A clawfoot tub is a style of bathtub.", "A clawfoot tub is a type of bathtub.", "A clawfoot tub or claw-foot tub is a style of bathtub.", "A clawfoot tub is a bathtub with feet resembling a clawfoot.", "A claw-foot tub is a bathtub with four legs that are shaped like animal claws.", "A clawfoot tub is a type of bathtub. Its legs resemble a clawfoot.", "A clawfoot tub or claw-foot tub is a type of bathtub.", "A clawfoot bathtub is a bathtub that is supported by four claw-like legs.", "A claw-foot tub or claw-foot bathtub is a type of bathtub. Its legs resemble a claw foot.", "A clawfoot tub is a type of bathtub with feet that resemble a claw foot.", "A clawfoot tub or claw-foot tub is a type of bathtub. Its legs resemble a claw foot.", "A claw-foot tub is a bathtub with four feet resembling animal claws.", "A clawfoot tub or claw-foot tub is a type of bathtub. Its feet resemble a clawfoot.", "A clawfoot bathtub, also known as a claw-foot tub or claw-foot bath, is a type of bathtub. Its legs resemble a claw foot.", "A clawfoot tub, also known as a claw-foot tub or claw-footed tub, is a type of bathtub.", "A clawfoot tub, also known as a claw-foot tub or claw-footed tub, is a type of bathtub. It is called such because of its clawfoot-style legs.", "A clawfoot bathtub, also known as a claw-foot tub or claw-foot bath, is a type of bathtub.", "A claw-foot tub or claw-foot bathtub is a type of bathtub. Its feet resemble a claw foot.", "The clawfoot bathtub is a style of bathtub that sits on four legs.", "The claw-foot tub or claw-foot bathtub is a style of bathtub. A variety of different styles of bathtubs were invented by the Victorians, including the \"claw foot\", which was made possible by the advent of cast iron.", "A clawfoot tub or claw-foot tub is a bathtub with feet that resemble a clawfoot.", "A clawfoot bathtub is a style of bathtub that is mounted on four legs.", "A clawfoot tub is a bathtub with four legs that resemble claws.", "A claw foot bathtub is a bathtub with four claw-shaped legs.", "a clawfoot tub or claw-foot tub is a type of bathtub. Its feet resemble a claw foot.", "A clawfoot tub or claw-foot tub is a style of bathtub. Its feet resemble a claw foot.", "A clawfoot tub is a bathtub that is supported by four feet that resemble claws.", "A clawfoot tub or claw-foot tub is a style of bathtub that is supported by four legs, that are shaped like a claw foot.", "A clawfoot tub or claw-foot tub is a style of bathtub that is noted for having feet resembling animal claws.", "A clawfoot tub or claw-foot tub is a style of bathtub that is supported by four legs, called claw-foot tubs or claw-footed tubs.", "A clawfoot tub is a style of bathtub that is supported by four legs.", "A clawfoot tub is a style of bathtub that is supported by four legs that resemble animal claws.", "A clawfoot bathtub is a bathtub that is supported by four claw-shaped feet. Clawfoot bathtubs are usually made of cast iron and have a porcelain enamel coating.", "A clawfoot bathtub is a bathtub with four feet resembling claws.", "A clawfoot bathtub is a bathtub that is supported by four feet, or claw-like feet.", "This is a clawfoot tub.", "The clawfoot bathtub or claw-foot tub was considered a luxury item in the late 19th century, originally made from cast iron and lined with porcelain. Modern technology has contributed to a drop in the price of clawfoot tubs, and an increase in the variety of styles and colors available.", "The pedestal tub is a clawfoot tub that has a metal base or pedestal instead of claw feet.", "The clawfoot tub or claw-foot tub was considered a luxury item in the late 19th century, originally made from cast iron and lined with porcelain.", "The claw-foot tub or claw-footed tub was considered a luxury item in the late 19th century, originally made from cast iron and lined with porcelain.", "The most common bathtub styles are alcove, corner, freestanding, and drop-in.", "The bathtub is near the window.", "Pedestal tubs are classic and elegant.", "A bath is a large container for water in which a person washes their body."]