["The people are having fun skiing.", "Skiing is a mode of transport, recreational activity and competitive winter sport in which the participant uses skis to glide on snow.", "Skiing is a mode of transport, a recreational activity and a competitive winter sport in which the participant uses skis to glide on snow.", "Skiing is a recreational activity using skis as equipment for traveling over snow. Variations of purpose include basic transport, a recreational activity, or a competitive winter sport.", "The people in the image are having fun.", "Skiing is a means of transport using skis to glide on snow. Variations of purpose include basic transport, a recreational activity, or a competitive winter sport.", "Skiing is a type of winter sport in which a person uses skis to travel over snow.", "Skiing is a means of transport using skis to glide on snow.", "skiing is a fun activity.", "People are having fun in the snow.", "Skiing is a way to travel over snow. It is done by sliding over the snow on skis, which are long flat pieces of wood or plastic.", "The people are having fun.", "People are having fun.", "The people in the photo are having fun.", "A ski resort is a resort developed for skiing, snowboarding, and other winter sports.", "People are enjoying skiing on the mountain side.", "A ski slope is a mountain slope that has been engineered specifically for skiing.", "These people are having fun.", "The photo is staged.", "Photo is staged.", "The photograph is staged.", "A ski lift is a mechanism for transporting skiers up a hill.", "The family is having fun.", "A staged photo is a photo that is not candid.", "Staged photos are photos that are not real, but are set up to look real. For example, a staged photo of a family having fun at the beach may be of a family that is not actually having fun at the beach, but has been set up to look like they are.", "The family is enjoying skiing on the mountain side.", "A family is a group of people who are related to each other."]