["The counter is made of granite.", "Granite countertops are a type of countertop made from granite, a very hard type of rock.", "The countertop is made of granite.", "The counter is granite.", "Granite countertops are a popular style used by many homeowners for new building and kitchen remodels.", "The counter is made of black granite.", "It is made of granite.", "A granite countertop is a popular choice for kitchen design.", "Granite ( /ˈɡrænɨt/) is a common type of felsic intrusive igneous rock that is granular and phaneritic in texture.", "Granite is a common and widely occurring type of intrusive, felsic, igneous rock. Granite has a medium- to coarse-grained texture.", "Granite is a common type of felsic intrusive igneous rock that is granular and phaneritic in texture.", "Granite is a type of igneous rock. It is formed from magma that cools slowly beneath the Earth's surface.", "Granite is a common type of felsic intrusive igneous rock that is granular and phaneritic in texture. Granites can be predominantly white, pink, or gray in color, depending on their mineralogy.", "Countertops are made of various materials.", "Granite is a hard stone and requires skill to carve by hand.", "Granite is a common type of felsic intrusive igneous rock that is granular and phaneritic in texture. Granites can be predominantly white, pink, or gray in color, depending on their mineralogy. The word \"granite\" comes from the Latin granum, a grain, in reference to the coarse-grained structure of such a holocrystalline rock. Strictly speaking, granite is an igneous rock with between 20% and 60% quartz by volume, and at least 35% of the total feldspar consisting of alkali feldspar, although commonly the", "A countertop is a horizontal work surface in kitchens or other food preparation areas, bathrooms or lavatories, and workrooms in general.", "A countertop (also counter top, counter, benchtop, (British English) worktop, or (Australian English) kitchen bench) is a horizontal work surface in kitchens or other food preparation areas, bathrooms or lavatories, and workrooms in general. It is frequently installed upon and supported by cabinets. The surface is positioned at an ergonomic height for the user and the particular task for which it is designed.", "A countertop (also counter top, counter, benchtop, (British English) worktop, or (Australian English) kitchen bench) is a horizontal work surface in kitchens or other food preparation areas, bathrooms or lavatories, and workrooms in general. It is frequently installed upon and supported by cabinets.", "A countertop (also counter top, counter, benchtop, (British English) worktop, or (Australian English) kitchen bench) is a horizontal work surface in kitchens or other food preparation areas, bathrooms or lavatories, and workrooms in general.", "Granite is a common type of igneous rock. Igneous rock (derived from the Latin word ignis meaning fire) is one of the three main rock types, the others being sedimentary and metamorphic.", "A kitchen counter is a horizontal work surface in kitchens that is generally installed upon and supported by cabinets."]