["A strawberry is the fruit of a plant.", "Strawberry is a kind of fruit.", "A strawberry is a fruit.", "Strawberry is a fruit.", "The fruit is a strawberry.", "Strawberries are a kind of fruit.", "The fruit is strawberry.", "Strawberries are a type of fruit.", "Strawberries are a fruit.", "A strawberry is a sweet, usually red, edible fruit.", "A strawberry is a sweet red fruit.", "A strawberry is a sweet, red berry.", "Strawberries are sweet, red fruits with seeds on the outside.", "A strawberry is a red fruit.", "A strawberry is a fruit that is red and has seeds on it.", "Strawberries are a type of berry.", "Strawberries are small red fruits. They are sweet and juicy.", "A strawberry is a soft, red fruit with small seeds on the outside.", "A strawberry is a soft, red fruit with a seed-studded surface.", "A strawberry is a soft, red fruit with tiny seeds.", "The strawberry is a highly nutritious fruit.", "A strawberry is a fruit consisting of a sweet fleshy receptacle, and a central fibrous core.", "The strawberry is a widely grown hybrid species of the genus Fragaria, collectively known as the strawberries, which are cultivated worldwide for their fruit.", "strawberry", "Strawberries are an aggregate accessory fruit.", "Strawberry is a common name for plants in the genus Fragaria of the family Rosaceae, known for their edible fruits.", "A strawberry is a short plant in the wild strawberry genus of the rose family.", "The strawberry is a widely grown hybrid species of the genus Fragaria, collectively known as the strawberries.", "A strawberry (Fragaria × ananassa) is a sweet-tasting fruit.", "The strawberry is a widely grown hybrid species of the genus Fragaria. It is cultivated worldwide for its fruit.", "Strawberries are an important commercial fruit crop, widely grown in all temperate regions of the world.", "The strawberry is a species of Fragaria.", "Strawberries are a widely grown hybrid species of the genus Fragaria, collectively known as the strawberries.", "Strawberries are an aggregate accessory fruit, meaning that the fleshy part is derived not from the plant's ovaries but from the receptacle that holds the ovaries.", "Strawberries are a member of the rose family.", "Strawberries are a good source of vitamin C, fiber, folate, potassium, and antioxidants."]