["Volvo Buses is a subsidiary and a business area of the Swedish vehicle maker Volvo, which became an independent division in 1968. It is the world's second largest bus manufacturer, with a complete range of heavy buses for passenger transportation.", "Volvo Buses is a subsidiary and a business area of the Swedish vehicle maker Volvo, which became an independent division in 1968. It is based in Gothenburg. It is the world's largest bus manufacturer, with a complete range of heavy buses for passenger transportation.", "Volvo Buses is a subsidiary and a business area of the Swedish vehicle maker Volvo, which became an independent division in 1968. It is the world's largest bus manufacturer, with a complete range of heavy buses for passenger transportation.", "Volvo Buses is a subsidiary and a business area of the Swedish vehicle maker Volvo, which became an independent division in 1968. It is based in Gothenburg. It is the world's largest bus manufacturer, with a complete range of heavy buses for passenger transportation. The product range includes complete buses and coaches as well as chassis combined with a comprehensive range of services.", "Volvo Buses is a subsidiary and a business area of the Swedish vehicle maker Volvo, which became an independent division in 1968. It is based in Gothenburg. It is the world’s largest bus manufacturer, with a complete range of heavy buses for passenger transportation. The product range includes complete buses and coaches as well as chassis combined with a comprehensive range of services. The bus operation has a global presence, with production in Europe, North and South America, Asia and Australia.", "Volvo Buses (formerly Volvo Bus Corporation, Volvo Bussar AB) is a subsidiary and a business area of the Swedish vehicle maker Volvo, which became an independent division in 1968. It is based in Gothenburg. It is the world's largest bus manufacturer, with a complete range of heavy buses for passenger transportation. The product range includes complete buses and coaches as well as chassis combined with a comprehensive range of services. The bus operation has a global presence, with production in Europe, North and South America and Asia.", "Volvo Buses is a subsidiary and a business area of the Swedish vehicle maker Volvo, which became an independent division in 1968. It is based in Gothenburg. It is the world's largest bus manufacturer, with a complete range of heavy buses for passenger transportation. The product range includes complete buses and coaches as well as chassis combined with a comprehensive range of services. The bus operation has a global presence, with production in Europe, North and South America, Asia and Australia.", "Volvo Buses (volvobuses) is a subsidiary and a business area of the Swedish vehicle maker Volvo, which became an independent division in 1968. It is based in Gothenburg. It is the world's largest bus manufacturer, with a complete range of heavy buses for passenger transportation. The product range includes complete buses and coaches as well as chassis combined with a comprehensive range of services. The bus operation has a global presence, with production in Europe, North and South America, Asia and Australia.", "The buses are owned by Volvo.", "Volvo Buses is a subsidiary and a business area of the Swedish vehicle maker Volvo, which became an independent division in 1968. It is based in Gothenburg.", "Volvo Buses (formerly Volvo Bus Corporation / Volvo Bussar AB) is a subsidiary and a business area of the Swedish vehicle maker Volvo, which became an independent division in 1968.", "The buses work for the company called Volvo.", "The buses are for the Volvo Buses Corporation.", "Volvo Buses (Swedish: Volvo Bussar) (stylized as VOLVO) is a subsidiary and a business area of the Swedish vehicle maker Volvo, which became an independent division in 1968. It is based in Gothenburg. It is the world’s largest bus manufacturer, with a complete range of heavy buses for passenger transportation. The product range includes complete buses and coaches as well as chassis combined with a comprehensive range of services. The bus operation has a global presence, with production in Europe, North and South America, Asia and Australia.", "The Volvo Buses Corporation is a subsidiary and a business area of the Swedish vehicle maker Volvo, which became an independent division in 1968.", "Volvo manufactures buses and coaches.", "Volvo Buses (Swedish: Volvo Bussar) is a subsidiary and a business area of the Swedish vehicle maker Volvo, which became an independent division in 1968. It is based in Gothenburg.", "Volvo Buses (Swedish: Volvo Bussar) is a subsidiary and a business area of the Swedish vehicle maker Volvo, which became an independent division in 1968.", "Volvo buses are built by Volvo Buses, a subsidiary of the Volvo Group.", "Volvo Buses is a subsidiary and a business area of the Swedish vehicle maker Volvo, which became an independent division in 1968.", "Volvo Buses (Volvo Bus Corporation / formal name: Volvo Bussar AB) (stylized as VOLVO) is a subsidiary and a business area of the Swedish vehicle maker Volvo, which became an independent division in 1968.", "Volvo Buses is one of the world's largest manufacturers of large buses and coaches.", "Volvo Buses (Swedish: Volvo Lastvagnar) (stylized as VOLVO) is a subsidiary and a business area of the Swedish vehicle maker Volvo, which became an independent division in 1968. It is based in Gothenburg.", "Volvo Group is a Swedish multinational manufacturing company headquartered in Gothenburg. While its core activity is the production, distribution and sale of trucks, buses and construction equipment, Volvo also supplies marine and industrial drive systems and financial services.", "Volvo is a Swedish multinational manufacturing company headquartered in Gothenburg.", "The Volvo Group is a Swedish multinational manufacturing company headquartered in Gothenburg.", "AB Volvo is a Swedish manufacturer of trucks, buses, construction equipment, diesel engines, drive systems for marine and industrial applications, aerospace components and financial services.", "volvo", "The buses are operated by the bus company.", "Electric buses are buses powered by electricity."]