["This pizza has olives on it.", "The olives are the black veggie on this pizza.", "The pizza has olives.", "The black vegetable on the pizza is an olive.", "The pizza has olives on it.", "Olives are a type of black vegetable.", "Black olives are on the pizza.", "Olives are small fruits that are usually black or green.", "Olives are black vegetables.", "olives are black vegetables.", "The black olives are olives.", "Black olives are a type of olive.", "Olives are green or black.", "Olives are black.", "Olives are a type of fruit.", "Olives are a fruit.", "The black olive is a type of olive, a fruit of the olive tree.", "olives", "Olives", "Olives are the fruit of the olive tree.", "Olives are fruits that grow on olive trees.", "The black veggie is olives.", "Olives are small fruits that grow on trees. They are a part of the Mediterranean diet.", "Olives are small fruits that grow on trees. They are a staple food in the Mediterranean region.", "olive is a type of small fruit.", "Olive is a small tree with a fruit that has a pit. The fruit is green when it is not ripe, and black when it is ripe. Olives are used to make oil and for food.", "Olives are small fruits that grow on olive trees.", "Olives are a type of fruit that grow on trees.", "The veggie is an olive.", "Black olives are a type of olive produced by curing ripe olives in a mixture of water and ferrous gluconate or ferrous lactate.", "Olives are the fruit of the olive tree, one of the oldest cultivated trees in the world.", "The pizza is topped with black olives.", "Black olives are a type of olive that are ripe olives cured in brine or salt water.", "A black olive is a type of olive that is usually black or purple in color.", "The olives are a group of around 30 species of small to medium-sized trees and shrubs in the family Oleaceae, native to the Mediterranean, Asia and Africa.", "olive is a species of small tree in the family Oleaceae, found traditionally in the Mediterranean Basin.", "Pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients baked at a high temperature, traditionally in a wood-fired oven.", "Pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients (anchovies, olives, meat, etc.) baked at a high temperature, traditionally in a wood-fired oven.", "Pizza is a traditional Italian dish consisting of a yeasted flatbread typically topped with tomato sauce and cheese and baked in an oven. It can also be topped with additional vegetables, meats, and condiments, and can be made without cheese.", "A pizza is a flatbread generally topped with tomato sauce and cheese and baked in an oven. It is commonly topped with a selection of meats, vegetables and condiments. The term was first recorded in the 10th century, in a Latin manuscript from Gaeta in Central Italy.", "A pizza is a flatbread generally topped with tomato sauce and cheese and baked in an oven. It is commonly topped with a selection of meats, vegetables and condiments.", "Pizza is a savory dish of Italian origin consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients (anchovies, olives, meat, etc.) baked at a high temperature, traditionally in a wood-fired oven. In formal settings, like a restaurant, pizza is eaten with knife and fork, but in casual settings it is cut into wedges to be eaten while held in the hand. Small pizzas are sometimes called pizzettas.", "a large pizza sitting outside on top of a table. a nice looking pizza with olives and olives on it. a pizza in a pizza box on a table with a bottle of wine at it"]