["A cellular telephone is a portable telephone that connects to a wireless network.", "A cell phone is a wireless device that can make and receive calls over a radio frequency carrier while the user is moving within a telephone service area.", "A cellular phone is a mobile phone.", "Cellular phones are phones that connect to the telephone network using cellular technology.", "Cellular phones are phones that use a network of specially placed towers that use radio waves to allow people to make and receive calls from anywhere in the world.", "A mobile phone, also known as a cell phone, is a portable telephone that can make and receive calls over a radio frequency link while the user is moving within a telephone service area.", "Cellular phones are mobile phones that are connected to a cellular network.", "Cellular phones are portable telephones.", "Cell phones are phones that use cellular networks to send signals.", "A cell phone is a mobile phone that can make and receive telephone calls over a radio link while moving around a wide geographic area.", "Cellular phones are phones that use cellular technology.", "The phone is a cellular phone.", "A mobile phone (also known as a wireless phone, cell phone, or cellular telephone) is a small portable radio telephone.", "A mobile phone (also known as a wireless phone, cell phone, or cellular telephone) is a small portable radio telephone. The mobile phone can be used to communicate over long distances without wires.", "The phone is cellular.", "Cellular phone", "Cellular phones and landline phones are two different types of telephones. Landline phones are the traditional phones that use wires, and cellular phones are the phones that use cellular technology to send and receive calls.", "Cellular phones are mobile phones that work by using radio waves to communicate with cell towers.", "Cellular phones are mobile phones that use wireless technology.", "Cellular phones are handheld devices that send and receive radio signals through radio towers.", "Cell phones are portable devices that can be used to make phone calls.", "This is a cellular phone.", "The cellular phone is a wireless device.", "cellular phone is a phone with a lot of functions.", "A mobile phone is a portable telephone that can make and receive calls over a radio frequency carrier while the user is moving within a telephone service area.", "A landline phone is connected to a physical wire that runs from the phone to a telephone company. A cellular phone sends and receives signals through a network of cell towers.", "Cellular phone.", "The man is using a cellular phone.", "Cell phones are mobile phones that can be carried with you.", "A cellular network or mobile network is a communication network where the last link is wireless.", "Cellular phones are very popular.", "A landline telephone is a phone that uses a metal wire or optical fiber telephone line for transmission as distinguished from a mobile cellular line, which uses radio waves for transmission.", "Cellular.", "A landline telephone is a phone that uses a wire or cable connection to the telephone network.", "A landline telephone is a phone that uses a metal wire or optical fiber telephone line for transmission as distinguished from a mobile cellular line.", "A corded telephone, or landline, is hardwired to the telephone network, and the cord on the phone is used to connect the handset to the telephone.", "A landline telephone (also known as land line, land-line, main line, home phone, landline, fixed-line, and wireline) is a phone that uses a metal wire or optical fiber telephone line for transmission as distinguished from a mobile cellular line, which uses radio waves for transmission."]