["Elephants are known for being the largest land animal.", "The elephant is a mammal.", "An elephant is a large mammal of the family Elephantidae.", "Elephants are known for their large size.", "Elephants are the largest land animals on Earth.", "Elephants are mammals of the family Elephantidae and the largest existing land animals.", "Elephants are the largest existing land animals.", "An elephant is a large mammal of the order Proboscidea which are characterized by a long, flexible, muscular trunk and by the absence of canine teeth in the adult.", "Elephants are large mammals of the family Elephantidae and the order Proboscidea.", "The elephants are known for their large ears.", "Elephants are large mammals of the family Elephantidae in the order Proboscidea.", "Elephants are well-known for their use of tools.", "Elephants are best known for their long trunks.", "Elephants are known for their large ears.", "elephants are best known for their large ears.", "Elephants are known for their long trunks, large ears, and tusks.", "Elephants are well known for their large ears.", "Elephants are mammals of the family Elephantidae and the largest existing land animals. Three species are currently recognised: the African bush elephant, the African forest elephant, and the Asian elephant.", "Elephants are known for their long trunks.", "The elephant is the largest living land animal.", "Elephants are large mammals of the family Elephantidae and the order Proboscidea. Three species are currently recognised: the African bush elephant, the African forest elephant, and the Asian elephant. Elephantidae is the only surviving family of the order Proboscidea; other, now extinct, families of the order include mammoths and mastodons.", "The African elephant is the largest land animal on Earth. African elephants are slightly larger than their Asian cousins and can be identified by their larger ears that look somewhat like the continent of Africa.", "The African bush elephant is the larger of the two species of African elephant.", "The African bush elephant is the larger of the two species.", "The African Bush Elephant is the largest land animal on Earth.", "Elephants are known for their large ears, tusks made of ivory, and their trunks.", "The elephant is a mammal of the order Proboscidea.", "Elephants are known for their intelligence and memory.", "Elephants are known for their tusks.", "Elephants are known for their large ears, tusks made of ivory and their trunks.", "The African bush elephant is the largest and heaviest land animal on Earth.", "An elephant's trunk is an important body part that is used for breathing, smelling, touching, grasping, and making sounds.", "Elephants are the only living members of the order Proboscidea, which once included mammoths and mastodons.", "The Asian elephant is an endangered species which has experienced a drastic population decline in the last three generations."]