["The person is going downhill.", "A person is going downhill.", "The person is going down the hill.", "The ski is going down the hill.", "The direction of the person is going to the left.", "A skier is going down the hill.", "A person skiing is going downhill.", "The person is going down a hill.", "A person is moving in a right direction.", "This person is going left to right.", "A person is going to the right.", "The person is going to the right.", "The person is traveling from left to right.", "The direction of the skier is downhill.", "The person is going down.", "Skiing is a means of transport using skis to glide on snow.", "The person is going north.", "The direction of skiing is down the mountain.", "The direction of skiing is usually down the hill.", "A ski is a narrow strip of semi-rigid material worn underfoot to glide over snow.", "This person is going North.", "The direction is right to left.", "Skiing is a mode of transport, a recreational activity and a sport in which the participant uses skis to glide on snow.", "Skiing is a means of transport using skis to glide on snow. Variations of purpose include basic transport, a recreational activity, or a competitive winter sport.", "The direction of travel is from left to right.", "The man is going to the left.", "Downhill skiing is the pastime of sliding down snow-covered slopes on skis with fixed-heel bindings, unlike other types of skiing, which use skis with free-heel bindings.", "a person is skiing across the snow.", "The man is going straight down the hill.", "The man is going down the hill.", "the direction in which something is moving or facing, especially north, south, east, or west.", "The man is going down.", "The snowboarder is going down the mountain.", "The north direction is the direction that is to the left of the east direction.", "The direction of motion of an object is the direction of the change in its position with respect to time.", "The snowboard is a board that usually has the feet attached to it and is usually wider than skis."]