["A church is a building used for religious worship.", "A church is a building where people worship.", "A church is a building used for Christian worship services.", "A church is a building used for Christian religious activities, particularly worship services.", "A church is a Christian religious building used for worship services.", "A church is a building used for religious activities, particularly worship services.", "A church is a building or place of worship for Christians.", "This building is a church, which is used for worship.", "A church is a building used for public Christian worship.", "The church is used for worship.", "The church is a place of worship.", "A church is a building that people go to worship or pray.", "A church is a Christian place of worship.", "A church is a building used for Christian religious activities, particularly for Christian worship services.", "a church is a building used for Christian religious activities", "A church is a religious building used for Christian religious activities.", "A church building, often simply called a church, is a building used for Christian religious activities, particularly for Christian worship services.", "Churches are buildings where people worship.", "Churches are used for worship.", "A church building is a building used for Christian religious activities, particularly for Christian worship services. The term is often used by Christians to refer to the physical buildings where they worship, but it is sometimes used (by analogy) to refer to buildings of other religions.", "The church is a place where people come together to worship God. A church is a building where people go to pray.", "Churches are places of worship.", "A church building or church house, often simply called a church, is a building used for Christian religious activities, particularly worship services.", "The building is a church.", "A church is a building or structure whose primary purpose is to facilitate Christian worship and meetings.", "A church building, often simply called a church, is a building used for Christian religious activities, particularly for Christian worship services. The term is often used by Christians to refer to the physical buildings where they worship, but it is sometimes used (by analogy) to refer to buildings of other religions. In traditional Christian architecture, the church is often arranged in the shape of a Christian cross.", "This building is a church.", "People go to church to worship.", "A church is a Christian religious organization or congregation or community that meets in a particular location.", "People will worship in this building.", "It is a place of worship.", "You are going to worship in this building.", "A cathedral is a church that contains the cathedra (Latin for 'seat') of a bishop, thus serving as the central church of a diocese, conference, or episcopate.", "Worship.", "You are going to eat dinner in this building."]