["A group of police officers on horseback are participating in a parade.", "The mounted police are an important part of the police force.", "A mounted police officer is a person who is a member of a police force and who patrols on horseback or camelback.", "A mounted police officer is a person who is a member of a police force and who patrols on horseback.", "A mounted police unit is a unit of personnel who ride horses as part of their duties.", "Police horse, also called mounted police, are police officers who patrol on horseback or camelback.", "The mounted police are a full-time, professional branch of a police force trained to patrol and respond on horseback.", "Mounted police are police who patrol on horseback or camelback.", "A mounted police force is a police force that patrols on horseback or camelback.", "A police horse is a horse that is used by mounted police, especially in urban areas.", "A mounted police officer is a person who is a member of a mounted police unit. Typically a mounted police service has four operational components:", "A mounted police unit is a unit of personnel who use horses to carry out their duties. They are an important part of most police forces and are often seen as the icon of that force.", "A mounted police unit is a unit of personnel who patrol on horseback or camelback.", "A police horse is a horse used by mounted police, especially in the United Kingdom.", "A mounted police officer patrols on horseback or camelback.", "A police horse is a horse used by various police forces around the world.", "Police on horseback are often called mounted police.", "Police horses are used by mounted police all over the world.", "The police are law enforcement officers.", "The police are a constituted body of persons empowered by a state to enforce the law, to protect people and property, and to prevent crime and civil disorder.", "The police are participating in a parade.", "They are police officers patrolling the city.", "This is a mounted police unit.", "Horseback riding is the activity of riding on horses.", "A police patrol is most often a group of personnel, such as police officers or soldiers, that are assigned to monitor a specific geographic area.", "The police are a constituted body of persons empowered by a state to enforce the law, protect property, and limit civil disorder.", "a group of police officers and their horses are standing together.", "The police are a constituted body of persons empowered by a state to enforce the law, protect property, and limit civil disorder. Their powers include the power of arrest and the legitimized use of force.", "These people are participating in a parade.", "The people in the picture are participating in a parade.", "The people are participating in a parade.", "They are participating in a parade.", "A patrol is commonly a group of personnel, such as law enforcement officers or military personnel, that are assigned to monitor a specific geographic area.", "A parade is a procession of people, usually organized along a street, often in costume, and often accompanied by marching bands, floats or sometimes large balloons.", "The police are patrolling the city.", "Polo is a horseback mounted team sport.", "The police officers are wearing reflective vests.", "Polo.", "The people are horse riding.", "A horse show is a judged exhibition of horses and ponies. Many different horse breeds and equestrian disciplines hold competitions worldwide, from local to the international levels."]