["The dish is made by boiling the pasta.", "The pasta dish is made by boiling the water and adding the pasta.", "The dish is made by boiling pasta in water.", "The pasta is boiled and the sauce is cooked on the pan.", "Cooking pasta is a simple process, but it must be done correctly.", "The dish is made with a pasta machine.", "You can make pasta by cooking the pasta in boiling water.", "This is a pasta dish.", "You make pasta by boiling noodles made out of flour.", "Cook pasta according to package directions.", "You can make this dish by boiling the pasta and cooking the toppings.", "Pasta is a type of food that is made from flour and water. It can be cooked in many different ways.", "The pasta is made from flour and water.", "Pasta is made by kneading together flour and water.", "The pasta is made of flour, water and eggs.", "The pasta is heated and then eaten with any sauce of your choice.", "pasta is made by using a pasta machine or by rolling it out with a rolling pin.", "You stir the pasta.", "Pasta is a staple food of traditional Italian cuisine.", "pasta is a staple food of traditional Italian cuisine.", "The first step to making pasta is to mix the flour and salt in a large mixing bowl and make a well in the middle. Crack the eggs into the well and beat them with a fork to combine.", "In a large pot of boiling salted water, cook pasta according to package instructions. Drain well.", "A pasta dish is a dish that is made up of pasta, which is a type of noodle.", "Pasta is a staple food of traditional Italian cuisine, with the first reference dating to 1154 in Sicily. It is also commonly used to refer to the variety of pasta dishes.", "I cooked the pasta, then I added the sauce.", "Cook the pasta in boiling water with salt until al dente. Drain the pasta, reserving half a cup of the cooking water. Return the pasta to the pan and toss with the sauce, adding a little of the reserved cooking water to loosen, if needed.", "Pasta is a staple food of traditional Italian cuisine, with the first reference dating to 1154 in Sicily.", "Pasta is a staple food of Italian cuisine, with the first reference dating to 1154 in Sicily.", "Add the pasta and cook, stirring occasionally, until al dente, about 9 minutes. Drain, reserving 1/2 cup of the cooking water.", "Cook the pasta in a large pot of boiling salted water until tender but still firm to the bite, stirring occasionally, about 8 minutes. Drain pasta and return to pot.", "Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles. Cook the noodles", "Cooking is the process of preparing food by applying heat.", "Cooking or cookery is the art, technology and craft of preparing food for consumption."]