["Mexican food is prepared in Mexico and the United States.", "Mexican food is prepared in Mexico.", "Mexican food is the food of Mexico. It is a blend of Amerindian and Spanish foods with influences from many other parts of the world, including China, Italy, France, Portugal, and the Middle East.", "Mexico is a country in Latin America.", "Mexican food is popular in Mexico, the United States and Canada.", "Mexico is a country in North America.", "Mexican food is a type of food that originated in Mexico, and has since spread worldwide.", "Mexico is a country located in North America.", "Mexican cuisine is primarily a fusion of indigenous Mesoamerican cooking with European, especially Spanish, elements added after the Spanish conquest of the Aztec Empire in the 16th century.", "Mexican food is a cuisine of the Americas, with Mexican-American versions of the cuisine being the most popular in the United States.", "The food is Mexican.", "Mexico is a country of many traditions. It is a country where people love to celebrate and enjoy life. This is reflected in the food of Mexico, which is full of color, flavor, and spice.", "The cuisine of Mexico has evolved over the centuries from a blend of indigenous Mesoamerican cooking with European, especially Spanish, elements added after the Spanish conquest of the Aztec Empire in the 16th century.", "Mexico", "Mexico is a country between the U.S. and Central America that's known for its Pacific and Gulf of Mexico beaches and its diverse landscape of mountains, deserts and jungles. Ancient ruins such as Teotihuacán and the Mayan city of Chichén Itzá are scattered throughout the country, as are Spanish colonial-era towns.", "Mexico, officially the United Mexican States, is a federal republic in the southern half of North America.", "In Mexico, a chili sauce is a sauce made from chili peppers.", "This dish is Mexican.", "You would prepare this kind of ethnic food in Mexico.", "The cuisine of Mexico has a long history. The original staples are native foods, such as corn, beans, squash, tomatoes, chili peppers, avocado, papaya, guava, pineapple, mamey, agave, turkey, and vanilla.", "Mexico, officially the United Mexican States, is a federal republic in North America.", "Mexico is a federal republic in the southern half of North America.", "Mexico, Peru, and Chile.", "In countries like Mexico, Spain, Peru and Brazil, you would prepare this kind of ethnic food.", "Mexico, the United States, Guatemala, Honduras, El Salvador, Nicaragua, Costa Rica, Belize, Colombia, Venezuela, Brazil, Argentina, Chile, and Peru.", "Mexican cuisine began about 9,000 years ago, when agricultural communities such as the Maya formed, domesticating maize, creating the standard process of corn nixtamalization, and establishing their foodways.", "Mexico, United States, and many other countries.", "Mexico, Canada, United States, and other countries.", "Mexico, Argentina, Brazil, Chile, Peru, Colombia, Venezuela, Uruguay, Ecuador", "Chili con carne, commonly known in American English as simply \"chili\", is a spicy stew containing chili peppers, meat (usually beef), tomatoes and often beans.", "Chilli con carne, meaning 'chili with meat' and sometimes known as simply 'chili' is a spicy stew containing chili peppers, meat (usually beef), and often tomatoes and beans.", "Tex-Mex is a term describing a fusion of United States cuisine and Mexican cuisine, deriving from the culinary creations of Tejanos.", "Chile is a country in South America."]