["The surface of this tennis court was colored by painting it with blue paint.", "The surface of a tennis court is colored blue.", "The surface of this tennis court was colored blue.", "The surface of a tennis court is painted blue.", "the surface of this tennis court is blue.", "The tennis court is painted with a blue surface.", "The surface of this tennis court is painted blue.", "The surface of the tennis court was painted blue.", "The blue tennis court is colored by a process called dyeing.", "The surface of this tennis court is colored blue.", "The surface of the tennis court is painted blue.", "The tennis court was painted blue.", "The tennis court surface is blue.", "The tennis court surface is colored blue with white lines.", "The tennis court is painted blue.", "The color of a tennis court comes from the paint that is used to coat the surface.", "The color of the tennis court is blue.", "The tennis court was colored blue.", "The surface of a tennis court is colored green.", "The surface of a tennis court is covered with a colored powder.", "The tennis court is blue.", "Tennis courts are typically marked with a color that is easy to see.", "The surface of a tennis court is made of clay.", "The court surface is blue.", "The surface of the court is painted blue.", "The tennis court is blue because the tennis court is blue.", "The traditional color of tennis courts is green.", "Tennis courts are usually marked out by chalk or paint.", "A tennis court is the venue where the sport of tennis is played. It is a firm rectangular surface with a low net stretched across the center.", "Grass, clay, and hard courts are all different surfaces that are used to play tennis.", "A tennis court is the venue where the sport of tennis is played. It is a firm rectangular surface with a low net stretched across the center. The same surface can be used to play both doubles and singles matches.", "A tennis court is the venue where the sport of tennis is played.", "Tennis court surfaces may be clay, grass, carpet, or hard.", "Tennis courts are marked with lines that are painted or made from tape.", "The surface of a tennis court is made of a material called asphalt, which is a combination of tar and sand.", "The court surface may be clay or grass.", "The court surface may be of grass, clay, concrete, or wood.", "The court surface may be clay, hard, grass, or synthetic.", "Tennis is a racket sport that can be played individually against a single opponent (singles) or between two teams of two players each (doubles).", "It was painted blue.", "The blue clay courts at the Monte Carlo Country Club in Monaco.", "The court is 78 feet (23.77 m) long, and its width is 27 feet (8.23 m) for singles matches and 36 feet (10.97 m) for doubles matches.", "The color blue is one of the three primary colors of pigments in painting and traditional color theory, as well as in the RGB color model. It lies between violet and green on the spectrum of visible light."]