["There are many different kinds of fruits.", "Apple is a fruit.", "Apples are one of the most cultivated tree fruits.", "Apples are one of the most widely cultivated tree fruits.", "Apples are the most common type of fruit.", "There are more apples than bananas.", "Apples are the most widely cultivated tree fruit.", "There are more apples than bananas in the bowl.", "Apples are the most common type of fruit in the bowl.", "There are more bananas than apples.", "Apples are the most common fruit.", "Apples are the most common fruit in the bowl.", "Apples are a type of fruit that are grown on trees.", "Apples are a type of fruit that grows on trees.", "The most common type of fruit in the bowl is apple.", "Apples are a pome fruit, generally sweeter and juicier than most other fruits.", "Apples are the most popular fruit in the world.", "The type of fruit that is most abundant in this bowl is apples.", "The apple is a sweet, edible fruit produced by an apple tree.", "There are apples in the bowl.", "An apple is a sweet, edible fruit produced by an apple tree.", "There are at least 4 apples, 2 bananas, and 2 pears.", "Bananas are the most common type of fruit in the bowl.", "There are 2 apples and 2 bananas.", "Bananas are the most common fruit in the bowl.", "Apple is a sweet, edible fruit produced by an apple tree. Apple trees are cultivated worldwide, and are the most widely grown species in the genus Malus.", "An apple is a sweet, edible fruit produced by an apple tree (Malus domestica). Apple trees are cultivated worldwide and are the most widely grown species in the genus Malus. The tree originated in Central Asia, where its wild ancestor, Malus sieversii, is still found today.", "Apples are a type of fruit that can be eaten raw or cooked. They are an excellent source of vitamin C and fiber.", "An apple is a sweet, edible fruit produced by an apple tree (Malus pumila). Apple trees are cultivated worldwide and are the most widely grown species in the genus Malus. The tree originated in Central Asia, where its wild ancestor, Malus sieversii, is still found today. Apples have been grown for thousands of years in Asia and Europe and were brought to North America by European colonists. Apples have religious and mythological significance in many cultures, including Norse, Greek and European Christian traditions.", "Bananas are one of the most popular fruits in the world.", "The apple is a pome fruit, generally occurring in many different species, varieties and cultivars, which are the result of the domestication of the wild apple Malus sieversii.", "The fruit is the ripened ovary—together with seeds—of a flowering plant. In botany, a fruit is the seed-bearing structure in flowering plants (also known as angiosperms) formed from the ovary after flowering.", "Fruits are the ripened ovaries of plants, including the seeds within.", "Bananas are an edible fruit – botanically a berry – produced by several kinds of large herbaceous flowering plants in the genus Musa.", "A banana is an edible fruit – botanically a berry – produced by several kinds of large herbaceous flowering plants in the genus Musa.", "A banana is an elongated, edible fruit – botanically a berry – produced by several kinds of large herbaceous flowering plants in the genus Musa. In some countries, bananas used for cooking may be called plantains, distinguishing them from dessert bananas.", "A fruit is the seed-bearing structure in flowering plants (also known as angiosperms) formed from the ovary after flowering.", "A bowl of fresh fruits on a table.", "Fruit is the seed-bearing structure in flowering plants formed from the ovary after flowering.", "Bananas are an excellent source of potassium. One medium-sized banana contains 422 milligrams of potassium, which is 12 percent of the recommended daily value."]