["The cabinet is made of wood.", "The cabinets are made of pine wood.", "Cabinets are made of wood.", "The wood used in cabinets is usually a hardwood such as ash, beech, birch, cherry, hickory, maple, oak, or walnut.", "The cabinets are made of wood.", "the cabinets are made of wood.", "cabinets are usually made of wood.", "The cabinets are made from oak wood.", "The cabinets are made of oak.", "Cabinets are typically made of wood or, now increasingly, of synthetic materials.", "Cabinets are made from many different types of wood, including oak, maple, and cherry.", "Cabinets are made of wood, plastic, or metal.", "Cabinets are made from a variety of materials, including wood, metal, and plastic.", "Cabinets are typically made of wood (solid or with veneers or artificial surfaces), coated steel (common for medicine cabinets), or synthetic materials.", "Cabinets are usually made of wood (solid or with veneers or artificial surfaces), coated steel (common for medicine cabinets), or synthetic materials.", "Cabinets are made of plastic.", "Cabinets are made of wood or, now increasingly, of synthetic materials. Commercial grade cabinets, which differ in the materials used, are called casework.", "A cabinet is a box-shaped piece of furniture with doors and/or drawers for storing miscellaneous items. Some cabinets stand alone while others are built in to a wall or are attached to it like a medicine cabinet. Cabinets are typically made of wood (solid or with veneers or artificial surfaces), coated steel (common for medicine cabinets), or synthetic materials.", "Kitchen cabinets are the built-in furniture installed in many kitchens for storage of food, cooking equipment, and often silverware and dishes for table service.", "A cabinet is a box-shaped piece of furniture with doors and/or drawers for storing miscellaneous items. Some cabinets stand alone while others are built in to a wall or are attached to it like a medicine cabinet.", "Oak is a durable wood, especially suitable for furniture.", "They are made of oak.", "Wood is a porous and fibrous structural tissue found in the stems and roots of trees and other woody plants. It is an organic material, a natural composite of cellulose fibers that are strong in tension and embedded in a matrix of lignin that resists compression.", "Wood is a porous and fibrous structural tissue found in the stems and roots of trees and other woody plants.", "Wood is a porous and fibrous structural tissue found in the stems and roots of trees and other woody plants. It is an organic material, a natural composite of cellulose fibers that are strong in tension and embedded in a matrix of lignin that resists compression. Wood is sometimes defined as only the secondary xylem in the stems of trees, or it is defined more broadly to include the same type of tissue elsewhere such as in the roots of trees or shrubs. In a living tree it performs a support function, enabling woody plants to grow large or to stand up by themselves. It also conveys water and nutrients"]