["The time of day is determined by the position of the Sun in the sky.", "The time of day is sunset.", "Daytime is the period of time when the sun is above the horizon.", "The time of day is the time of day when the sun is at its highest point in the sky.", "In the beginning of the day the sun rises, and in the evening it sets.", "The sun is in the sky, so it must be daytime.", "The time of day is afternoon.", "The sun is out.", "The sun is setting.", "It is evening.", "It is sunset.", "It is a sunset.", "sunset is the daily disappearance of the Sun below the horizon due to Earth’s rotation.", "Sunset, also known as sundown, is the daily disappearance of the Sun below the horizon as a result of Earth's rotation.", "It is the afternoon.", "Sunrise occurs when the upper limb of the Sun appears on the horizon in the morning. The Sun rises in the east and sets in the west.", "It is dusk.", "It is night time.", "Daylight is the combination of all direct and indirect sunlight during the daytime.", "Sunset is the moment at which the upper limb of the Sun disappears below the horizon in the west.", "The street is illuminated by the setting sun.", "It is always daytime in the summer.", "The sun rises in the east and sets in the west.", "The time of day is the part of the day spent in standard time, and depends on the location and varies throughout the year.", "The day is the period of time during which the Earth completes one rotation around its axis.", "It is morning.", "the time of day is 1:00pm.", "Day is the period of time during which the Earth completes one rotation around its axis.", "The time of day is a point or period in the day when an event or action occurs.", "It's morning.", "It is a road leading to the bus in the sunlight.", "Sunrise and sunset times are computed using astronomical formulas from the book, Astronomical Algorithms 2nd Edition, by Jean Meeus.", "The sun is the star at the center of the Solar System.", "It is 5pm.", "The sun rises in the east and sets in the west. The sun rises in the east and sets in the west. The sun rises in the east and sets in the west. The sun rises in the east and sets in the west. The sun rises in the east and sets in the west. The sun rises in the east and sets in the west. The sun rises in the east and sets in the west. The sun rises in the east and sets in the west. The sun rises in the east and sets in the west. The sun rises in the east and sets in the west. The sun rises in the east and", "Sunlight is a portion of the electromagnetic radiation given off by the Sun, in particular infrared, visible, and ultraviolet light.", "Daylight saving time (DST) is the practice of advancing clocks during summer months by one hour so that in the evening hours day light is experienced later, while sacrificing normal sunrise times.", "A street light is a raised source of light on the edge of a road, which is turned on or lit at a certain time every night.", "The bus is a road vehicle designed to carry many passengers.", "The sun is a G-type main-sequence star that comprises about 99.86% of the mass of the Solar System.", "It is the end of the day."]