["Airlines provide air transportation for passengers and freight.", "Airlines use aircraft to provide passenger and cargo air transport services.", "Air travel.", "Airlines use airplanes to transport passengers.", "Airlines travel by air.", "Air travel", "Air travel is a form of travel in vehicles such as helicopters, hot air balloons, blimps, gliders, hang gliding, parachuting, airplanes, jets, or anything else that can sustain flight.", "Air travel is a form of travel in vehicles such as airplanes, helicopters, hot air balloons, blimps, gliders, hang gliding, parachuting, airplanes, helicopters, and hot air balloons.", "airplane", "Air transport is the most recent mode of transport. It is the transport of people, animals and goods from one location to another via aircraft.", "Air travel is the most common form of travel.", "Travelers can travel by air, land, or sea.", "Airlines", "Airlines.", "Air travel is the most convenient way to travel long distances.", "Airplane.", "An airport is an aerodrome with extended facilities, mostly for commercial air transport. Airports often have facilities to store and maintain aircraft, and a control tower.", "People travel by plane, train, bus, car, boat, or other means of transportation.", "She is waiting for a plane.", "Airport is an aerodrome with extended facilities, mostly for commercial air transport. Airports often have facilities to store and maintain aircraft, and a control tower.", "An airport is an aerodrome with extended facilities, mostly for commercial air transport.", "Air travel is the safest form of travel.", "Airport terminal is a building at an airport where passengers transfer between ground transportation and the facilities that allow them to board and disembark from aircraft.", "Airport is an aerodrome with extended facilities, mostly for commercial air transport.", "The girl in the picture is waiting for an airplane.", "The girl is waiting for a plane to take her to her destination.", "The girl is waiting for a plane.", "Airport, aerodrome, airfield, or airfield, is a location where aircraft such as fixed-wing aircraft, helicopters, and blimps take off and land.", "A plane is a fixed-wing aircraft, propelled forward by thrust from a jet engine or propeller.", "In the context of transport, a terminal is a facility where passengers transfer between different transport vehicles, for example between trains and buses.", "A mode of transport is a solution that makes use of a particular type of vehicle, infrastructure, and operation."]