["The ground the horses are riding on is sand.", "A beach is a landform alongside a body of water which consists of loose particles. The particles composing a beach are typically made from rock, such as sand, gravel, shingle, pebbles.", "Beach sand is a loose, granular material that accumulates on the shoreline of a body of water.", "The type of ground the horses are riding on is sand.", "Beach is a landform alongside a body of water which consists of loose particles. The particles composing a beach are typically made from rock, such as sand, gravel, shingle, pebbles.", "The ground is sand.", "The ground is called \"Sand\".", "The sand is the ground that the horses are riding on.", "A beach is a landform alongside a body of water which consists of loose particles.", "Beach sand is sand that is found on beaches, and along the coast.", "Beach sand is a loose, granular sediment that accumulates along the sea-shore. It is also called strand.", "Beach is a landform alongside a body of water which consists of loose particles.", "The beach is a landform alongside a body of water which consists of loose particles.", "Horses are ridden on a beach.", "The horses are riding on sand.", "A beach is a landform along the shoreline of an ocean or sea.", "Sand is a granular material composed of finely divided rock and mineral particles. It is defined by size, being finer than gravel and coarser than silt.", "Horses can walk on sand.", "The ground is made of sand.", "sand", "Sand is a granular material composed of finely divided rock and mineral particles.", "sand is a naturally occurring granular material composed of finely divided rock and mineral particles.", "Sand is a naturally occurring granular material composed of finely divided rock and mineral particles.", "horseback riding is a popular activity on beaches.", "The horse is on the beach.", "A beach is a landform along the coast of an ocean, sea, lake, or river.", "The horses are riding on the sand of a beach.", "The horses are riding on a beach.", "Beach", "Horseback riding is riding on the back of a horse.", "The shore is the fringe of land at the edge of a large body of water, such as an ocean, sea, or lake. In physical oceanography, a shore is the wider fringe that is geologically modified by the action of the body of water past and present, while the beach is at the edge of the shore, representing the intertidal zone where there is one.", "Horses can be found in mountains, grasslands, forests, swamps, deserts and other areas.", "The horse is a herbivore.", "The ground is the solid surface of the Earth."]