["A bird is an animal.", "A bird is an animal that has feathers and wings.", "A bird is an animal with feathers.", "Bird is a warm-blooded vertebrate distinguished by the possession of feathers, wings, a beak, and typically by being able to fly.", "A bird is a feathered, winged, bipedal, warm-blooded, egg-laying, vertebrate.", "A bird is a warm-blooded egg-laying vertebrate distinguished by the possession of feathers, wings, and a beak and (typically) by being able to fly.", "A bird is a feathered, winged, two-legged, warm-blooded, egg-laying vertebrate.", "A bird is an animal with wings that can fly.", "Birds are animals that have wings and feathers.", "The bird is in a state of rest and relaxation.", "The bird is eating.", "The bird is standing in the water.", "The bird is drinking.", "Birds do many things, such as fly, eat, sleep, drink and sing.", "The bird is drinking water.", "the bird is drinking water.", "The bird is standing.", "Birds are a group of endothermic vertebrates, characterised by feathers, toothless beaked jaws, the laying of hard-shelled eggs, a high metabolic rate, a four-chambered heart, and a strong yet lightweight skeleton.", "The bird is standing on the ground.", "Birds are a group of warm-blooded vertebrates constituting the class Aves, characterized by feathers, toothless beaked jaws, the laying of hard-shelled eggs, a high metabolic rate, a four-chambered heart, and a strong yet lightweight skeleton.", "Birds are a group of warm-blooded vertebrates constituting the class Aves, characterised by feathers, toothless beaked jaws, the laying of hard-shelled eggs, a high metabolic rate, a four-chambered heart, and a strong yet lightweight skeleton.", "Birds, also known as Aves, are a group of endothermic vertebrates, characterised by feathers, toothless beaked jaws, the laying of hard-shelled eggs, a high metabolic rate, a four-chambered heart, and a strong yet lightweight skeleton.", "A bird bath is a birdbath, a small shallow artificial pool of water provided for drinking and bathing by birds.", "The bird is standing in the grass.", "the bird is standing in the grass", "The birds are drinking water.", "The bird is drinking water from a pond."]