["The person on the left is winning.", "The man with the wii remote is winning.", "Wii is a video game console made by Nintendo.", "The Nintendo Wii is a home video game console released by Nintendo on November 19, 2006. As a seventh-generation console, the Wii competed with Microsoft's Xbox 360 and Sony's PlayStation 3.", "The man on the left is winning.", "the man on the left is winning", "The man on the right is winning.", "The man in the left is winning.", "The man holding the wii controller is winning.", "The Wii is a home video game console released by Nintendo on November 19, 2006. As a seventh-generation console, the Wii competed with Microsoft's Xbox 360 and Sony's PlayStation 3. Nintendo states that its console targets a broader demographic than that of the two others.", "The Wii is a home video game console released by Nintendo on November 19, 2006. As a seventh-generation console, the Wii competed with Microsoft's Xbox 360 and Sony's PlayStation 3.", "Wii is a home video game console released by Nintendo on November 19, 2006. As a seventh-generation console, the Wii competed with Microsoft's Xbox 360 and Sony's PlayStation 3.", "The Wii Remote is a remote controller used by the Wii console.", "The person who is laughing is winning.", "The man on the left is winning because he is smiling.", "The man on the right is winning because he is smiling.", "The Wii Remote, also known colloquially as the Wiimote, is the primary game controller for Nintendo's Wii home video game console. An essential capability of the Wii Remote is its motion sensing capability, which allows the user to interact with and manipulate items on screen via gesture recognition and pointing, using accelerometer and optical sensor technology.", "The Wii Remote, also known colloquially as the Wiimote, is the primary controller for Nintendo's Wii console.", "The game is played by holding the Wii Remote horizontally.", "In this game, the Wii Remote is held sideways, much like an NES controller.", "The man on the left is holding the Wii Remote.", "The man on the left is holding the wii remote.", "The Nintendo Wii is a home video game console released by Nintendo on November 19, 2006.", "The guy in the red shirt is winning.", "The person who is laughing is the one winning.", "The man with the black shirt is winning.", "The Wii is a home video game console released by Nintendo on November 19, 2006.", "The Wii was a seventh generation video game console released by Nintendo on November 19, 2006.", "The man in the white shirt is winning.", "The person with the red shirt is winning.", "A person who is laughing is usually winning.", "The person who is winning is the one with the most points.", "The person who is winning is the one who has the most points.", "Nintendo is a Japanese multinational consumer electronics and video game company headquartered in Kyoto. Nintendo is one of the world's largest video game companies by market capitalization, creating some of the best-known and top-selling video game franchises, such as Mario, The Legend of Zelda, and Pokémon.", "If one person is laughing, they may be winning.", "Nintendo is a Japanese multinational consumer electronics and video game company headquartered in Kyoto.", "Nintendo Co., Ltd. is a Japanese multinational consumer electronics and video game company headquartered in Kyoto.", "The man who is holding the remote.", "The person with the most points."]