["A waterboard is a board that is used for water sports, such as surfing and skimboarding.", "A water ski is a long and narrow buoyant board that a person rides on top of the water while being pulled by a motorboat.", "Kiteboarding is a surface water sport combining aspects of wakeboarding, snowboarding, windsurfing, surfing, paragliding, skateboarding and sailing into one extreme sport. A kiteboarder harnesses the power of the wind with a large controllable power kite to be propelled across the water, land, or snow.", "A kiteboard is a board with foot-straps or bindings that attaches to the rider's feet, combined with the kite's power.", "A kiteboard is a board with foot-straps or bindings, combined with the kite's flying lines.", "The board is a water ski board.", "A kiteboard is a board with foot-straps or bindings, combined with the power of a kite.", "A kiteboard is a board with foot-straps or bindings, combined with the kite's power.", "A kiteboard is a board with foot-straps or bindings attached to a kiteboard.", "A kiteboard is a board with or without foot-straps or bindings, combined with the kite's flying lines and handles.", "A kiteboard is a board with foot-straps or bindings, attached to a kite.", "A kiteboard is a board with foot straps or bindings, attached to a kite.", "The water ski is a board that is used for water skiing.", "A kiteboard is a board with foot-straps or bindings, combined with the kite having four lines and handles.", "A kite board is a board with or without foot-straps or bindings, combined with the kite.", "Kiteboarding is an action sport combining aspects of wakeboarding, snowboarding, windsurfing, surfing, paragliding, skateboarding and sailing into one extreme sport. A kiteboarder harnesses the power of the wind with a large controllable power kite to be propelled across the water, land, or snow.", "A waterskiing board is a board.", "Kiteboarding is an action sport combining aspects of wakeboarding, snowboarding, windsurfing, surfing, paragliding, skateboarding and sailing into one extreme sport.", "A water ski is a long, narrow board that is used to glide across the surface of the water.", "A water ski is a long, narrow board that is used for water skiing.", "Kiteboarding, also known as kitesurfing, is an action sport combining aspects of wakeboarding, snowboarding, windsurfing, surfing, paragliding, skateboarding and sailing into one extreme sport.", "A kiteboarder or kitesurfer is a person who rides a kiteboard on water.", "A surfboard is an elongated platform used in surfing. Surfboards are relatively light, but are strong enough to support an individual standing on them while riding an ocean wave.", "A waterski is a type of board that is used to ski on water.", "Kitesurfers use a board with or without foot-straps or bindings.", "Kitesurfing is a sport that uses a kite and a board to ride the wind and waves.", "The board is a surfboard.", "Wakeboarding is a surface water sport which involves riding a wakeboard over the surface of a body of water.", "A waterskiing board is a slalom ski.", "A surfboard is an elongated platform used in the sport of surfing.", "Kitesurfing is a surface water sport combining aspects of wakeboarding, snowboarding, windsurfing, surfing, paragliding, skateboarding and sailing into one extreme sport.", "Waterskiing is a surface water sport in which an individual is pulled behind a boat or a cable ski installation over a body of water, skimming the surface on two skis or one ski.", "A surfboard is an elongated platform used in surfing.", "A water kite is a kite that is designed to be used on water.", "A board is a long flat piece of wood.", "A water skier is being pulled by a boat on a water ski board.", "The person is waterskiing on a water board.", "A person waterskiing on a wakeboard.", "A wakeboard is a small, thin board with fins attached to the bottom.", "A wakeboard is a small, mostly rectangular, thin board with very little displacement and shoe-like bindings mounted to it.", "A water skier is towed behind a boat at a speed of 19–24 miles per hour (31–39 km/h)."]