["The television is powered by electricity.", "Television is powered by electricity.", "The power source for a television is electricity.", "Televisions are usually powered by electricity.", "Televisions are powered by electricity.", "Televisions are run by electricity.", "Televisions usually run on electricity.", "The TV is powered by electricity.", "Most of the energy used by a TV is electrical energy.", "TVs use electricity.", "TVs use electricity to run.", "Television, or TV, is a telecommunication medium used for transmitting moving images in monochrome (black-and-white), or in colour, and in two or three dimensions and sound.", "The television is a home appliance that allows people to watch television shows and movies.", "Televisions run on electricity.", "Television (TV) is a telecommunication medium used for transmitting moving images in monochrome (black and white), or in colour, and in two or three dimensions and sound.", "Television (TV) is a telecommunication medium used for transmitting moving images in monochrome (black-and-white), or in colour, and in two or three dimensions and sound. The term can refer to a television set, a television program (\"TV show\"), or the medium of television transmission.", "A television is a machine with a screen. Television receives images and sound through a cable, antenna, or satellite dish.", "Televisions receive broadcast signals and convert them into pictures and sound for viewing.", "Television is a telecommunication medium used for transmitting moving images in monochrome (black and white), or in colour, and in two or three dimensions and sound.", "The flat screen televisions are run on electricity.", "Televisions are often powered by AC mains electricity.", "The energy source of the appliance is electricity.", "The energy source for the appliance is electricity.", "The television set is a device that combines a tuner, display, and loudspeakers for the purpose of viewing television.", "A television set, also called a television receiver, television, TV set, TV, or \"telly\", is a device that combines a tuner, display, and loudspeakers for the purpose of viewing television.", "The appliance runs on electricity.", "A television set, also called a television receiver, television, TV set, TV, or telly, is a device that combines a tuner, display, and loudspeakers for the purpose of viewing television.", "A television set or television receiver, more commonly called a television, TV, TV set, or telly, is a device that combines a tuner, display, and loudspeakers for the purpose of viewing television.", "The power consumption of a television varies widely based on the technology used, manufacturer, size, and the technology used.", "Electricity is a form of energy that comes from electric charges.", "The energy source in the image is electricity.", "A television set or television receiver, more commonly called a television, television set, TV, TV set, or telly, is a device that combines a tuner, display, and loudspeakers for the purpose of viewing television.", "A television (TV), commonly referred to as telvision, telly or tele, is a telecommunication medium used for transmitting moving images in monochrome (black-and-white), or in colour, and in two or three dimensions and sound.", "A television set, more commonly called a television, TV, TV set, or telly, is a device that combines a tuner, display, and loudspeakers for the purpose of viewing television.", "electricity or electrical energy is the set of physical phenomena associated with the presence and motion of electric charge.", "Electrical energy is the energy newly derived from electric potential energy or kinetic energy. When loosely used to describe energy absorbed or delivered by an electrical circuit electrical energy talks about energy which has been converted from electric potential energy.", "Electricity is the set of physical phenomena associated with the presence and motion of electric charge.", "An appliance is a machine, especially one powered by electricity, used in the home or for domestic purposes.", "An electric current is a flow of electric charge. In electric circuits this charge is often carried by moving electrons in a wire. It can also be carried by ions in an electrolyte, or by both ions and electrons such as in an ionised gas (plasma)."]