["Dogs and cats are both domesticated animals, but their relationship is not always harmonious.", "Dogs are known for not getting along with cats.", "dogs are known for not getting along with cats.", "Dogs and cats are known for not getting along.", "Cats and dogs are known for not getting along.", "Dogs and cats are known for not getting along with each other.", "Cats and dogs are pets that are known for not getting along.", "Dogs and cats usually do not get along.", "Dogs are not known to get along with cats.", "Dogs and cats are known to not get along.", "Cats and dogs are known to not get along.", "Cats are known for not getting along with dogs.", "Dogs do not usually get along with cats.", "Dogs and cats don't get along.", "Dogs are not always friendly with other dogs.", "Cats and dogs are known to not get along with each other.", "Cats and dogs are known not to get along.", "Dogs do not get along with cats.", "Dogs and cats do not get along with each other.", "Cats and dogs are not known for getting along.", "The animals are known for not getting along with cats.", "Cats and dogs are often not compatible.", "Cats and dogs are natural enemies.", "Cats and dogs have been enemies for a long time.", "Cats and dogs are mortal enemies, right? Not necessarily. It depends on the individual animals and how they were raised.", "Dogs have been known to get aggressive with cats.", "A dog is a type of domesticated animal. Known for its loyalty and faithfulness, it can be found as a welcome guest in many households across the world.", "Dogs are carnivorous mammals of the family Canidae that are often bred and kept as house pets. Their long association with humans has led dogs to be uniquely attuned to human behavior and they can thrive on a starch-rich diet that would be inadequate for other canids.", "Dogs are a man's best friend.", "The domestic dog is a member of the genus Canis, which forms part of the wolf-like canids, and is the most widely abundant terrestrial carnivore.", "The domestic dog is a domesticated canid which has been selectively bred for millennia for various behaviors, sensory capabilities, and physical attributes.", "The domestic dog is a canid that is known to be a subspecies of the gray wolf.", "The domestic dog is a subspecies of the grey wolf.", "Dogs are known for their loyalty and devotion to their owners, but they are also known for their intelligence.", "Dogs are a common source of food for large carnivores such as wolves, bears, and big cats, and some dogs are used in the food industry as scavengers.", "Dogs are commonly used for search and rescue.", "The domestic cat is a small, typically furry, carnivorous mammal."]