["The horse is a breed of horse.", "The breed of horse is a Thoroughbred.", "There are many breeds of horse.", "The breed of horse is called a Thoroughbred.", "The horse breed is the Thoroughbred breed.", "The horse is a thoroughbred horse.", "The horse is a thoroughbred.", "The horse is a Thoroughbred.", "A horse is an equine.", "The horse is an Arabian horse. The Arabian or Arab horse is a breed of horse that originated on the Arabian Peninsula. With a distinctive head shape and high tail carriage, the Arabian is one of the most easily recognizable horse breeds in the world.", "The horse is a Percheron horse. The Percheron is a breed of draft horse that originated in the Huisne river valley in western France, part of the former Perche province from which the breed takes its name.", "The horse is a breed of horse known as a quarter horse.", "The breed of horse is called a Quarter horse.", "A horse.", "A horse is a hoofed mammal, a subspecies of the family Equidae.", "A horse is any of several species of large, hoofed mammals of the family Equidae.", "The breed of horse is quarter horse.", "The Thoroughbred is a horse breed best known for its use in horse racing.", "The Arabian horse is a breed of horse that originated on the Arabian Peninsula. With a distinctive head shape and high tail carriage, the Arabian is one of the most easily recognizable horse breeds in the world. It is also one of the oldest breeds, with archaeological evidence of horses in the Middle East that resemble modern Arabians dating back 4,500 years.", "A horse is a hoofed mammal of the species Equus ferus caballus.", "A horse is one of two extant subspecies of Equus ferus. It is an odd-toed ungulate mammal belonging to the taxonomic family Equidae. The horse has evolved over the past 45 to 55 million years from a small multi-toed creature, Eohippus, into the large, single-toed animal of today. Humans began to domesticate horses around 4000 BC, and their domestication is believed to have been widespread by 3000 BC.", "The Arabian horse is a breed of horse that originated on the Arabian Peninsula. With a distinctive head shape and high tail carriage, the Arabian is one of the most easily recognizable horse breeds in the world.", "A horse is a hoofed mammal.", "A horse is a large hoofed animal used for riding and racing.", "The horse is a quarter horse.", "It is a quarter horse.", "The breed of horse is a palomino.", "There are over 300 different breeds of horses.", "A horse is a mammal with two legs that is used for riding.", "The horse is a white horse.", "The Arabian horse is a breed of horse that originated on the Arabian Peninsula.", "The horse is a breed of domesticated equus ferus caballus.", "Horses are mammals of the family Equidae.", "The Arabian or Arab horse is a breed of horse that originated on the Arabian Peninsula. With a distinctive head shape and high tail carriage, the Arabian is one of the most easily recognizable horse breeds in the world.", "There are more than 300 horse breeds in the world today.", "The Arabian or Arab horse is a breed of horse that originated on the Arabian Peninsula.", "A horse is a horse, of course, of course, and no one can talk to a horse of course. That is, of course, unless the horse is the famous Mister Ed. Go right to the source and ask the horse himself.", "The American quarter horse is a breed of horse that excels at sprinting short distances.", "The Icelandic horse is a breed of horse developed in Iceland.", "The Morgan horse is one of the earliest horse breeds developed in the United States. Tracing back to the foundation sire Figure, later named Justin Morgan after his best-known owner, Morgans served many roles in 19th-century American history, being used as coach horses and for harness racing.", "The Clydesdale is a breed of draught horse derived from the farm horses of Clydesdale, Scotland, and named after that region.", "Friesian is a horse breed originating in Friesland, in the Netherlands.", "A breed is a specific group of domestic animals having homogeneous appearance (phenotype), homogeneous behavior, and/or other characteristics that distinguish it from other organisms of the same species."]