["The skateboard is a type of skateboard that is used in skateboarding.", "A skateboard is a type of sports equipment used primarily for the sport of skateboarding.", "a skateboard is a type of sports equipment used primarily for the activity of skateboarding.", "A skateboard is a type of sports equipment used primarily for the activity of skateboarding.", "The skateboard is a type of sports equipment used primarily for the sport of skateboarding.", "The skateboard is a type of sports equipment used primarily for the activity of skateboarding.", "A skateboard is a type of sports equipment or toy used primarily for the activity of skateboarding.", "Skateboards are a type of board used for skateboarding.", "A skateboard is a type of sports equipment used primarily for the activity of skateboarding. It usually consists of a specially designed maplewood board combined with a polyurethane coating used for making smoother slides and stronger durability.", "A skateboard is a type of sports equipment used primarily for the sport of skateboarding. It usually consists of a specially designed maplewood board combined with a polyurethane coating used for making smoother slides and stronger durability.", "The skateboard is a longboard skateboard.", "The skateboard is a longboard.", "A skateboard is a small piece of wood with wheels attached to it.", "Skateboards are boards where people can ride on.", "The skateboard in this picture is a longboard.", "Skateboarding is an action sport which involves riding and performing tricks using a skateboard.", "Longboard is a type of skateboard.", "Skateboard is a four-wheeled vehicle used for transport.", "Skateboards are typically made of maple plywood.", "Skateboards are made of laminated maple plywood with a polyurethane coating for smoothness and durability.", "A longboard is a type of skateboard. It is longer than a standard skateboard and has wheels that are designed for cruising, carving, and downhill racing.", "A longboard is a type of sports equipment similar to, but not the same as, a skateboard. It is often longer than a skateboard and has a wide variety of shapes.", "The skateboard is a toy.", "It is a skateboard that is made by the company Zero.", "This is a longboard."]