["The giraffe's tongue is about 45 cm (18 in) long.", "The giraffe's tongue is approximately 45 cm (18 in) long.", "The giraffe's tongue is about 45 cm (18 in) in length.", "The giraffe’s tongue is about 45 cm (18 in) long.", "A giraffe's tongue is about 45 centimeters (18 inches) long.", "The average length of a giraffe's tongue is 45 cm (18 in).", "The average length of a giraffe's tongue is around 18 inches (45cm).", "The average length of a giraffe’s tongue is 45 cm (18 in).", "The giraffe's long tongue measures about 45 centimetres (18 in) in length.", "The average length of a giraffe's tongue is around 45cm.", "The giraffe's tongue is about 45 cm long.", "A giraffe's tongue is about 18 to 20 inches long.", "The giraffe tongue is about 20–21 inches (50–53 cm) long.", "The average length of a giraffe tongue is 45 cm.", "The average length of the tongue of a giraffe is 45cm.", "The giraffe's tongue is about 18 inches long.", "The average length of a giraffe's tongue is 20 to 21 inches (50 to 53 centimeters).", "The average length of a giraffe's tongue is about 20-21 inches.", "The average length of a giraffe's tongue is about 20 inches.", "A giraffe's tongue is 45 cm long.", "The average length of a giraffe's tongue is 20-21 inches.", "The average length of a giraffe's tongue is 18 to 20 inches.", "The giraffe's tongue is about 45 cm (18 in) long and very tough.", "The average length of a giraffe's tongue is 18 inches.", "The giraffe's tongue is about 45 cm (18 in) long, and very tough.", "Giraffe's tongue is 45cm long.", "The giraffe has a tongue that is 45 centimeters long.", "Giraffe tongues are about 18 to 20 inches long.", "Giraffe tongues are about 20-21 inches long.", "The tongue of the giraffe is about 45 cm (18 in) long, and is very tough and covered with bristly papillae.", "Giraffes have tongues that are about 45 cm (18 in) long.", "Giraffes' tongues can be up to 21 inches long.", "The giraffe's tongue is about 45 cm (18 in) long and very tough because of its rubbery texture. This is an adaptation that protects the giraffe from thorns.", "Giraffes have tongues that are 45 cm long.", "The tongue is about 20 to 45 cm (8 to 18 in) long.", "The average length of the tongue of this animal is around 45cm.", "The giraffe is the tallest of all living land animals; males can be 4.8 to 5.5 metres (16 to 18 feet) tall, and the tallest recorded male was 5.88 metres (19.3 feet) tall.", "The giraffe is the tallest living land animal.", "The giraffe is a genus of African even-toed ungulate mammals, the tallest living terrestrial animals and the largest ruminants. The genus currently consists of one species, Giraffa camelopardalis, the type species.", "The tongue is a muscular organ in the mouth of most vertebrates that manipulates food for mastication, and is used in the act of swallowing. It is of importance in the digestive system and is the primary organ of taste in the gustatory system."]