["In Mexico, the sign says \"alto\" which means stop.", "In Mexico, the word stop is written on the sign.", "The word STOP is shown on the sign.", "The word \"stop\" is written on the sign.", "The word STOP on a stop sign in Mexico is PARADA.", "The word \"stop\" is shown on the sign.", "The word 'stop' is shown on the sign.", "In Mexico, the word for stop is alto.", "In Mexico, the stop sign is a white octagon with a red border and the word STOP written in black.", "The Mexican word for stop is alto.", "In Mexico, the stop sign is red with white letters.", "In Mexico, the word for stop is \"Alto\", which means \"high\" or \"tall\" in Spanish.", "The word is \"Alto\", which means stop.", "In Mexico, the stop sign is red with a white border, similar to the U.S. stop sign.", "Stop is a road sign to notify drivers that they must make sure no cars are coming and stop before proceeding.", "The word STOP on a stop sign is written in white, or black, on a red background.", "The word shown on the sign when in Mexico is ALTO.", "Stop is a word that means to stop.", "Stop signs are used in many countries, although in some places they are called \"stop\" signs.", "The word shown on the sign in Mexico is alto.", "The word \"ALTO\" is shown on the sign when in Mexico.", "Stop signs are red in Mexico.", "The stop sign is a traffic sign to notify drivers that they must stop before proceeding.", "A stop sign is a traffic sign to notify drivers that they must stop before proceeding.", "The stop sign is a traffic sign to notify drivers that they must make sure no cars are coming and stop before proceeding.", "A stop sign is a traffic sign to notify drivers that they must make sure no cars are coming and slow down before proceeding.", "A stop sign is a traffic sign to notify drivers that they must make sure no cars are coming and stop before proceeding.", "The word alto (Spanish: stop) is also used in many other Spanish-speaking countries, and in the Philippines, alto means \"slow down\".", "Stop signs are used to indicate the end of a road.", "In Mexico, the word is alto.", "Alto means stop in Mexico.", "A stop sign is an octagonal traffic sign to notify drivers that they must make sure no cars are coming and stop before proceeding.", "In the United States, stop signs are red and white.", "Alto means stop in Spanish.", "The word on the sign is \"Alto\".", "The word shown on the sign is alto.", "In Mexico, the words “ALTO” and “DETENER” are used.", "Alto is Spanish for “stop”.", "Stop means to cease moving, proceed no further, or to cause to cease moving.", "Pare is shown on stop signs in Mexico.", "ALTO", "STOP is the name of a song written by the American singer-songwriter and musician Prince. The song was released twice at different times. The first version of the song was released as a non-album single by Warner Bros. Records on February 10, 1989. The second version was included as the twelfth and final track on Prince's thirteenth album Graffiti Bridge, released on August 21, 1990.", "Pare means stop in Spanish.", "Pare means \"stop\" in Spanish.", "STOP is a three letter word which starts with S and ends with P. Below are Total 36 words made out of this word.", "The word “parada” is shown on the sign.", "Stop is the fifth studio album by American rock band Blink-182, released on November 18, 2003 by Geffen Records."]