["The source of heat is the stove.", "A stove is a place where heat is applied to food.", "The stove is usually used to heat pots.", "The pot is using a stove as a source of heat.", "The pot is using a stove as its source of heat.", "A stove is a device that cooks food by applying heat from below.", "The pot is using a stove.", "The pot is being heated by a stove.", "The heat source is the stove.", "This pot is using a gas stove for heat.", "A stove is a piece of equipment used for cooking.", "The pot is being heated on a stove.", "A stove is a device in which heat energy is converted to heat. The heat may be used to cook food or to provide warmth.", "a stove", "The pot is using a gas stove.", "The cook is using a stove.", "A stove, or cooker, is an enclosed space in which fuel is burned to heat either the space in which the stove is situated, or items placed on the heated stove.", "A cook stove is heated by burning wood or other fuel.", "A stove is a device in which heat energy is converted to heat energy by burning a fuel source.", "A stove is a device in which heat energy is produced to cook and bake.", "A stove.", "A stove is a kitchen appliance designed for the purpose of cooking food.", "The pot is on a stovetop.", "The heat source for a stove or range is a gas burner or electric heating element.", "The heat source for a stove is typically an open flame from burning a fuel or electric coils.", "A stove is an enclosed space in which fuel is burned to provide heating, either to heat the space in which the stove is situated, or to heat the stove itself and items placed on it.", "The chef is using a stove to cook the food.", "A stove is an enclosed space in which fuel is burned to heat either the space in which the stove is situated, or items placed on the heated stove.", "Stovetop cooking is cooking on the stovetop.", "The pot is using a gas source of heat.", "The pot is using gas as the source of heat.", "A stove, range, cookstove or cooker is a kitchen appliance designed for the purpose of cooking food.", "The pot is using an electric source of heat.", "Pots can be heated by induction cookers, gas burners, or electric heating elements.", "A stovetop, cooktop, or hob is a surface on a stove that generates heat for cooking.", "Cooking is the process of preparing food by applying heat.", "Cooking or cookery is the art, technology, science and craft of preparing food for consumption. Cooking techniques and ingredients vary widely across the world, from grilling food over an open fire to using electric stoves, to baking in various types of ovens, reflecting unique environmental, economic, and cultural traditions and trends.", "A pot is a container used for cooking.", "stovetop", "The cook is using a stove to cook the eggs.", "A gas stove is a stove that is fuelled by combustible gas such as syngas, natural gas, propane, butane, liquefied petroleum gas or other flammable gas.", "A pot is most commonly used for boiling water, cooking food, or as a container to hold liquids.", "A pot is a broad, medium-sized vessel that is used for cooking and storing food.", "A heat source is a device that generates heat energy.", "A heat source is a source of energy that increases the temperature of an object or a fluid.", "Heat is energy transferred from one body to another due to a difference in temperature."]