["Dancing is a form of human movement that is usually rhythmic and to music.", "Dancing is a form of art that generally involves movement of the body, often rhythmic and to music.", "dancing is a form of art that generally involves movement of the body, often rhythmic and to music.", "dance is an activity that involves moving the body to music.", "The activity is a dance.", "Dancing is a performing art form consisting of purposefully selected sequences of human movement. This movement has aesthetic and symbolic value, and is acknowledged as dance by performers and observers within a particular culture.", "A dance is a form of human expression that involves moving the body.", "The activity is dancing.", "Dance is a performing art form consisting of purposefully selected sequences of human movement. This movement has aesthetic and symbolic value, and is acknowledged as dance by performers and observers within a particular culture.", "Dance is a performing art form consisting of purposefully selected sequences of human movement.", "dance, the movement of the body in a rhythmic way, usually to music and within a given space, for the purpose of expressing an idea or emotion, releasing energy, or simply taking delight in the movement itself.", "A dance is a sequence of rhythmic steps or movements usually performed to music.", "A dance is a series of movements that match the speed and rhythm of music.", "A dance is a series of steps and movements that match the speed and rhythm of music.", "Dancing is a form of movement in which the body is moved in a rhythmic way, usually to music and within a given space.", "Dancing is a form of exercise.", "Dancing is a performing art form consisting of purposefully selected sequences of human movement.", "Dancing is a form of art.", "Dancing is a form of physical exercise that is done in a group or alone.", "They are dancing.", "Dancing is a form of performance art practiced all over the world.", "dancing", "Dancing is a form of exercise that can help you lose weight and stay fit.", "dance", "They are dancing to the music.", "People dance at a wedding.", "The man is dancing.", "They are dancing at a wedding reception.", "The activity is a wedding.", "A wedding is a ceremony where two people are united in marriage."]