["The plane is in an airport.", "The airport is an airfield.", "The place is an airport.", "This is an airport.", "The airport is a place where planes take off and land.", "This is an airport. Airports are places where airplanes take off and land.", "The airport is a place where people can take a plane to another place.", "This is the airport", "The airport is a facility for the take-off and landing of aircraft.", "An airport is an aerodrome with facilities for flights to take off and land.", "The airport is a facility for the use of aircraft, with runways, navigational aids, and major facilities for the commercial handling of passengers and cargo.", "This is at an airport.", "An airport is an area where aircraft such as fixed-wing aircraft, helicopters, and blimps take off and land.", "The airport is an airport in the United States.", "An airport is an aerodrome with extended facilities, mostly for commercial air transport. Airports often have facilities to store and maintain aircraft, and a control tower.", "This is in an airport.", "This is at the airport.", "An airport has a runway.", "Airplanes can be found at an airport.", "This is in the airport.", "This is an image of the airport.", "An airport is an aerodrome with extended facilities, mostly for commercial air transport.", "an airport is an aerodrome with extended facilities, mostly for commercial air transport.", "The scene takes place at an airport.", "Airports are aerodromes.", "The vehicle is at the airport.", "Airplanes are often found at airports.", "Airport is an aerodrome with extended facilities, mostly for commercial air transport.", "The airport is an aerodrome with extended facilities, mostly for commercial air transport.", "A plane is parked in an airport.", "The airport is located in the city of the city.", "Aircraft are parked in airports.", "The plane is parked at an airport.", "The plane is parked at the airport.", "Airports are divided into landside and airside areas. Landside areas include parking lots, public transportation train stations and access roads. Airside areas include all areas accessible to aircraft, including runways, taxiways and ramps.", "A plane is a flat surface."]