["The chair is made of bamboo.", "The chair is made from bamboo.", "The chair is made of rattan.", "Bamboo is a giant grass that grows in a reed like fashion.", "The chair is made of wicker.", "The chair is made of wood.", "If this chair is outside, it might be made from bamboo.", "Reed is a common material for a chair.", "If this chair where outside it might be made from reed.", "A wicker chair is a chair that is made from wicker, a type of material that is made from reeds and other plant fibers.", "bamboo is a type of grass.", "Rattan is a group of palm species that are native to tropical regions of Africa, Asia, and Australasia.", "Rattan (from the Malay rotan) is the name for roughly 600 species of old world climbing palms belonging to subfamily Calamoideae (from the Greek 'kálamos' = reed).", "Bamboo is a group of woody perennial evergreen plants in the true grass family Poaceae, subfamily Bambusoideae, tribe Bambuseae.", "Bamboo is a member of the grass family.", "Rattan is a type of palm.", "Rattan is a long, woody vine that grows in tropical forests. It is used to make furniture.", "Rattan is a vine found in tropical climates that can be used to make furniture.", "Rattan is the name for roughly 600 species of old world climbing palms belonging to subfamily Calamoideae (from the Greek 'kálamos' = reed). Rattan is also known as manila, or malacca, named after the ports of shipment Manila and Malacca City, and as manau (from the Malay rotan manau, the trade name for Calamus manan canes in Southeast Asia).", "If this chair was outside, it might be made from a material that is like a reed.", "Rattan is the name for roughly 600 species of old world climbing palms belonging to subfamily Calamoideae. Rattan is also known as manila, or malacca, named after the ports of shipment Manila and Malacca City, as well as the name of the rattan genus Calamus.", "Bamboo is a woody grass that grows in tropical climates.", "Rattan is the name for almost 600 species of palms in the tribe Calameae.", "Bamboo is a group of perennial evergreens in the true grass family Poaceae, subfamily Bambusoideae, tribe Bambuseae.", "Bamboo is a group of woody perennial evergreens in the true grass family Poaceae.", "bamboo", "Rattan is a vine that grows in the tropical rain forests of Africa, Asia and Australia.", "Rattan is a vine that grows in tropical climates.", "Bamboo is a group of perennial evergreens in the true grass family Poaceae, subfamily Bambusoideae, tribe Bambuseae. Giant bamboos are the largest members of the grass family.", "Reed is a type of tall grass.", "Cane furniture is furniture constructed from natural materials, particularly rattan, which is a species of palm.", "A reed is a tall, grass-like plant growing in water.", "Reed is a type of material.", "A chair is a piece of furniture with a raised surface used to sit on, commonly for use by one person.", "The reed is a tall grass that grows in marshes and shallow water.", "Reed is a common name for several tall, grass-like plants of wetlands.", "A chair is a piece of furniture with a raised surface supported by legs, commonly used to seat a single person.", "A chair is a piece of furniture with a raised surface supported by legs, commonly used to seat a single person. Chairs are supported most often by four legs and have a back; however, a chair can have three legs or can have a different shape.", "Wicker is a technique for making products woven from any one of a variety of cane-like materials, a generic name for the materials used in such manufacture, and a term for the items themselves.", "Wicker is a technique for making products woven from any one of a variety of cane-like materials, a generic name for the materials used in such manufacture, and a term for the items so produced. The word wicker is believed to be of Scandinavian origin: vika, which means to bend in Swedish, and vikker meaning willow. Wicker is traditionally made of material of plant origin, but plastic fibers are now also used."]