["Trees produce fruit.", "The fruit comes from the trees.", "The fruit of the tree is the apple.", "Cherry trees are large trees that produce fruit.", "These trees produce cherries, pears, apples, peaches, and plums.", "Fruit is a structure that contains the plant's seeds and comes from specific flowers.", "The fruit is a pome", "The \"Apple\" is the pomaceous fruit of the apple tree, species Malus domestica in the rose family (Rosaceae).", "Citrus fruits are the fruits of the citrus trees.", "Apple trees produce apples.", "Apples grow on trees.", "The fruit is a drupe.", "The apple is the pomaceous fruit of the apple tree, species Malus domestica in the rose family (Rosaceae).", "Apples come from apple trees.", "An apple is a sweet, edible fruit produced by an apple tree (Malus domestica).", "The apple tree (Malus domestica) is a deciduous tree in the rose family best known for its sweet, pomaceous fruit, the apple. It is cultivated worldwide as a fruit tree, and is the most widely grown species in the genus Malus. The tree originated in Central Asia, where its wild ancestor, Malus sieversii, is still found today. Apples have been grown for thousands of years in Asia and Europe, and were brought to North America by European colonists.", "The apple is the pomaceous fruit of the apple tree, species Malus domestica in the rose family Rosaceae. It is one of the most widely cultivated tree fruits, and the most widely known of the many members of genus Malus that are used by humans. Apples grow on deciduous trees which are cultivated worldwide and are the most widely grown species in the genus Malus. The tree originated in Central Asia, where its wild ancestor, Malus sieversii, is still found today. Apples have been grown for thousands of years in Asia and Europe, and were brought to North America by European colonists.", "The apple tree (Malus pumila, commonly and erroneously called Malus domestica) is a deciduous tree in the rose family best known for its sweet, pomaceous fruit, the apple.", "The fruit is a drupe, containing a single seed.", "A cherry is the fruit of many plants of the genus Prunus, and is a fleshy drupe (stone fruit).", "A fruit is the seed-bearing structure in flowering plants (also known as angiosperms) formed from the ovary after flowering.", "The apple tree is a deciduous tree in the rose family best known for its sweet, pomaceous fruit, the apple.", "The trees produce sweet, juicy berries.", "The fruit is an important food source for wildlife.", "The fruit of the date palm tree is a drupe.", "The fruit is a drupe, consisting of an outer fleshy part (exocarp and mesocarp) surrounding a shell (the pit or stone) of hardened endocarp with a seed (kernel) inside.", "Coconut is a fruit.", "the fruit is a drupe, 2–3 cm long, with a relatively thick husk", "The fruit of the orange tree can be eaten fresh, or processed for its juice or fragrant peel.", "A tree is a perennial plant with an elongated stem, or trunk, supporting branches and leaves in most species.", "The olive tree, Olea europaea, is an evergreen tree or shrub native to the Mediterranean, Asia, and Africa. It is short and squat, and rarely exceeds 8–15 m in height.", "Plum trees produce plums.", "Cherries grow on cherry trees.", "The fruit of the coconut palm tree is the coconut.", "A plum is a fruit of the subgenus Prunus of the genus Prunus.", "The orange is the fruit of the citrus species Citrus × sinensis in the family Rutaceae.", "An orange is the fruit of the citrus species Citrus × sinensis in the family Rutaceae, native to China.", "A plum is a fruit of the subgenus Prunus of the genus Prunus. The subgenus is distinguished from other subgenera (peaches, cherries, bird cherries, etc.) in the shoots having terminal bud and solitary side buds (not clustered), the flowers in groups of one to five together on short stems, and the fruit having a groove running down one side and a smooth stone (or pit).", "A tree is a perennial plant with an elongated stem, or trunk, supporting branches and leaves in most species. In some usages, the definition of a tree may be narrower, including only woody plants with secondary growth, plants that are usable as lumber or plants above a specified height.", "olives", "Apple", "Pomegranates are red and have a hard outer rind."]