["The tiger is a painting.", "The artist used paint to create the tigers face.", "The tiger was painted on a wall.", "A painting is a picture or design made by applying pigment to a surface.", "A painting is a picture or design made with paint.", "The material used to create the tigers face is paint.", "A painting is created by applying paint to a surface.", "The tigers face was created using acrylic paint.", "The media used to create the tiger's face is paint.", "The media used to create the tiger is paint.", "The painting was done with oil paints.", "The media used to create the tiger's face was paint.", "The media used to create the tigers face was paint.", "The tiger face is painted on a wall.", "The tigers face was painted on a wall.", "The tigers face was painted on the wall.", "The umbrella or parasol is a folding canopy supported by wooden or metal ribs, which is usually mounted on a wooden, metal, or plastic pole. It is designed to protect a person against rain or sunlight.", "The tigers face is painted on the wall.", "Paint is any pigmented liquid, liquefiable, or solid mastic composition that, after application to a substrate in a thin layer, converts to a solid film. It is most commonly used to protect, color, or provide texture to objects.", "Paint is any pigmented liquid, liquefiable, or mastic composition that, after application to a substrate in a thin layer, converts to a solid film.", "Paint is any liquid, liquefiable, or mastic composition that, after application to a substrate in a thin layer, converts to a solid film. It is most commonly used to protect, color, or provide texture to objects.", "Paint is a pigmented liquid that dries to a solid film.", "The media was used to create the tigers face.", "Umbrella is a canopy designed to protect against rain or sunlight.", "The artist used a paint brush.", "Tiger face painting is a popular way to celebrate Halloween.", "A tiger is a large cat.", "A painting is a creative act.", "The umbrella or parasol is a folding canopy supported by wooden or metal ribs, which is usually mounted on a wooden, metal, or plastic pole.", "Umbrella is a folding canopy supported by wooden or metal ribs, which is usually mounted on a wooden, metal, or plastic pole.", "An oil painting is the process of painting with pigments with a medium of drying oil as the binder.", "A tiger is a large cat native to much of eastern and southern Asia.", "The tiger (Panthera tigris) is the largest cat species, most recognizable for its pattern of dark vertical stripes on reddish-orange fur with a lighter underside.", "The tiger is a large cat native to much of eastern and southern Asia.", "The tiger is the largest cat species, most recognizable for its pattern of dark vertical stripes on reddish-orange fur with a lighter underside.", "The tiger is the largest cat species, most recognizable for their pattern of dark vertical stripes on reddish-orange fur with a lighter underside.", "The tiger is a large carnivorous mammal of the Felidae family.", "The media used to create the face is acrylic paint.", "The tiger is a large cat native to much of eastern and southern Asia. Since 2010, the tiger has been listed as Endangered on the IUCN Red List.", "Oil paint is a type of slow-drying paint that consists of particles of pigment suspended in a drying oil, commonly linseed oil.", "A spray paint can is a metal container that contains spray paint.", "The umbrellas were painted using acrylic paint.", "Aerial art is a type of art, which is done by using a variety of mediums including, but not limited to, acrylic, oil, watercolor, and ink."]