["The fuel used in buses is diesel.", "Many buses are powered by diesel engines.", "This bus uses diesel fuel.", "Diesel fuel is used for buses.", "buses use diesel fuel.", "The bus uses diesel fuel.", "Most buses use diesel fuel.", "Buses are fueled by diesel, biodiesel, compressed natural gas, liquid petroleum gas or, in rare cases, electricity.", "Buses that run on diesel fuel.", "A bus is a road vehicle designed to carry many passengers.", "Bus is a type of vehicle.", "Diesel fuel is used in most heavy-duty vehicles, such as trucks and buses.", "A bus is a type of road vehicle designed to carry passengers.", "Diesel is a type of fuel.", "A bus is a large wheeled vehicle meant to carry many passengers. It is used for mass transport.", "Buses are powered by diesel, gasoline, compressed natural gas (CNG), liquefied natural gas (LNG), battery electric, or hydrogen fuel cells.", "The fuel is diesel.", "The bus uses gasoline.", "A bus (archaically also omnibus, multibus, motorbus, autobus) is a road vehicle designed to carry many passengers. Buses can have a capacity as high as 300 passengers.", "A bus is a road vehicle designed to carry many passengers. Buses can have a capacity as high as 300 passengers. The most common type of bus is the single-deck rigid bus, with larger loads carried by double-decker and articulated buses, and smaller loads carried by midibuses and minibuses; coaches are used for longer-distance services.", "Diesel fuel is a type of fuel.", "Diesel engines are used in heavy-duty vehicles and equipment, such as trucks, buses, construction equipment, and ships.", "A bus (archaically also omnibus, multibus, motorbus, autobus) is a road vehicle designed to carry many passengers. Buses can have a capacity as high as 300 passengers. The most common type of bus is the single-deck rigid bus, with larger loads carried by double-decker and articulated buses, and smaller loads carried by midibuses and minibuses; coaches are used for longer-distance services. Many types of buses, such as city transit buses and inter-city coaches, charge a fare. Other types, such as elementary or secondary school buses or shuttle buses within a post", "A bus is a road vehicle designed to carry many passengers. Buses can have a capacity as high as 300 passengers.", "Buses are powered by electricity.", "A bus (archaically also omnibus, multibus, motorbus, autobus) is a road vehicle designed to carry many passengers.", "A diesel engine is an internal combustion engine.", "Bus is a common means of public transport in a city or town. A bus is a road vehicle designed to carry many passengers. Buses can have a capacity as high as 300 passengers.", "The bus is powered by electricity.", "Diesel is a fuel derived from petroleum. It is used in diesel engines, which were invented by Rudolf Diesel.", "The most common type of fuel used in diesel engines is diesel fuel.", "A bus (contracted from omnibus, with variants multibus, motorbus, autobus, etc.) is a road vehicle designed to carry many passengers.", "A diesel engine is an internal combustion engine in which ignition of the fuel which is injected into the combustion chamber is caused by the elevated temperature of the air in the cylinder due to the mechanical compression.", "Diesel fuel, or more specifically diesel oil, is a specific fractional distillate of petroleum fuel oil, burned in a diesel engine.", "The diesel engine is an internal combustion engine in which ignition of the fuel, which is injected into the combustion chamber, is caused by the elevated temperature of the air in the cylinder due to the mechanical compression (adiabatic compression).", "The diesel engine (also known as a compression-ignition or CI engine) is an internal combustion engine in which ignition of the fuel is caused by the elevated temperature of the air in the cylinder due to the mechanical compression (adiabatic compression)."]