["This place is a restaurant, so food is usually served.", "A restaurant is a place where food is served.", "Food is served in restaurants.", "The food served in a restaurant is called restaurant food.", "The food is served in a restaurant.", "The restaurant serves food.", "A restaurant is a place where people go to eat food.", "Restaurants are a place where food is served to customers.", "A restaurant is a place where food is sold and eaten.", "A restaurant is a place where food is prepared and served to customers in return for money.", "A restaurant, or an eatery, is a business which prepares and serves food and drinks to customers in exchange for money. Meals are generally served and eaten on the premises, but many restaurants also offer take-out and food delivery services.", "A restaurant is a business that prepares and serves food and drinks to customers.", "A restaurant, or an eatery, is a business which prepares and serves food and drinks to customers in exchange for money.", "A restaurant or an eatery, is a business which prepares and serves food and drinks to customers in exchange for money.", "A restaurant, or an eatery, is a business that prepares and serves food and drinks to customers.", "A restaurant is a business which prepares and serves food and drink to customers in return for money, either paid before the meal, after the meal, or with an open account. Meals are generally served and eaten on premises, but many restaurants also offer take-out and food delivery services, and some offer only take-out and delivery. Restaurants vary greatly in appearance and offerings, including a wide variety of cuisines and service models ranging from inexpensive fast food restaurants and cafeterias to mid-priced family restaurants, to high-priced luxury establishments.", "A restaurant is a business which prepares and serves food and drinks to customers in exchange for money.", "a restaurant is a business which prepares and serves food and drink to customers in return for money.", "A restaurant is a business which prepares and serves food and drink to customers in return for money.", "A restaurant is a business which prepares and serves food and drinks to customers in return for money.", "A restaurant is a business which prepares and serves food and drinks to customers in exchange for money. Meals are generally served and eaten on the premises, but many restaurants also offer take-out and food delivery services.", "A restaurant is a business that prepares and serves food and drinks to customers in exchange for money. Meals are generally served and eaten on the premises, but many restaurants also offer take-out and food delivery services, and some offer only take-out and delivery.", "This is a restaurant.", "A restaurant is a business which prepares and serves food and drink to customers in return for money, either paid before the meal, after the meal, or with an open account.", "A restaurant is a business that prepares and serves food and drink to customers in return for money, either paid before the meal, after the meal, or with an open account.", "The type of food served at this place might be a buffet.", "The most common type of food served in a restaurant is Italian food.", "A meal is an eating occasion that takes place at a certain time and includes prepared food.", "this restaurant serves Italian food.", "A variety of foods may be served in a place like this.", "This looks like a restaurant.", "A meal is an eating occasion that takes place at a certain time and includes specific, prepared food, or the food eaten on that occasion.", "People often eat breakfast, lunch, and dinner at a table. People eat at a table in a restaurant.", "The food served in this place might be served with water.", "The types of food that might be served in a place like this are Italian, Mexican, and Chinese.", "There are many kinds of food. Some of them are bread, meat, and vegetables.", "The food is Italian.", "A place like this might serve food with high sugar content.", "People might eat breakfast in a place like this.", "The most common foods served with wine are cheese, fruit, and dessert.", "a salad is a dish consisting of a mixture of small pieces of food, usually vegetables or fruit."]