["The glass vases and cups would break if they fell to the ground.", "If a glass vase falls to the ground, it will break.", "Glass is a brittle material that will break if dropped.", "If a glass breaks, the pieces will fall to the ground.", "If the object that falls is fragile, it will break.", "If a glass item falls to the floor, it will break.", "If a vase is dropped, it will break.", "If a vase falls to the ground, it will break.", "They will shatter into pieces.", "If these items fall to the ground, they will break.", "If the vases fall to the ground it will break.", "The glass will break.", "If the vases fall on the floor, they will break.", "If these items fall to the ground, they can break.", "If the vases fall to the ground, they will break.", "Glass is brittle and will shatter when it hits the ground.", "If the glass falls to the ground, it will shatter.", "The glass vases would break.", "The glass will break into many pieces.", "If they fall, they will break.", "If they fall to the ground, they will break.", "Glass breaks easily.", "Glass is a brittle material.", "They will break.", "The glass would break and shatter into pieces.", "These items would break.", "The items would break.", "These items will break into pieces.", "The vase is broken.", "Glass is a non-crystalline, often transparent amorphous solid, that has widespread practical, technological, and decorative use in, for example, window panes, tableware, and optics. Glass is most often formed by rapid cooling of the molten form; some glasses such as volcanic glass are naturally occurring.", "If an object falls to the ground, it drops to the ground.", "Glass is a non-crystalline amorphous solid that is often transparent and has widespread practical, technological, and decorative usage in, for example, window panes, tableware, and optoelectronics.", "Glass is a non-crystalline amorphous solid that is often transparent and has widespread practical, technological, and decorative usage in, for example, window panes, tableware, and optics.", "A glass is a non-crystalline, often transparent amorphous solid, that has widespread practical, technological, and decorative use in, for example, window panes, tableware, and optics.", "They would break.", "Glass is a non-crystalline, often transparent amorphous solid, that has widespread practical, technological, and decorative use in, for example, window panes, tableware, and optoelectronics.", "The glass is a non-crystalline amorphous solid that is often transparent and has widespread practical, technological, and decorative usage in, for example, window panes, tableware, and optoelectronics.", "A vase is an open container. It can be made from a number of materials such as ceramics, glass, non-rusting metals, such as aluminum, brass, bronze or stainless steel.", "A vase is an open container. It can be made from a number of materials such as ceramics, glass, non-rusting metals, such as aluminum, brass, bronze or stainless steel. It can be of any color.", "When an object falls because of gravity, it's weight pulls it toward the center of the earth.", "break."]