["A hotel safe, usually located in a guest room, is used to temporarily store valuables.", "A hotel safe is a safe in a hotel room for the storage of valuables.", "Hotels provide a safe for guests to store valuables.", "Hotels have safes in the room to store valuables.", "The hotel safe is a safe installed in a hotel room for securing valuables.", "The hotel provides a safe in the room for guests to lock valuables in.", "A hotel safe is a safe for the temporary storage of valuables, usually available in guest rooms for the use of guests.", "Put valuables in the safe.", "When staying at a hotel, you should put your valuables in the safe.", "When staying in a hotel, you should put your valuables in the safe.", "You should put your valuables in the safe in the hotel room.", "You put your valuables in the safe in the room.", "You should put your valuables in the safe.", "You should put your valuables in the safe in the room.", "It is recommended to keep your valuables in a safe.", "You should put your valuables in the safe in your room.", "The valuables should be put in the safe.", "You should put your valuables in a safe.", "Valuables should be put in a safe place.", "The hotel has a safe in the room.", "A hotel safe, also known as a hotel safe deposit box, is a safe in a hotel room or suite that is used to store valuables.", "You should put your valuables in a safe place.", "You should put your valuables in your room.", "The hotel room is a room for lodging temporarily.", "A hotel room is a room in a hotel, motel, or resort where people sleep.", "A hotel room is a room in a hotel.", "A hotel is an establishment that provides paid lodging on a short-term basis. Facilities provided may range from a modest-quality mattress in a small room to large suites with bigger, higher-quality beds, a dresser, a refrigerator and other kitchen facilities, upholstered chairs, a flat screen television and en-suite bathrooms.", "A safe is a secure lockable box used for securing valuable objects against theft or damage from fire.", "A safe is a secure lockable box used for securing valuable objects against theft and/or damage from fire. A safe is usually a hollow cuboid or cylinder, with one face removable or hinged to form a door.", "A hotel is an establishment that provides paid lodging on a short-term basis.", "The safe.", "In the safe.", "a safe", "In a safe.", "Hotels often provide a number of additional guest facilities such as a restaurant, a swimming pool or childcare. Some hotels have conference services and meeting rooms and encourage groups to hold conventions and meetings at their location."]