["The liquid on the vegetables is called gravy.", "A gravy is a sauce made often from the juices of meats that run naturally during cooking and thickened with wheat flour or cornstarch for added texture.", "The liquid on the vegetables is gravy.", "Gravy is a sauce made often from the juices of meats that run naturally during cooking and thickened with wheat flour or corn flour.", "Gravy is a sauce, often made from the juices of meats that run naturally during cooking and often thickened with wheat flour or cornstarch for added texture.", "Gravy is a sauce often made from the juices of meats that run naturally during cooking and thickened with wheat flour or cornstarch for added texture.", "Gravy is a sauce made often from the juices of meats that run naturally during cooking and thickened with wheat flour or cornstarch for added texture.", "Gravy is a sauce made from the juices of meats that run naturally during cooking and thickened with wheat flour or cornstarch for added texture.", "Gravy is a sauce made from the juices of meats that run naturally during cooking and often thickened with wheat flour or corn starch for added texture.", "Gravy is a sauce made often from the juices of meats that run naturally during cooking and thickened with wheat flour or corn flour or rice flour.", "Gravy is a sauce often made from the juices of meats that run naturally during cooking and thickened with wheat flour or cornstarch for added texture. In the United States, the term can refer to a wider variety of sauces.", "Gravy is a sauce often made from the juices of meats that run naturally during cooking and thickened with wheat flour or corn starch for added texture. In the United States, the term can refer to a wider variety of sauces.", "The liquid is gravy.", "gravy", "In cooking, a sauce is a liquid, cream, or semi-solid food, served on or used in preparing other foods.", "A sauce is a liquid or semi-solid food served on or used in preparing other foods.", "The word gravy comes from the French word grané, meaning \"coarse meal\".", "Cauliflower is one of several vegetables in the species Brassica oleracea in the genus Brassica, which is in the family Brassicaceae. It is an annual plant that reproduces by seed.", "Cauliflower is a vegetable that is part of the cruciferous family. It is high in fiber and B-vitamins, and is a good source of many nutrients.", "Cauliflower is one of several vegetables in the species Brassica oleracea in the genus Brassica, which is in the family Brassicaceae. It is an annual plant that reproduces by seed. Typically, only the head is eaten – the edible white flesh sometimes called \"curd\" (with a similar appearance to cheese curd).", "Cauliflower is a vegetable that is covered with gravy and mashed potatoes.", "Broccoli is a green vegetable that is part of the cabbage family.", "The liquid is a mixture of water, milk, and butter."]