["The surfer is located on the beach.", "The surfer is located at the beach.", "A surfer is at a beach.", "The surfer is located in the ocean.", "A surfer is a person who rides on the waves of the ocean.", "A surfer is a person who rides a surfboard in the ocean.", "A surfer is a person who rides on waves.", "The surfer is on the beach.", "The surfer is on a beach.", "The surfer is at the beach.", "A surfer is a person who rides a wave on a surfboard.", "A surfer is a person who engages in the sport of surfing.", "A surfer is a person who engages in the surface watersport of surfing.", "A surfer is a person engaged in the sport of surfing.", "A surfer is riding a wave at the beach.", "A surfer is a person who rides on the forward face of a wave, which is often carrying the surfer towards the shore.", "A surfer is a person who rides a wave while standing on a surfboard.", "A surfer is a person who rides a wave standing up on a surfboard.", "A surfer is a person engaged in surfing, a surface water sport in which the wave rider, referred to as a surfer, rides on the forward or deep face of a moving wave, which usually carries the surfer towards the shore.", "Surfing is a surface water sport in which the surfer rides a surfboard on the crest and face of a wave, which is carrying the surfer towards the shore. Waves suitable for surfing are primarily found in the ocean, but can also be found in lakes or rivers in the form of a standing wave or tidal bore.", "Surfing is a surface water sport in which the wave rider, referred to as a surfer, rides on the forward or face of a moving wave, which usually carries the surfer towards the shore.", "Surfing is a surface water sport in which the wave rider, referred to as a surfer, rides on the forward or deep face of a moving wave, which usually carries the surfer towards the shore.", "Surfing is a surface water sport in which the wave rider, referred to as a surfer, rides on the forward or deep face of a moving wave, which is usually carrying the surfer towards the shore.", "Surfers can be found in the water at the beach.", "The surfer is in the Pacific Ocean.", "This person is located at the beach.", "This person is located in the beach.", "The surfer is in Hawaii.", "Surfers are people who ride the waves.", "Surfers are found in or near the ocean.", "The person is at the beach.", "The person is located at the beach.", "Surfing refers to the act of riding a wave, whether it be with a board or without a board, and regardless of whether the wave is ridden with the face of the wave breaking, or with the back of the wave breaking.", "The surfboard is a longboard.", "He is located on the beach.", "A beach is a landform alongside a body of water which consists of loose particles.", "The beach", "The beach is a landform alongside a body of water which consists of loose particles.", "The beach is a landform along the coast of an ocean, sea, lake, or river. It usually consists of loose particles, which are often composed of rock, such as sand, gravel, shingle, pebbles, or cobblestones.", "Hawaii is the most popular surfing destination in the world."]