["shakers are used to hold salt and pepper.", "Shakers are containers used to hold salt, pepper, sugar and other small pieces of food.", "The shakers are salt and pepper shakers.", "salt and pepper shakers.", "Salt and pepper shakers.", "A salt shaker is a container for holding and dispensing salt.", "Salt and pepper shakers are condiment dispensers used in Western culture that are designed to allow diners to distribute grains of edible salt and ground peppercorns.", "A salt shaker is a container for salt.", "A salt shaker (or saltshaker) is a container for holding and dispensing salt.", "A salt shaker is a container for salt that has a small hole at its top.", "The shakers on the table are salt and pepper shakers.", "Salt and pepper shakers are condiment dispensers used in Western culture that are designed to allow diners to distribute grains of edible salt and ground peppercorns. Salt and pepper shakers are sometimes held in a cruet-stand. Before the advent of pre-packaged spices in the late 19th century, pepper shakers were rare and the taste for pepper was satisfied by using pepper mills to grind the pepper fresh from the peppercorn. Pepper shakers are also known as pepper pots.", "Salt and pepper shakers are used to put salt and pepper on your food.", "Salt and pepper shakers are condiment dispensers used in Western culture that are designed to allow diners to distribute grains of edible salt and ground peppercorns. Salt and pepper shakers are sometimes held in a cruet-stand.", "Salt and pepper shakers are condiment dispensers used in Western culture that are designed to allow diners to distribute grains of edible salt and ground peppercorns. Salt and pepper shakers are sometimes held in a cruet - stand.", "Salt shakers and pepper shakers are condiment dispensers used in Western culture that are designed to allow diners to distribute grains of edible salt and ground peppercorns.", "A salt shaker is a container for salt. Before the advent of refrigeration, salting was an important method of food preservation.", "A shaker is a container used to hold and mix contents by shaking.", "The ceramic shaker (also called a salt cellar) is a common salt shaker.", "The shakers are a kind of toy.", "It is a salt shaker.", "The shakers are made of ceramic.", "Shakers are a religious sect that originated in England and then moved to the United States.", "Shakers are a religious sect that originated in England.", "The shakers are rabbit shakers."]