["The purpose of the white structure on the right side of the photo is a lighthouse.", "The white structure is a lighthouse.", "The lighthouse is a tower, building, or other type of structure designed to emit light from a system of lamps and lenses and to serve as a navigational aid for maritime pilots at sea or on inland waterways.", "The lighthouse is a tower, building, or other structure designed to emit light from a system of lamps and lenses and to serve as a navigational aid for maritime pilots at sea or on inland waterways.", "Lighthouse is a tower, building, or other type of structure designed to emit light from a system of lamps and lenses and used as an aid to navigation for maritime pilots at sea or on inland waterways.", "A lighthouse is a tower, building, or other type of structure designed to emit light from a system of lamps and lenses, and to serve as a navigational aid for maritime pilots at sea or on inland waterways.", "A lighthouse is a tower, building, or other type of structure designed to emit light from a system of lamps and lenses and to serve as a navigational aid for maritime pilots at sea or on inland waterways.", "A lighthouse is a structure, usually tall and cylindrical, designed to emit light from a system of lamps and lenses or, in older times, from a fire, and used as an aid to navigation for maritime pilots at sea or on inland waterways.", "A lighthouse is a structure designed to emit light from a system of lamps and lenses.", "A lighthouse is used as a navigational aid for ships.", "Lighthouses are used to guide ships at sea.", "The purpose of the white structure on the right side of the photo is to guide ships at sea.", "Lighthouses are used to mark dangerous coastlines, hazardous shoals, reefs, rocks, and safe entries to harbors; they also assist in aerial navigation. Once widely used, the number of operational lighthouses has declined due to the expense of maintenance and use of electronic navigational systems.", "The purpose of the white structure on the right side of the photo is to guide the ships.", "The purpose of the white structure is to guide ships and boats.", "The purpose of the white structure is to guide ships in the water.", "The purpose of the white structure is to guide ships and boats into safe harbor."]