["The hat is made by the New Era Cap Company.", "The hat is made by the brand called \"New Era\".", "The hat is made by a company called West New York.", "The hat is made by the brand New Era.", "The hat is made by the hat company.", "The hat is made by the New Era brand.", "The hat is made by the brand 'The hat'.", "The brand that makes this hat is New Era.", "The Hat Company is a company that makes hats.", "The hat is a brand of hat.", "The brand that makes this hat is West New.", "The hat is made by the brand \"Stetson\".", "The hat is made by a brand called \"Stetson\".", "The hat is made by the brand 'Stetson'.", "There are many brands of hats.", "The hat is from the store, West New York.", "The brand that makes this hat is the Stetson Hat Company.", "The hat is a New Era.", "The brand makes the hat is a brand.", "The hat is a western hat.", "The West New York Hat Company is a New York City-based hat company.", "The brand that makes this hat is Adidas.", "Stetson is an American manufacturer of hats.", "Stetson is a brand of hat manufactured by the John B. Stetson Company.", "The New Era Cap Company is an American headwear company headquartered in Buffalo, New York.", "The hat is a head covering which is worn for various reasons, including protection against the elements, ceremonial reasons such as university graduation, religious reasons, safety, or as a fashion accessory.", "The New Era Cap Company is a headwear company headquartered in Buffalo, New York.", "A hat is a head covering which is worn for various reasons, including protection against the elements, ceremonial reasons such as university graduation, religious reasons, safety, or as a fashion accessory.", "A hat is a head covering which is worn for various reasons, including protection against weather conditions, ceremonial reasons such as university graduation, religious reasons, safety, or as a fashion accessory.", "The New Era Cap Company is an American headwear company headquartered in Buffalo, New York. It was founded in 1920. New Era has over 500 different licenses in its portfolio.", "New Era is an American headwear company headquartered in Buffalo, New York. It was founded in 1920. New Era has over 500 different licenses in its portfolio.", "The brand is West New York.", "The brand is called West New."]