["A lion is a common predator of a zebra.", "A lion is a predator for a zebra.", "A lion is a predator of a zebra.", "A lion is a predator of zebras.", "The lion is a common predator of the zebra.", "The lion is a predator of the zebra.", "A lion is a predator of the zebra.", "Lions are predators of zebras.", "Lions are the predators of zebras.", "A lion is a predator of an animal.", "A lion is a predator.", "Lions are the common predators of zebras.", "The lion is a common predator of this animal.", "Lions are the main predators of zebras.", "Lions are predators.", "The lion is a predator of the animal seen here.", "The lion is a predator that lives in Africa.", "lions are the ones who preys on zebras.", "The lion is an apex and keystone predator, although some lions scavenge when opportunities occur.", "a buffalo is a large bovine animal, native to north america, europe, and asia.", "A buffalo is a large bovine animal.", "Lions, leopards, and hyenas are common predators of zebras.", "The lion is one of the big cats in the genus Panthera and a member of the family Felidae.", "The lion is one of the big cats in the genus Panthera and a member of the family Felidae. The commonly used term African lion collectively denotes the several subspecies found in Africa.", "Lions, leopards, and hyenas are the main predators of the zebra.", "Predators include lions, leopards, cheetahs, hyenas, wild dogs, and crocodiles.", "The lion (Panthera leo) is a species in the family Felidae; it is a muscular, deep-chested cat with a short, rounded head, a reduced neck and round ears, and a hairy tuft at the end of its tail.", "The zebra is a prey for lions, leopards, cheetahs, and hyenas.", "Lions, hyenas, and wild dogs are the most common predators of zebras.", "The lion is a large mammal of the Felidae (cat) family. Some large males weigh over 250 kg (550 lb). Today, wild lions live in sub-Saharan Africa and in Asia.", "The lion is a large mammal of the Felidae (cat) family. Some large males weigh over 250 kg (550 lb). Today, wild lions live in sub-Saharan Africa and in Asia (where an endangered remnant population resides in Gir Forest National Park in India) while other species of lions have disappeared from North Africa and Southwest Asia in historic times.", "The lion is a species in the family Felidae; it is a muscular, deep-chested cat with a short, rounded head, a reduced neck and round ears, and a hairy tuft at the end of its tail.", "The lion is the king of the jungle.", "The lion is a large cat of the family Felidae. It is a muscular, deep-chested cat with a short, rounded head, a reduced neck and round ears, and a hairy tuft at the end of its tail.", "lions", "The lion is the second-largest cat in the world, after the tiger.", "A predator is an animal that kills and eats another animal.", "A common predator is an animal that hunts another animal.", "A zebra is a mammal of the Equidae family and the subgenus Hippotigris."]