["Kayaks are used in the sport of kayaking.", "Kayaking is a sport that uses the items pictured here.", "In the sport of canoeing, kayaks are used.", "Kayaks are boats used in the sport of kayaking.", "Kayak is a type of boat.", "Kayaks are used for sport.", "People use kayak in sport.", "Kayaks are a type of boat.", "In kayaking, people use kayaks.", "Kayaking is the use of a kayak for moving across water. It is distinguished from canoeing by the sitting position of the paddler and the number of blades on the paddle.", "People use kayaks in the sport of kayaking.", "The kayak is a canoe-like boat typically propelled by double-bladed paddles and typically used for sport or recreation.", "A kayak is a small, narrow watercraft which is propelled by means of a double-bladed paddle. The word kayak originates from the Greenlandic word qajaq (IPA: [qajaq]).", "Kayaking is a sport that involves a small boat that is propelled by a double-bladed paddle.", "kayak is a boat for one or more people.", "A kayak is a small, narrow watercraft which is propelled by means of a double-bladed paddle. The word kayak originates from the Greenlandic word qajaq (IPA: ). In the UK the term canoe is often used when referring to a kayak.", "Kayaking is the use of a kayak for moving across water.", "People use kayaks to go kayaking.", "People use kayaks in kayaking.", "A kayak is a small, narrow watercraft which is propelled by means of a double-bladed paddle. The word kayak originates from the Greenlandic language, where it is the word qajaq (IPA: [qajaq]). In the UK the term canoe is often used when referring to a kayak.", "A kayak is a small, narrow watercraft which is propelled by means of a double-bladed paddle.", "Kayaks are small, narrow watercraft which are typically propelled by means of a double-bladed paddle.", "A kayak is a small, narrow watercraft which is propelled by means of a double-bladed paddle. The word kayak originates from the Greenlandic language, where it is the word qajaq.", "kayak is a small, narrow watercraft which is propelled by means of a double-bladed paddle.", "Kayak is a small, narrow watercraft which is propelled by means of a double-bladed paddle.", "kayaking", "Kayaks are used in sports such as whitewater kayaking, surf kayaking, kayak fishing, and kayak polo.", "People use the items pictured here in the sport of kayaking.", "In the sport of kayaking, people use the items pictured here.", "Canoeing is an activity which involves paddling a canoe with a single-bladed paddle.", "Canoeing is a sport that involves paddling a canoe with a single-bladed paddle.", "Canoeing"]