["The material used to make this suitcase is leather.", "Suitcase is made of leather.", "Suitcases are made of leather.", "The material used to make the suitcase shown in this picture is leather.", "The suitcase is made of leather.", "The most common material for luggage is leather.", "Suitcases are usually made of cloth, leather, plastic or other synthetic material.", "Suitcases are often made of cloth, leather, plastic, aluminum or other metal, or other rigid materials.", "Suitcases are made of leather, plastic and cloth.", "Suitcases are often made of cloth, canvas, vinyl, polyester, or leather.", "Suitcases are made of metal, plastic, leather or cloth.", "Suitcases are made of plastic, leather, metal, or fiberglass.", "The most common materials used to make suitcases are leather, plastic, and fabric.", "suitcases are made of plastic or fiberglass.", "Suitcases are made of plastic.", "A suitcase is a form of luggage. It is often a somewhat flat, rectangular-shaped bag with rounded square corners, either metal, hard plastic or made of cloth, vinyl or leather that more or less retains its shape.", "The suitcase is made up of plastic.", "This is a leather suitcase.", "A suitcase is a general term for a distinguishable form of luggage. It is often a somewhat flat, rectangular-shaped bag with rounded square corners, either metal, hard plastic or made of cloth, vinyl or leather that more or less retains its shape.", "A suitcase is a form of luggage. It is often a somewhat flat, rectangular-shaped bag with rounded square corners, either metal, hard plastic or made of cloth, vinyl or leather that more or less retains its shape. It has a carrying handle on one side and is used mainly for transporting clothes and other possessions during trips.", "The most common material used to make suitcases is plastic.", "A suitcase is a general term for a distinguishable form of luggage.", "The material used to make this suitcase shown in this picture is polyester.", "The material used to make this suitcase is polycarbonate.", "Luggage is the bag used to carry things when you travel.", "Luggage consists of bags, cases, and containers which hold a traveller's articles while the traveler is in transit.", "Leather is a durable and flexible material created by tanning animal rawhide and skins.", "Leather is a material made from the skin of an animal by tanning or a similar process.", "leather", "Leather is a durable and flexible material created by tanning animal rawhide and skins. The most common raw material is cattle hide.", "Leather is a durable and flexible material created by tanning animal rawhide and skin, often cattle hide."]