["A dirt road is a type of unpaved road made from the native material of the land surface through which it passes, known to highway engineers as subgrade material.", "The road is made of dirt.", "This road is made of dirt.", "The road is made of asphalt.", "Most roads are made of asphalt.", "Dirt roads are unpaved roads surfaced with loose material such as gravel or soil.", "A dirt road or track is a type of unpaved road made from the native material of the land surface through which it passes, known to highway engineers as subgrade material.", "A dirt road or track is a type of unpaved road made from the native material of the land surface through which it passes, known to highway engineers as subgrade material. Dirt roads are suitable for vehicles, and in some areas are the main transportation method for rural areas.", "This is a dirt road.", "Dirt roads are unpaved roads built with soil.", "Dirt roads are unpaved roads surfaced with gravel.", "Asphalt is a composite material commonly used to surface roads, parking lots, airports, as well as the core of embankment dams. It consists of mineral aggregate bound together with asphalt, laid in layers, and compacted.", "Dirt roads are often unpaved.", "Asphalt concrete is a composite material commonly used to surface roads, parking lots, airports, as well as the core of embankment dams.", "Dirt is the loose, dry, unconsolidated material that covers much of the land surface of the Earth.", "A road is a thoroughfare, route, or way on land between two places that has been paved or otherwise improved to allow travel by foot or some form of conveyance, including a motor vehicle, cart, bicycle, or horse.", "The term asphalt (or asphaltic concrete) is used to denote a mixture of mineral aggregate and asphalt binder.", "Dirt is a soft, loose, granular material.", "The surface of a road or track, for vehicles.", "It is made of dirt.", "Asphalt is a sticky, black, and highly viscous liquid or semi-solid form of petroleum.", "Asphalt, also known as bitumen, is a sticky, black and highly viscous liquid or semi-solid form of petroleum.", "Dirt", "Asphalt is a sticky, black and highly viscous liquid or semi-solid that is present in most crude petroleums and in some natural deposits, it is a substance classed as a pitch.", "Gravel is a loose aggregation of rock fragments."]