["The flooring is made of wood.", "The floor is made of wood.", "The floor is made of hardwood.", "The type of flooring shown in this picture is wood.", "The type of flooring shown in this picture is wood flooring.", "The floor is wood.", "The floor is wooden.", "Wood flooring is a type of flooring that is made from wood.", "The flooring shown in the picture is wooden.", "wooden flooring is the flooring that is made of wood.", "A hardwood floor is a wooden floor.", "A floor is the bottom surface of a room or vehicle. Floors vary from simple dirt in a cave to many-layered surfaces modern technology. Floors may be stone, wood, bamboo, metal or any other material that can support the expected load.", "Wood flooring is any product manufactured from timber that is designed for use as flooring, either structural or aesthetic.", "The floor is the bottom surface of a room or vehicle. Floors vary from simple dirt in a cave to many-layered surfaces modern technology. Floors may be stone, wood, bamboo, metal or any other material that can support the expected load.", "Wood flooring is any product manufactured from timber that is designed for use as flooring, either structural or aesthetic. Wood is a common choice as a flooring material and can come in various styles, colors, cuts, and species.", "Flooring is the general term for a permanent covering of a floor, or for the work of installing such a floor covering. Floor covering is a term to generically describe any finish material applied over a floor structure to provide a walking surface.", "The flooring is a permanent covering of a floor, or the work of installing such a floor covering.", "Flooring is the general term for a permanent covering of a floor, or for the work of installing such a floor covering.", "wood flooring is any product manufactured from timber that is designed for use as flooring, either structural or aesthetic. Bamboo flooring is often considered a wood floor, although it is made from a grass rather than a timber.", "The floor is carpet.", "The floor is the bottom surface of a room or vehicle. Floors vary from simple dirt in a cave to many-layered surfaces modern technology.", "The flooring is laminate.", "Hardwood flooring is a natural, beautiful flooring option that can complement any décor from traditional to contemporary.", "Cats are obligate carnivores: their physiology has evolved to efficiently process meat, and they have difficulty digesting plant matter.", "A cat is a small, typically furry, carnivorous mammal. They are often called house cats when kept as indoor pets or simply cats when there is no need to distinguish them from other felids and felines.", "a floor is the bottom surface of a room or vehicle.", "The flooring is a gray shadow hardwood floor.", "Hardwood flooring is a natural, durable but expensive flooring option for homes.", "The floor is the bottom surface of a room or vehicle.", "The floor of a room is the lower surface of a room, on which one stands.", "Laminate flooring is a multi-layer synthetic flooring product fused together with a lamination process. Laminate flooring simulates wood (or sometimes stone) with a photographic applique layer under a clear protective layer.", "Hardwood floors are a beautiful addition to any home.", "Wood, tile, carpet, laminate, vinyl, linoleum, marble, concrete.", "Carpet is a floor covering that is made up of an upper layer of pile attached to a backing. The pile was traditionally made from wool, but, since the 20th century, synthetic fibers such as polypropylene, nylon or polyester are often used, as these fibers are less expensive than wool.", "Laminate flooring is a multi-layer synthetic flooring product fused together with a lamination process.", "The floor of a room is the lower surface of that room, on which one may walk.", "Carpet is a textile floor covering typically consisting of an upper layer of pile attached to a backing. The pile was traditionally made from wool, but, since the 20th century, synthetic fibers such as polypropylene, nylon or polyester are often used, as these fibers are less expensive than wool.", "The floor of a wood-frame house is built with joists.", "A carpet is a textile floor covering typically consisting of an upper layer of pile attached to a backing. The pile was traditionally made from wool, but, since the 20th century, synthetic fibers such as polypropylene, nylon or polyester are often used, as these fibers are less expensive than wool. The pile usually consists of twisted tufts which are typically heat-treated to maintain their structure. The term \"carpet\" is often used interchangeably with the term \"rug\", although rugs are typically considered to be smaller than a room and not attached to the floor.", "Carpet is a textile floor covering typically consisting of an upper layer of pile attached to a backing.", "Wood is a porous and fibrous structural tissue found in the stems and roots of trees and other woody plants. It is an organic material, a natural composite of cellulose fibers that are strong in tension and embedded in a matrix of lignin that resists compression.", "Concrete flooring is a popular choice among homeowners, particularly in areas like basements, kitchens and bathrooms."]