["The apple is a fruit that is found in many grocery stores.", "A restaurant is a place where food is prepared and served to customers.", "An apple is a sweet, edible fruit produced by an apple tree.", "Apples are a tree that grows fruit.", "Apples are usually found in the supermarket.", "A kitchen is a room where food is prepared.", "The apple is the pomaceous fruit of the apple tree, species Malus domestica in the rose family Rosaceae.", "The apple is the pomaceous fruit of the apple tree, species Malus domestica in the rose family (Rosaceae).", "In a restaurant.", "The apple tree is a deciduous tree in the rose family best known for its sweet, pomaceous fruit, the apple. It is cultivated worldwide as a fruit tree, and is the most widely grown species in the genus Malus.", "The apple is a pomaceous fruit, belonging to the genus Malus in the family Rosaceae. It is one of the most widely cultivated tree fruits, and the most widely known of the many members of genus Malus that are used by humans.", "The apple is a pomaceous fruit, in the genus Malus, and is a tree.", "You can find an apple in a grocery store.", "a restaurant.", "You can find an apple in the grocery store.", "The apple tree is a deciduous tree in the rose family best known for its sweet, pomaceous fruit, the apple.", "The apple is a deciduous tree, generally standing 6 to 15 ft tall in cultivation and up to 30 ft in the wild. In 2010, the fruit's genome was decoded as part of research on disease control and selective breeding in apple production.", "A restaurant, or an eatery, is a business which prepares and serves food and drinks to customers in exchange for money.", "The apple is a deciduous tree, generally standing 6 to 15 ft tall in cultivation and up to 30 ft in the wild.", "The apple is a deciduous tree, generally standing 6 to 15 ft (1.8 to 4.6 m) tall in cultivation and up to 30 ft (9.1 m) in the wild.", "You can find this anywhere in the world.", "The kitchen is a room or part of a room used for cooking and food preparation in a dwelling or in a commercial establishment.", "You can find this in the kitchen.", "Apples are native to Central Asia and the apple tree is the most widely grown species in the genus Malus.", "In a supermarket, a customer can buy food, drink, or household items.", "A tray is a shallow platform designed for the carrying of items.", "A tray is a flat surface used for carrying or holding items.", "In a grocery store.", "In a tray.", "A kitchen is a room or part of a room used for cooking and food preparation in a dwelling or in a commercial establishment.", "A tray is a shallow platform designed for the carrying of items. It can be fashioned from numerous materials, including silver, brass, sheet iron, wood, melamine, and papier-mache.", "A fruit bowl is a container for holding fruit.", "The word fruit is used in several different ways. The definition of fruit for these lists is a culinary fruit, i.e. 'Any sweet, edible part of a plant that resembles fruit, even if it does not develop from a floral ovary; also used in a technically imprecise sense for some sweet or sweetish vegetables, some of which may resemble a true fruit or are used in cookery as if they were a fruit, for example rhubarb.'", "A fruit bowl is a container, traditionally made of pottery, for holding fruit.", "A fruit is the seed-bearing structure in flowering plants formed from the ovary after flowering.", "The food is in a fruit bowl.", "A supermarket is a self-service shop offering a wide variety of food, beverages and household products, organized into sections and shelves.", "I would find this on a table."]