["giraffe is eating.", "The giraffe is eating.", "Giraffes are herbivores. They eat leaves from trees, bushes, vines and shrubs.", "Giraffes are ruminants, or cud-chewing animals. They eat grasses, leaves, and fruit.", "Giraffes are herbivores, and they primarily eat leaves.", "Giraffe eat leaves and twigs from trees.", "Giraffes eat leaves and hay.", "Giraffes are herbivores, they eat plants.", "A giraffe is a mammal that eats hay.", "Giraffes are ruminants, which means they have a four-chambered stomach that allows them to digest tough plant matter. Their diet primarily consists of leaves and shoots from acacia trees.", "Giraffes are browsers and feed on leaves, flowers, fruits and shoots.", "Giraffes are ruminant animals with a four-chambered stomach. They eat large amounts of food in a short time, up to 34 kg (75 lb) of leaves and twigs daily.", "Giraffes are ruminants, and they are able to regurgitate their food and chew it as cud.", "Giraffes are herbivores, they only eat plants.", "A giraffe is an African mammal, the tallest living terrestrial animal and the largest ruminant.", "Giraffes eat the leaves of tall trees, preferring trees of the genus Acacia.", "A giraffe is an African even-toed ungulate mammal, the tallest living terrestrial animal and the largest ruminant.", "Giraffes are herbivores, they eat only plants.", "Giraffes eat hay.", "Giraffes are ruminants, which means they have a stomach with four compartments that digests tough plant food.", "Giraffes are ruminants, characterized by a long neck and long legs.", "Giraffes are ruminants, characterized by a four-chambered stomach and the ability to regurgitate and rechew their food.", "A giraffe is a large African mammal with a very long neck and forelegs, having a coat patterned with brown patches separated by lighter lines.", "Giraffes are ruminants, the same as cattle and other ungulates. A giraffe's diet is mostly made up of the leaves of acacia trees.", "Giraffes are ruminants, characterized by a long neck and long legs with skin-covered horns called ossicones.", "A giraffe is eating hay.", "A giraffe is a mammal and is the tallest living land animal, reaching a height of about 5.5 m (18 ft).", "Giraffes are mammals of the family Giraffidae in the order Artiodactyla.", "Giraffes are well known for their long necks, long legs, and spotted patterns.", "The giraffe is the tallest living terrestrial animal.", "The giraffe is eating hay.", "It is eating.", "The giraffe is bending down to pick a frisbee from a tree.", "eating", "Eating"]