["An airplane is a vehicle that flies in the air.", "An airplane is a vehicle.", "An airplane is a vehicle that can fly through the air.", "A plane is a flying vehicle.", "A plane is a vehicle that can fly.", "An airplane is a vehicle that flies in the sky.", "An airplane is a vehicle that can fly by gaining support from the air.", "an airplane is an aircraft that is heavier than air and propelled by propellers or jets.", "The vehicle is an airplane.", "The vehicle is a plane.", "The plane is an airplane.", "Aircraft is a vehicle that is able to fly by gaining support from the air.", "A jet plane is a plane that is powered by a jet engine.", "The plane is a vehicle that is used to transport people.", "An airplane is a powered, fixed-wing aircraft that is propelled forward by thrust from a jet engine or propeller.", "Airplanes are a type of aircraft that are propelled through the air by jet engines or propellers.", "A plane is a type of aircraft that has fixed wings and is heavier than air.", "A jet plane is a plane that is propelled by a jet engine.", "A plane is a fixed-wing aircraft.", "It is an airplane.", "A jet is a type of aircraft.", "An airplane is a powered, fixed-wing aircraft that is propelled forward by thrust from a jet engine or propeller. Airplanes come in a variety of sizes, shapes, and wing configurations.", "an airplane.", "A jet is an aircraft powered by jet engines.", "The vehicle above the building is an airplane.", "A jet is a type of aircraft that uses jet engines.", "An airplane is above the building.", "A jet is an aircraft propelled by jet engines.", "The vehicle is a jet.", "A jet is a vehicle that is propelled by jet engines.", "A jet aircraft (or simply jet) is an aircraft propelled by jet engines. Whereas the engines in propeller-powered aircraft produce a propulsive thrust through rotating blades, a jet engine produces thrust through a nozzle.", "The plane is a Boeing 737-800.", "Aircraft are used for many purposes, including transportation of people and cargo, recreation, military, and research.", "There is a plane above the building.", "A helicopter is an aircraft that uses rotors to lift and propel itself through the air.", "A vehicle is a device that is designed or used to transport people or cargo.", "A car (or automobile) is a wheeled motor vehicle used for transportation. Most definitions of the term specify that cars are designed to run primarily on roads, to have seating for one to eight people, to typically have four wheels, and to be constructed principally for the transport of people rather than goods."]