["Dj play music.", "This dj plays electronic music.", "DJs play electronic music.", "A DJ is a person who plays music for an audience.", "The DJ plays electronic music.", "The dj plays electronic music.", "A DJ typically plays recorded music for an audience at a nightclub, bar, dance club or rave.", "DJ is a person who plays recorded music for an audience.", "A DJ is a person who plays music by mixing different type of music by using various effects and ways.", "A DJ is a person who plays music.", "A DJ is a person who plays recorded music for an audience.", "The DJ plays music.", "DJ is a person who controls the playing of recorded music for an audience.", "DJs create and play music that incorporates recorded songs, either for a live audience or through radio, television or online broadcasts.", "Dj is a person who plays music for a party.", "DJs play a variety of musical genres.", "DJs play different types of music.", "DJing is the act of playing recorded music for an audience.", "DJs play music.", "DJing is the technique of playing recorded music for an audience.", "The dj is playing electronic music.", "DJs often play a selection of recorded music for an audience.", "A DJ, short for disc jockey, is a person who plays recorded music for an audience.", "DJs play a variety of music that is chosen by the audience.", "DJs are often musicians who play their own music.", "A DJ is a person who plays existing recorded music for a live audience. Most common types of DJs include radio DJ, club DJ who performs at a nightclub or music festival, and turntablist who uses record players, usually turntables, to manipulate sounds on phonograph records.", "The DJ plays the music of the late 80s and 90s.", "DJing refers to playing existing recorded music for a live audience in a nightclub or dance club or via broadcasting.", "In the UK, the term DJ is more commonly used to describe someone who plays recorded music for an audience.", "The DJ plays hip hop music.", "The dj is playing hip hop music.", "A disc jockey, often abbreviated as DJ, is a person who plays recorded music for an audience. Most common types of DJs include radio DJ, club DJ who performs at a nightclub or music festival and turntablist who uses record players, usually turntables, to manipulate sounds on phonograph records.", "DJs typically perform for a live audience in a nightclub or dance club or a TV, radio broadcast audience, or in the 2010s, an online radio audience. DJs also create mixes, remixes and tracks that are recorded for later sale and distribution.", "The dj plays trance music.", "The dj is playing turntablism.", "The music played at a dance club is usually a form of electronic music.", "A DJ mix or DJ mixset is a sequence of musical tracks typically mixed together to appear as one continuous track.", "Electronic dance music (also known as EDM, dance music, club music, or simply dance) is a broad range of percussive electronic music genres made largely for nightclubs, raves, and festivals. EDM is generally produced for playback by disc jockeys (DJs) who create seamless selections of tracks, called a mix by segueing from one recording to another.", "The music is typically an instrumental version of existing popular songs.", "Electronic music.", "The music that I play is mostly electronic dance music.", "Dance music is music composed specifically to facilitate or accompany dancing. It can be either a whole musical piece or part of a larger musical arrangement.", "The music of the United States reflects the country's pluri-ethnic population through a diverse array of styles.", "He plays the House music."]