["Airports are used by airplanes to transport passengers and cargo.", "Airports are used by aircraft for take off and landing.", "Airports are used by air transport.", "Airports are terminals for passengers traveling by air.", "Airlines use airports as terminals for passengers.", "Airport terminals are buildings that serve as transit points for people and cargo traveling by air.", "Airport", "Airport terminal is a building at an airport where passengers transfer between ground transportation and the facilities that allow them to board and disembark from aircraft.", "Airport terminal is a building at an airport where passengers transfer between ground transportation and the facilities that allow them to board and disembark from an aircraft.", "An airport terminal is a building at an airport where passengers transfer between ground transportation and the facilities that allow them to board and disembark from aircraft.", "Airport terminals are buildings where passengers transfer between ground transportation and the facilities that allow them to board and disembark from an aircraft. Within the terminal, passengers purchase tickets, transfer their luggage, and go through security. The buildings that provide access to the airplanes (via bridges, buses, or walkways) are typically called concourses. However, the terms \"terminal\" and \"concourse\" are sometimes used interchangeably, depending on the configuration of the airport.", "An airport is an aerodrome with extended facilities, mostly for commercial air transport. Airports often have facilities to store and maintain aircraft, and a control tower.", "airport is an aerodrome with extended facilities, mostly for commercial air transport. Airports often have facilities to store and maintain aircraft, and a control tower.", "Airport is an aerodrome with extended facilities, mostly for commercial air transport. Airports often have facilities to store and maintain aircraft, and a control tower.", "This is an airport terminal", "The airport is a facility where aircraft such as fixed-wing aircraft, helicopters, and blimps take off and land.", "A terminal is an airport building where passengers transfer between ground transportation and the facilities that allow them to board and disembark from an aircraft.", "A terminal is the place at an airport where passengers board or disembark from an aircraft.", "Airplanes use this terminal.", "An airport is an aerodrome with extended facilities, mostly for commercial air transport.", "A passenger terminal is a building at an airport where passengers transfer between ground transportation and the facilities that allow them to board and disembark from an aircraft.", "An airport is an aerodrome with extended facilities.", "This terminal is for air travel.", "A terminal is a building where passengers transfer between ground transportation and the facilities that allow them to board and disembark from mass transit vehicles such as buses, trains, and aircraft.", "The airport is a hub for American Airlines.", "Airplanes are the main mode of transportation.", "airplanes", "The airport is a hub and the main hub of American Airlines.", "Airplanes.", "airplane", "Airplane", "Airports are divided into landside and airside. Landside includes all areas accessible to the general public, while airside includes all areas accessible only to aircraft, airport vehicles and authorized personnel.", "Air travel is the safest form of transportation."]