["A cow is a mammal that makes a moo sound.", "The cow makes a mooing sound.", "A cow makes a mooing sound.", "Cows make a mooing sound.", "Cows make a moo sound.", "A cow makes the sound moo.", "The mooing of cows is a sound made by cows to communicate with each other.", "The cow makes a moo sound.", "A cow makes a moo sound.", "The sound a cow makes is moo.", "Cows can make a moo sound.", "The sound the cow makes is moo.", "Cows make many different sounds, including mooing, bellowing, grunting, lowing, and roaring.", "Cows make moo sounds.", "Cows make a variety of sounds.", "A cow says moo.", "A cow says “moo”.", "Pig and cow make a grunt sound.", "The cow is a mammal.", "A cow goes moo.", "Cows moo.", "The cow says moo.", "Cows have a distinctive moo.", "A cow is a female animal of the bovine family.", "The cow is an adult female cattle.", "A cow, or cow, is a female domesticated large bovine.", "The cow is a common farm animal, raised for its meat and milk.", "A cow is a female animal that produces milk.", "A cow is a female animal that has given birth to a calf.", "Pigs oink. Cows moo.", "A calf is a young domestic cow.", "A cow is a bovine mammal of the genus Bos, which includes B. taurus, the European cattle, B. indicus, the zebu, and the extinct B. primigenius, the aurochs.", "A cow is a mammal. Cows are herbivores, and they eat grass. They chew their food twice, then it goes to their first stomach called the rumen.", "The sound of a pig is oink.", "A pig makes a sound called oink.", "The pig is a common animal that makes the noise \"oink, oink.\"", "The pig makes a sound called a squeal.", "Moo", "The pig is a domestic animal with a pig.", "A calf is a young domestic cow. Calves are reared to become adult cattle or are slaughtered for their meat, called veal, and hide.", "Livestock are domesticated animals raised in an agricultural setting to produce commodities such as food, fiber, and labor.", "The pig oinks.", "Birds make their sounds with their vocal organs."]