["The airplane is a recreational plane.", "The plane is a recreational plane.", "A military plane is a plane used for military purposes.", "A military plane is a plane that is used by a military.", "A military plane is a plane that is used by the military.", "A recreational aircraft is an aircraft that is used for personal use.", "A recreational aircraft is a small aircraft that is used for recreational flying.", "Recreational aircraft are aircraft primarily used for recreation.", "A military plane is a military aircraft that is primarily designed for military use. Recreational plane is an aircraft that is used for sport or pleasure flying.", "The plane is a military plane.", "The plane is a civilian plane.", "It is a recreational plane.", "This is a recreational plane.", "The plane is recreational.", "Military planes are planes that are used by the military. Recreational planes are planes that are used for fun.", "Recreational planes are used for personal transportation, recreation, and sport. Military planes are used to transport military personnel and material, and to conduct military operations.", "A recreational aircraft can be defined as any aircraft that is used for pleasure flying.", "This is a military plane.", "A small propeller plane is a recreational plane.", "The plane was a single-engine Cessna 150, a two-seater used for recreational flying.", "A personal aircraft is any aircraft that is used for personal use.", "An airplane or aeroplane (informally plane) is a powered, fixed-wing aircraft that is propelled forward by thrust from a jet engine, propeller or rocket engine.", "Small propeller planes are used for recreational purposes.", "A military aircraft is any fixed-wing or rotary-wing aircraft that is operated by a legal or insurrectionary armed service of any type.", "A military aircraft is any fixed-wing or rotary-wing aircraft that is operated by a legal or insurrectionary armed service of any type. Military aircraft can be either combat or non-combat:", "The Cessna 172 Skyhawk is an American four-seater, single-engine, high wing, fixed-wing aircraft made by the Cessna Aircraft Company.", "The Cessna 172 Skyhawk is an American four-seat, single-engine, high wing, fixed-wing aircraft made by the Cessna Aircraft Company.", "Private aircraft may be either owned or leased by their users, or operated by the air carriers that provide air taxi or air charter services.", "The first military aircraft were balloons.", "A plane is a flat surface of a geometric figure.", "The Cessna 152 is an American two-seat, fixed tricycle gear, general aviation airplane, used primarily for flight training and personal use."]