["The bus is driven on a bridge.", "The bus is being driven on a bridge.", "A bus is a road vehicle designed to carry passengers.", "A bus is a road vehicle designed to carry many passengers.", "The bus is a road vehicle.", "A bus is a road vehicle designed to carry passengers on a bus route, usually on a scheduled bus route.", "The bus is being driven on the bridge.", "A double decker bus is being driven on a bridge.", "The bus is being driven on a road.", "A double-decker bus is a bus that has two storeys or decks.", "The vehicle in the image is a bus.", "The double-decker bus is being driven on the bridge.", "The double-decker bus is being driven on a bridge.", "A double-decker bus is a bus that has two storeys or decks. Double-decker buses are used for mass transport in the United Kingdom, Europe, Asia and many former European possessions.", "A double-decker bus is a bus that has two storeys or decks. Double-decker buses are used for mass transport in the United Kingdom, Europe, Asia and many former European possessions, the most iconic example being the red London bus.", "A double decker bus is a bus that has two levels or decks.", "A bus (contracted from omnibus, with variants multibus, motorbus, autobus, etc.) is a road vehicle designed to carry many passengers.", "A bus (archaically also omnibus, multibus, motorbus, autobus) is a road vehicle designed to carry many passengers.", "The double-decker bus is a bus that has two stories or decks.", "The vehicle is being driven on a bridge.", "A bridge is a structure built to span physical obstacles without closing the way underneath such as a body of water, valley, or road, for the purpose of providing passage over the obstacle.", "a bridge is a structure built to span physical obstacles without closing the way underneath such as a body of water, valley, or road, for the purpose of providing passage over the obstacle.", "A bridge is a structure built to span a physical obstacle, such as a body of water, valley, or road, without closing the way underneath.", "A bridge is a structure built to span physical obstacles such as a body of water, valley, or road, for the purpose of providing passage over the obstacle.", "The London bus network is a bus network serving Greater London in England. Over 8000 scheduled buses operate on a network of over 700 bus routes.", "A vehicle is a mobile machine that transports people or cargo.", "A road is a thoroughfare, route, or way on land between two places that has been paved or otherwise improved to allow travel by foot or some form of conveyance.", "A road is a thoroughfare, route, or way on land between two places that has been paved or otherwise improved to allow travel by foot or some form of conveyance, including a motor vehicle, cart, bicycle, or horse."]