["A woman's stomach becomes large when she is pregnant.", "A woman's stomach is large because she is pregnant.", "A pregnant woman's stomach is large because she is pregnant.", "A pregnant woman has a large stomach because she is pregnant.", "A pregnant woman has a large stomach because she has a child inside.", "A pregnant woman may have a large stomach due to her growing baby.", "A pregnant woman's stomach becomes large as she is growing a baby.", "A woman's stomach becomes larger during pregnancy.", "Pregnant women have a large stomach because they are pregnant.", "A pregnant woman's belly is large because it contains a growing fetus.", "The ladies stomach is large because she is pregnant.", "A pregnant woman has a baby in her belly.", "A pregnant woman is a woman who is pregnant.", "a pregnant woman is a woman who is pregnant.", "A pregnant woman is a woman who has a developing embryo or fetus in her uterus.", "Pregnant women are more likely to have a large stomach because they are carrying a baby.", "The woman is pregnant.", "Pregnant women are pregnant because they are expecting a baby.", "A pregnant woman is carrying an embryo or fetus in her uterus. Pregnancy also occurs in other female mammals, such as shrews, bats, and other primates.", "pregnancy", "A woman is pregnant when a fertilized egg grows in her uterus.", "Pregnant women have large stomachs because their babies are growing inside them.", "Pregnancy is the time during which one or more offspring develops inside a woman.", "Pregnancy, also known as gestation, is the time during which one or more offspring develops inside a woman.", "A pregnant woman is carrying a baby.", "Pregnancy is the fertilization and development of one or more offspring, known as an embryo or fetus, in a woman's uterus.", "She is pregnant.", "A pregnant woman's body undergoes many changes during pregnancy. She may experience more back pain and have to urinate more frequently.", "The average weight gain during pregnancy is 25 to 35 pounds."]