["A cow is a mammal that produces milk.", "Cows are mammals that are able to produce milk.", "Cows are mammals that are kept on farms to produce milk.", "A cow is a mammal that is used as a source of milk or meat.", "Cows are the animals from which milk is obtained.", "A cow is a common type of animal that can be milked.", "A cow is a female animal that produces milk.", "A cow is a mammal which is kept on farms for its milk and meat.", "A cow is a female animal that can produce milk.", "A cow is a female animal that gives milk.", "A cow is a mammal that is domesticated for its milk and meat.", "The cow is a mammal that produces milk to feed its young.", "A cow is a mammal, with females giving milk to feed their young.", "Cows are often milked by humans.", "Cows are milked.", "A cow is being milked.", "Cows are a type of mammal.", "Cows are milked by hand or machine.", "Cow milk is milk that comes from cows.", "Cows are mammals that are kept as livestock.", "Cows are domesticated large bovine animals that are kept on farms for their milk and meat.", "A cow is a female animal of the bovine species.", "Cows are milked by hand or by machine.", "A cow is a female animal that has given birth to a calf.", "A cow is a female adult cattle.", "A cow.", "Dairy cattle are cattle cows bred for the ability to produce large quantities of milk, from which dairy products are made. Dairy cows generally are of the species Bos taurus.", "cow", "A cow is a mammal, and the name of a specific mammal.", "A cow is a female animal of the species Bos taurus (cattle).", "A cow is a female animal of the genus Bos.", "A cow is a female animal of the species Bos taurus.", "A cow is a mammal that is a member of the bovine family, of the genus Bos.", "A cow is a common type of large domesticated ungulate. They are a prominent modern member of the subfamily Bovinae, are the most widespread species of the genus Bos, and are most commonly classified collectively as Bos primigenius.", "The cow is a large female cow.", "Cattle are domesticated mammals that are raised as livestock.", "The cow is a large domesticated ungulate.", "Cows are mammals of the family Bovidae and the genus Bos.", "A cow is a large animal with horns, a long tail, and a big belly.", "The cow is a common type of large domesticated ungulate. Cows are usually found in the countryside.", "Cows are the most common type of large domesticated ungulates. They are a prominent modern member of the subfamily Bovinae, are the most widespread species of the genus Bos, and are most commonly classified collectively as Bos taurus.", "Milking is the act of removing milk from the mammary glands of cattle.", "Cows are milked by attaching a cluster of tubes to their teats. The tubes are connected to a vacuum pump. The vacuum pump creates a vacuum to pull the milk from the cow's teats into a storage tank.", "Milk is a white liquid produced by the mammary glands of mammals. It is the primary source of nutrition for young mammals before they are able to digest other types of food.", "Milk is a white liquid produced by the mammary glands of mammals. It is the primary source of nutrition for infant mammals (including humans who breastfeed) before they are able to digest other types of food.", "Milk is a nutrient-rich, white liquid food produced by the mammary glands of mammals."]