["The container next to the benches is a bird feeder.", "The container next to the benches can contain food for the birds.", "The container is a bird feeder.", "The container is filled with bird food.", "A birdbath is a container filled with water for birds to bathe in.", "A birdbath is a container filled with water intended for birds to bathe in.", "The container is a box that is used to store food.", "The container is a bird bath.", "The container is for bird seed.", "The benches are usually used for seating.", "A birdbath is a small container filled with water to provide drinking water and bathing water for birds in a backyard.", "The benches are for people to sit on.", "Birds can be fed with seeds and bread.", "The benches are used to feed the birds.", "The benches are located next to a pond.", "Bird seed is typically put in the containers next to benches.", "A bird bath is a container filled with water for birds to bathe in.", "A birdbath is a bird attractant, typically a shallow artificial bowl filled with water, in which birds may drink, bathe, and cool themselves.", "A bench is a long seat on which multiple people may sit at the same time. Benches are typically made of wood, but may also be made of metal, stone, or synthetic materials. Many benches have arm and back rests; some have no back rest and can be sat on from either side. In American public areas, benches are often donated by persons or associations, which may then be indicated on it, e.g. by a small plaque.", "A bird is a feathered, winged, bipedal, warm-blooded, egg-laying, vertebrate.", "The container is used to store water.", "A bench is a long seat on which multiple people may sit at the same time. Benches are typically made of wood, but may also be made of metal, stone, or synthetic materials.", "Bench is a long seat on which multiple people may sit at the same time. Benches are typically made of wood, but may also be made of metal, stone, or synthetic materials.", "There are two types of benches: one that has a hole in the middle, and one that doesn't.", "A bench is a piece of furniture, on which several people may sit at the same time.", "The container is a pond.", "Birds are a group of endothermic vertebrates, characterised by feathers, toothless beaked jaws, the laying of hard-shelled eggs, a high metabolic rate, a four-chambered heart, and a strong yet lightweight skeleton.", "The benches are in a park.", "The bird is a feathered, winged, bipedal, warm-blooded, egg-laying vertebrate.", "A bench is a long seat on which multiple people may sit at the same time.", "A bird feeder, feeder, table, or tray feeder is a device placed outdoors to supply bird food to birds (bird feeding). The success of a feeder in attracting birds depends upon its placement and the kinds of foods offered, as different species have different preferences.", "The container is a trash can.", "The container can be a box, crate, or shipping container used to transport goods.", "There is a bird on the bench.", "The container next to the bench is a garbage can.", "Birds are warm-blooded vertebrates (vertebrates have backbones) and are the only animals with feathers.", "A bin is a container or receptacle. In the United States and Canada, bins are typically wheeled trash containers."]