["The time of day is 9:30.", "The clock shows the time as 10:20.", "The time of day is 11:06.", "The time is the part of the day when the sun is above the horizon.", "The time is displayed on a clock face.", "It's 7:30 in the morning.", "The time is 12:00.", "The time of day is usually expressed in hours.", "The clock is showing the time 6:00 pm.", "It is 10:00 AM.", "The time is 4:43 PM.", "It is noon.", "It is time that is measured in hours, minutes and seconds.", "It is 12:00.", "The time of day is the time of day at which the sun is at its highest point in the sky.", "It is 10:00.", "The time of day is the part of the day considered as intermediate between morning and evening.", "It is 11:59 pm.", "It is 5 o'clock.", "It is night time.", "It is 12:00 pm.", "The time of day is the part of the day spent awake.", "At noon, the sun is directly above the head of a person at the Equator, and the local solar time is 12:00.", "It is 12:00pm.", "It is about 9:00 am.", "The time of day is the part of the day considered as a whole, from a particular point of view, such as with respect to people working, eating, sleeping, and going to school.", "The clock is a device that measures time.", "Time is the indefinite continued progress of existence and events that occur in apparently irreversible succession from the past through the present to the future.", "Time is the indefinite continued progress of existence and events that occur in an apparently irreversible succession from the past, through the present, into the future.", "The clock is a timepiece that indicates or maintains the time.", "It is a time of day.", "The clock tower is a large clock, usually in a tower, which is designed to give the time of day to the observers.", "The time is in the image.", "It is 2:00 PM.", "The clock is a device that measures, keeps, and indicates time.", "The time of day is commonly expressed in English in terms of hours.", "A clock is an instrument used to measure, keep, and indicate time.", "A clock is an instrument to measure, keep, and indicate time.", "The sun rises in the morning and sets in the evening.", "It is daytime.", "Night or nighttime is the period of time between sunset and sunrise when the Sun is below the horizon.", "It is morning.", "The day is approximately the period during which the Earth completes one rotation around its axis.", "It is time for the day.", "Lunch is usually eaten at noon.", "The clock tower is a large clock tower located in the town of St. Marys, Ontario.", "In the past, sundials were the most accurate timepieces."]