["The location is a school. The vehicle is a school bus.", "The location is outside a house and the type of vehicle is a school bus.", "A school bus is a type of bus.", "The bus is a school bus.", "The school bus is at school and is a passenger vehicle.", "The location is in front of a house. The type of vehicle is a school bus.", "The vehicle is a school bus.", "The bus is in a city and it is a school bus.", "The school bus is a type of bus owned, leased, contracted to, or operated by a school or school district.", "The location is in front of a house.The type of vehicle is a small, articulated school bus.", "A school bus is a type of bus used for transporting children to and from school.", "A school bus is a type of bus owned, leased, contracted to, or operated by a school or school district.", "This is a school bus parked in front of a building.", "The location is a street in front of a house. The type of vehicle is a school bus.", "The vehicle is a school bus parked in front of a school.", "A school bus is a type of bus designed and manufactured for student transport: carrying students to and from school and school events.", "School bus is a bus designed to transport children and teenagers to and from school or school events.", "The school bus is a type of bus owned, leased, contracted to, or operated by a school or school district. It is regularly used to transport students to and from school or school-related activities, but not including a charter bus or transit bus.", "The school bus is a type of bus owned, leased, contracted to, or operated by a school or school district and regularly used to transport students to and from school or school-related activities, but not including a charter bus or transit bus.", "A school bus is a type of bus owned, leased, contracted to, or operated by a school or school district. It is regularly used to transport students to and from school or school-related activities, but not including a charter bus or transit bus.", "A school bus is a type of bus owned, leased, contracted to, or operated by a school or school district and regularly used to transport students to and from school or school-related activities, but not including a charter bus or transit bus.", "The school bus is the most common type of bus used for student transport.", "A bus is a road vehicle designed to carry passengers.", "The school bus is parked in front of a house.", "The location is a city, and the vehicle is a bus.", "The bus is a road vehicle designed to carry many passengers. Buses can have a capacity as high as 300 passengers.", "The bus is located in front of a house.", "The bus is parked in front of a house."]