["Beds are available for purchase at furniture stores.", "A bed can be bought from a furniture store.", "Bedroom furniture is available from many different types of store.", "Beds are typically sold in furniture stores.", "Furniture can be bought at IKEA.", "You can buy furniture from Ikea, Walmart, and Amazon.", "The place to buy this kind of furniture is IKEA.", "You can buy furniture in IKEA, Walmart, Target and so on.", "You can buy this kind of furniture at Ikea.", "Mattresses are available for purchase in furniture stores.", "You can buy furniture at the furniture store.", "Furniture is used to make a house, office, or other space suitable for living or working.", "You can buy this kind of furniture in IKEA.", "You can buy this kind of furniture at any furniture store.", "You can buy this kind of furniture in a furniture store.", "A person can buy a bed at a furniture store.", "Furniture is the mass noun for the movable objects intended to support various human activities such as seating and sleeping in beds, to hold objects at a convenient height for work using horizontal surfaces above the ground, or to store things.", "Furniture is the mass noun for the movable objects intended to support various human activities such as seating (e.g., chairs, stools, and sofas), eating (tables), and sleeping (e.g., beds).", "A furniture store is a retail establishment selling furniture.", "Furniture is the mass noun for the movable objects intended to support various human activities such as seating and sleeping.", "furniture store is a retail store that sells furniture.", "Furniture is the mass noun for the movable objects ('mobile' in Latin languages) intended to support various human activities such as seating and sleeping in beds, to hold objects at a convenient height for work using horizontal surfaces above the ground, or to store things.", "Beds can be bought in stores.", "Beds are furniture pieces that are used for sleeping or relaxing.", "The furniture is in a house.", "A furniture shop or furniture store is a retail outlet selling furniture.", "The bed is a piece of furniture used as a place to sleep or relax.", "Furniture is the mass noun for the movable objects ('mobile' in Latin languages) intended to support various human activities such as seating and sleeping.", "A bed is a piece of furniture which is used as a place to sleep or relax.", "A bed is a piece of furniture used as a place to sleep or relax.", "Bed is a piece of furniture. It is usually a place to sleep or relax.", "A bed is a piece of furniture which is used as a place to sleep or relax. Most modern beds consist of a soft, cushioned mattress on a bed frame, the mattress resting either on a solid base, often wood slats, or a sprung base.", "Furniture is usually a product of design and is considered a form of decorative art.", "The bed is a piece of furniture used as a place to sleep or relax. Most modern beds consist of a soft, cushioned mattress on a bed frame, the mattress resting either on a solid base, often wood slats, or a sprung base.", "IKEA is the largest furniture retailer in the world.", "Mattresses are available from a variety of sources, including national and regional chains, online retailers, furniture stores, and department stores.", "Mattresses can be found at Sears.", "Mattresses are available from mattress retailers, department stores, online retailers, and in some countries, bed manufacturers sell mattresses directly to the consumer.", "A mattress is a large, rectangular pad for supporting the reclining body, designed to be used as a bed or on a bed frame, as part of a bed.", "A mattress is a large pad for supporting the reclining body, used as a bed or as part of a bed.", "IKEA is a Swedish-founded multinational group that designs and sells ready-to-assemble furniture, kitchen appliances and home accessories", "IKEA is a Swedish-founded multinational group, that designs and sells ready-to-assemble furniture, kitchen appliances and home accessories."]