["Airplanes fly at about 35,000 feet.", "Airplanes fly at different heights.", "An airplane is a high-flying aircraft.", "A commercial jet airplane is flying at a height of 10,000 feet.", "An airplane is a vehicle that is heavier than air and is propelled by engines.", "Airplanes fly at an altitude of 35,000 to 45,000 feet.", "The average airplane is over 6 feet tall.", "The average airplane flies at a height of about 35,000 feet.", "The airplane flies at an altitude of about 10,000 feet above the ground.", "The airplane is about 30,000 feet in the sky.", "The airplane flies at an altitude of 35,000 feet.", "An airplane is flying at an altitude of 10,000 feet.", "airplanes fly in the sky.", "Airplanes can fly up to 30,000 feet.", "The cruising altitude of a plane is 35,000 feet.", "Passenger planes can fly at altitudes of 10,000 to 12,000 meters.", "The airplane is flying at an altitude of 5,000 feet.", "The airplane is flying at an altitude of 10,000 feet.", "The airplane is flying in the sky.", "The altitude of an aircraft is the vertical distance between the aircraft and the ground.", "An airplane or aeroplane (informally plane) is a powered, fixed-wing aircraft that is propelled forward by thrust from a jet engine, propeller or rocket engine.", "A plane is a flying machine that has wings and one or more engines.", "A typical commercial jet airliner has a cruising altitude of about 10 km (6 miles).", "The average cruising altitude of a commercial airplane is around 35,000 feet.", "The average cruising altitude of a commercial airliner is about 35,000 feet.", "The altitude of an aircraft is the distance of the aircraft above mean sea level.", "The average cruising altitude of a commercial jet is 35,000 feet.", "The average commercial airliner cruises at an altitude of about 35,000 feet.", "The maximum altitude of a commercial airliner is 45,000 feet.", "The average commercial jet flies between 31,000 and 38,000 feet.", "An airplane is a powered, fixed-wing aircraft that is propelled forward by thrust from a jet engine, propeller or rocket engine.", "An airplane is a powered, fixed-wing aircraft that is propelled forward by thrust from a jet engine or propeller.", "Aircraft altitudes are expressed in either feet or meters.", "An airplane or aeroplane is a powered, fixed-wing aircraft that is propelled forward by thrust from a jet engine, propeller or rocket engine.", "An airplane or aeroplane is a powered, fixed-wing aircraft that is propelled forward by thrust from a jet engine or propeller.", "A jet aircraft (or simply jet) is an aircraft (nearly always a fixed-wing aircraft) propelled by jet engines (jet propulsion).", "The Boeing 747 is an American wide-body commercial jet airliner and cargo aircraft, often referred to by its original nickname, Jumbo Jet, or Queen of the Skies.", "The Wright Flyer was the first successful heavier-than-air powered aircraft.", "The Boeing 747 is the first wide-body airliner to be produced and is commonly referred to as the \"Jumbo Jet\".", "A plane is a flat surface that extends infinitely in two dimensions.", "A plane is a flat surface that extends infinitely far in all directions.", "The Wright brothers' Wright Flyer I was the first successful powered aircraft. It flew for 12 seconds and covered 120 feet (37 m) on its first flight.", "The Boeing 787 Dreamliner is an American long-haul, mid-size wide-body, twin-engine jet airliner made by Boeing Commercial Airplanes."]