["Bananas are a fruit.", "Bananas are fruits.", "One banana is one piece of fruit.", "There are two bananas in the picture.", "There are two bananas in this picture.", "A banana is an edible fruit – botanically a berry – produced by several kinds of large herbaceous flowering plants in the genus Musa.", "A banana is an elongated, edible fruit – botanically a berry – produced by several kinds of large herbaceous flowering plants in the genus Musa.", "The banana is an edible fruit, botanically a berry, produced by several kinds of large herbaceous flowering plants in the genus Musa.", "There are two pieces of fruit.", "Banana is an elongated, edible fruit – botanically a berry – produced by several kinds of large herbaceous flowering plants in the genus Musa.", "A banana is an edible fruit, botanically a berry, produced by several kinds of large herbaceous flowering plants in the genus Musa.", "A banana is an edible fruit – botanically a berry – produced by several kinds of large herbaceous flowering plants in the genus Musa. In some countries, bananas used for cooking may be called plantains.", "A banana is an edible fruit – botanically a berry – produced by several kinds of large herbaceous flowering plants in the genus Musa. In some countries, bananas used for cooking may be called \"plantains\", distinguishing them from dessert bananas.", "Two bananas.", "Bananas are elongated, curved, edible fruits.", "two bananas", "Bananas are one of the most popular fruits in the world.", "There are two pieces of fruit in this picture.", "There are three pieces of fruit in this picture.", "Bananas are one of the most popular fruits in the world. They are a good source of potassium, fiber, vitamin B6, and vitamin C.", "Two pieces of fruit are in this picture.", "A fruit is the seed-bearing structure in flowering plants formed from the ovary after flowering.", "Bananas are the fourth most important food crop globally.", "Fruit is the seed-bearing structure in flowering plants formed from the ovary after flowering.", "Fruits are the means by which angiosperms disseminate seeds."]