["Electronics are used to make electronic devices such as cell phones and computers.", "Electronics are used to do a variety of different things.", "Electronics are used for many things.", "Electronics are electrical devices that operate on the principles of electricity.", "Electronics are electrical devices that operate on a signal.", "Electronics are electrical devices that operate on a circuit.", "Electronics are used to make cell phones.", "The electronics can be used for communication.", "the electronics are for communication.", "Electronics are used to make computers, radios, cell phones, televisions, and more.", "electronics are a class of electronic devices used to manipulate electrical signals.", "Electronics are electrical devices that operate on a signal, usually a voltage or current.", "The electronics are used for communications.", "These electronics are used for communication.", "The electronics could be used for communication.", "These electronics can be used for communication.", "electronics can be used to make calls", "Electronics is the branch of technology that deals with the design of circuits using transistors and microchips, and with the behavior and movement of electrons in a semiconductor, conductor, vacuum, or gas.", "Electronics comprises the physics, engineering, technology and applications that deal with the emission, flow and control of electrons in vacuum and matter.", "Electronics is the science of controlling electrical energy electrically, in which the electrons have a fundamental role.", "Electronics is the science of how to control electric energy, energy in which the electrons have a fundamental role.", "Electronics is the science of controlling electrical energy electrically, in which the electrons have a fundamental role. Electronics deals with electrical circuits that involve active electrical components such as vacuum tubes, transistors, diodes and integrated circuits, and associated passive electrical components and interconnection technologies.", "Electronics is the science of controlling electrical energy electrically, in which the electrons have a fundamental role. Electronics deals with electrical circuits that involve active electrical components such as vacuum tubes, transistors, diodes and integrated circuits, and associated passive electrical components and interconnection technologies. Commonly, electronic devices contain circuitry consisting primarily or exclusively of active semiconductors supplemented with passive elements; such a circuit is described as an electronic circuit.", "An electronic device is a device that manipulates energy to perform a function.", "Electronics is the study of how to control the flow of electrons.", "Electronics can be used to make a robot.", "Electronics deals with electrical circuits that involve active electrical components such as vacuum tubes, transistors, diodes and integrated circuits, and associated passive electrical components, and interconnection technologies.", "Electronics is the study of how to control electric energy, energy in which the electrons have a fundamental role.", "The electronics can be used to communicate with people.", "These electronics could be used for communication.", "Electronics is the discipline dealing with the development and application of devices and systems involving the flow of electrons in a vacuum, in gaseous media, and in semiconductors.", "Electronic components are basic electronic elements that are used to make electronic circuits.", "Electronics are used in the home, in the office, and everywhere else.", "These electronics could be used to make a bomb.", "They can be used to communicate with others.", "Cell phones are portable telephones that use cellular networks to transmit signals.", "A mobile phone, cell phone, cellphone, or hand phone, sometimes shortened to simply mobile, cell or just phone, is a portable telephone that can make and receive calls over a radio frequency link while the user is moving within a telephone service area.", "Electronic waste or e-waste describes discarded electrical or electronic devices.", "A cell phone is a portable telephone that can make and receive calls over a radio frequency carrier while the user is moving within a telephone service area.", "Electronic waste or e-waste describes discarded electrical or electronic devices. Used electronics which are destined for reuse, resale, salvage, recycling, or disposal are also considered e-waste. Informal processing of e-waste in developing countries can lead to adverse human health effects and environmental pollution.", "They could be used to help people with disabilities."]