["The picture style is called selfie.", "The style of the picture is called selfie.", "The style of the picture is called a selfie.", "Selfie is a photo taken by oneself.", "The selfie is a self-portrait photograph, typically taken with a hand-held digital camera or camera phone.", "Selfie is a self-portrait photograph, typically taken with a hand-held digital camera or camera phone.", "selfie is a self-portrait photograph, typically taken with a hand-held digital camera or camera phone.", "The term used to describe the picture style is a selfie.", "The term used to describe the picture style is selfie.", "The selfie is a self-portrait photograph, typically taken with a digital camera or camera phone held in the hand or supported by a selfie stick.", "Selfie is an self-portrait photograph.", "The picture style is a selfie.", "Selfie is a self-portrait photograph.", "A selfie is a self-portrait photograph, typically taken with a hand-held digital camera or camera phone.", "Selfie is a self-portrait photograph, typically taken with a digital camera or camera phone held in the hand or supported by a selfie stick.", "A selfie is a self-portrait photograph, typically taken with a camera phone held in the hand or supported by a selfie stick.", "A selfie is a self-portrait photograph, typically taken with a digital camera or camera phone held in the hand or supported by a selfie stick.", "Selfie is a style of photography, typically taken with a hand-held digital camera or camera phone.", "A selfie is a self-portrait photograph, typically taken with a smartphone which may be held in the hand or supported by a selfie stick.", "Selfie is a photo that is taken of yourself that is planned to be shared on social media.", "The photograph is a selfie.", "The image is a selfie.", "Selfie", "selfie", "Selfie.", "The self-portrait is a picture of oneself.", "In photography, a self-portrait is a representation of an artist that is drawn, painted, photographed, or sculpted by that artist.", "The term selfie was mentioned in an Australian internet forum on 13 September 2002."]