["a surfboard is a board that is used for surfing.", "A surfboard is a board used in the sport of surfing.", "A surfboard is a board that is used to ride waves.", "A surfboard is a longboard used in the sport of surfing.", "A surfboard is a long, narrow board used to ride waves.", "The surfboard is a board that is used to ride the waves.", "A surfboard is an elongated platform used in the sport of surfing. Surfboards are relatively light, but are strong enough to support an individual standing on them while riding an ocean wave.", "A surfboard is an elongated platform used in the sport of surfing. Surfboards are relatively light, but are strong enough to support an individual standing on them while riding an ocean surface wave breaking wave.", "A surfboard is an elongated platform used in surfing. Surfboards are relatively light, but are strong enough to support an individual standing on them while riding an ocean surface wave breaking wave.", "A surfboard is an elongated platform used in surfing. Surfboards are relatively light, but are strong enough to support an individual standing on them while riding an ocean wave.", "A surfboard is an elongated platform used in surfing. Surfboards are relatively light, but are strong enough to support an individual standing on them while riding a breaking wave.", "a surfboard is an elongated platform used in surfing. surfboards are relatively light, but are strong enough to support an individual standing on them while riding a breaking wave.", "A surfboard is a board used to stand on while surfing.", "A surfboard is an elongated platform used in the sport of surfing.", "A surfboard is a narrow platform used in surfing. Surfboards are relatively light, but are strong enough to support an individual standing on them while riding an ocean surface wave breaking wave.", "The board is a surf board.", "A surfboard is an elongated platform used in surfing.", "A surfboard is a narrow platform used in surfing.", "A surfboard is a longboard.", "The surfboard is a longboard.", "Surfboards are long and narrow, and are used to ride waves.", "That is a surfboard.", "The surfboard name is longboard.", "The surfboard is the most important piece of equipment for the surfer.", "A bodyboard is a type of surfboard used in bodyboarding."]