["Motorcycles are manufactured by Honda, Yamaha, and Suzuki.", "Honda makes motorcycles.", "Honda makes the motorcycle.", "The motorcycle is made by Honda.", "The motorcycle is made by Honda", "Honda is a motorcycle manufacturer.", "Honda is the world's largest motorcycle manufacturer.", "Yamaha Motor Company makes motorcycles.", "Honda, Kawasaki, Yamaha, Suzuki, BMW, Harley Davidson, Triumph, Ducati, MV Agusta, Indian, and Victory are all motorcycle manufacturers.", "The motorcycle is made by Harley Davidson.", "The motorcycle is a Honda.", "Yamaha is a Japanese company and makes motorcycles.", "The motorcycle is made by the company Ducati.", "bike is made by honda.", "The most common models of motorcycles are Harley Davidson, BMW, Honda, Kawasaki, Suzuki, Yamaha, Triumph, and Ducati.", "Harley-Davidson is an American motorcycle manufacturer.", "Harley-Davidson, Inc. is an American motorcycle manufacturer.", "Yamaha Motor Company Limited is a Japanese manufacturer of motorcycles, marine products such as boats and outboard motors, and other motorized products.", "The Honda Motor Company, Ltd. is a Japanese public multinational conglomerate corporation primarily known as a manufacturer of automobiles, aircraft, motorcycles, and power equipment.", "Honda Motor Company, Ltd. is a Japanese public multinational corporation primarily known as a manufacturer of automobiles and motorcycles.", "Honda Motor Company, Ltd. is a Japanese public multinational conglomerate corporation primarily known as a manufacturer of automobiles, aircraft, motorcycles, and power equipment.", "The motorcycle is a Harley-Davidson.", "Honda is a Japanese public multinational conglomerate corporation primarily known as a manufacturer of automobiles, motorcycles, and power equipment.", "A motorcycle is a two-wheeled motor vehicle.", "The company was founded in 1945 by Soichiro Honda, and has been the world's largest motorcycle manufacturer since 1959.", "Motorcycle is a two-wheeled motor vehicle.", "A motorcycle is a two-wheeled motorized vehicle.", "Honda is a Japanese multinational conglomerate corporation primarily known as a manufacturer of automobiles, aircraft, motorcycles, and power equipment.", "Honda is a Japanese public multinational conglomerate corporation primarily known as a manufacturer of automobiles, aircraft, motorcycles, and power equipment.", "Honda is a Japanese public multinational corporation primarily known as a manufacturer of automobiles, aircraft, motorcycles, and power equipment.", "The motorcycle pictured in the corner is made by BMW.", "A motorcycle, often called a bike, motorbike, or cycle, is a two- or three-wheeled motor vehicle.", "A motorcycle, often called a bike, motorbike, or cycle, is a two-or three-wheeled motor vehicle.", "Harley-Davidson, Inc. (H-D), or Harley, is an American motorcycle manufacturer, founded in Milwaukee, Wisconsin in 1903.", "Ducati Motor Holding S.p.A. is the motorcycle-manufacturing division of Italian company Ducati, headquartered in Bologna, Italy.", "Harley Davidson", "Harley-Davidson, Inc., H-D, or Harley, is an American motorcycle manufacturer founded in 1903 in Milwaukee, Wisconsin.", "BMW is a German company that produces motorcycles.", "BMW is a German multinational company which currently produces motorcycles.", "BMW is a German multinational company which produces automobiles and motorcycles."]