["The plant attracts butterflies and bees.", "The plant attracts insects.", "The plant attracts bees and butterflies.", "Butterflies and bees are attracted to the plant.", "The plant attracts bees, butterflies, and birds.", "The plants attract bees and butterflies.", "Insects are attracted to the plant.", "The flower of the plant is attractive to insects.", "The insects are attracted to the plant.", "The insects are attracted to the plants.", "Butterflies and bees are attracted to the flowers.", "Bees are attracted to the flowers of the plant.", "The plants attract bees, butterflies, and hummingbirds.", "The insect is attracted to the plant.", "The plant is attractive to bees, butterflies and/or birds.", "Bees, ants and butterflies are attracted to the flowers.", "The plant attracts the insects with its sweet nectar.", "Many insects are attracted to the sweet nectar of the flowers.", "The plant attracts bees.", "Bees are attracted to plants.", "Butterflies are attracted to many plants, including this one.", "Insects are attracted to plants by the smell of the plant.", "Bees are insects that are attracted to flowers.", "Bees are attracted to flowers.", "The plants are very attractive to bees.", "Insects are attracted to plants by the smell of nectar, which is a sweet liquid inside the flowers.", "Butterflies are attracted to many flowers.", "The plants that attract butterflies the most are those that provide nectar for the adult butterflies.", "A bee is an insect that is attracted to flowers.", "Pests are attracted to the plant by the smell of the flowers or the leaves.", "The butterfly bush is a popular plant that attracts butterflies, bees, and hummingbirds.", "The flowers of some species are very fragrant. The flowers are visited by flies, bees, and other insects.", "Plants that attract butterflies are often bright in color and have irregularly shaped flowers.", "Bees are flying insects closely related to wasps and ants, known for their role in pollination and, in the case of the best-known bee species, the western honey bee, for producing honey and beeswax.", "Insects are a class of invertebrates within the arthropod phylum that have a chitinous exoskeleton, a three-part body (head, thorax and abdomen), three pairs of jointed legs, compound eyes and one pair of antennae.", "Flies are insects with a pair of functional wings for flight and a pair of vestigial hindwings called halteres for balance.", "Butterflies are insects in the macrolepidopteran clade Rhopalocera from the order Lepidoptera, which also includes moths.", "The plant is a Venus flytrap.", "Insects are a class of invertebrates within the arthropod phylum that have a chitinous exoskeleton, a three-part body (head, thorax and abdomen), three pairs of jointed legs, compound eyes and one pair of antennae. They are among the most diverse groups of animals on the planet, including more than a million described species and representing more than half of all known living organisms. The number of extant species is estimated at between six and ten million, and potentially represent over 90% of the differing animal life forms on Earth. Insects may be found in nearly all environments, although", "The ladybug is a small beetle that eats insects that damage plants.", "A fly is any of a large number of insects of the order Diptera, the true flies. This order includes insects with one pair of wings (most), two pairs of wings (a few) and no wings (a few). For the latter two, the common name is used instead of \"fly\".", "The Venus flytrap (Dionaea muscipula) is a carnivorous plant native to subtropical wetlands on the East Coast of the United States in North Carolina and South Carolina."]