["Airplanes are used for domestic and international routes.", "Airplanes can fly international and domestic routes.", "Airplanes are used for international flights.", "The plane is flying an international route.", "A 747 is a large, long range airliner typically used on international routes.", "International flights are flights from one country to another.", "Domestic flights are flights from one point to another within the borders of a country.", "The plane is a Boeing 747.", "A 747 is a large airplane.", "The plane is a 747.The 747 is a wide-body commercial airliner and cargo transport aircraft, often referred to by its original nickname, Jumbo Jet, or Queen of the Skies.", "An international flight is a form of commercial flight within civil aviation where the departure and the arrival take place in different countries.", "International routes are flights that fly across borders.", "International flights are flights from one country to another. Domestic flights are flights within a country.", "International flights are flights that cross national borders. Domestic flights are flights that do not cross national borders.", "A domestic flight is a flight that takes place within the boundaries of a country. An international flight is a flight that crosses at least one national border.", "The plane flies international routes.", "The 747 is a long-range, wide-body airliner.", "A domestic flight is a flight that takes place within the borders of a country. An international flight is a flight that takes place between two countries.", "An international route is a flight route between two different countries.", "The Boeing 747 is an American wide-body commercial jet airliner and cargo aircraft, often referred to by its original nickname, Jumbo Jet, or Queen of the Skies.", "The Boeing 747 is a wide-body commercial jet airliner and cargo aircraft, often referred to by its original nickname, Jumbo Jet, or Queen of the Skies.", "An international route is a flight route that crosses one or more international borders.", "The Boeing 747 is an American wide-body commercial jet airliner and cargo aircraft, often referred to by its original nickname, Jumbo Jet.", "The Boeing 747 is an American wide-body commercial jet airliner and cargo aircraft, often referred to by its original nickname, \"Jumbo Jet\".", "The Boeing 747-400 is an American wide-body jet airliner. It is the world's second largest passenger airliner, a wide-body aircraft with a capacity of maximum 660 passengers in a typical three-class layout, or 853 passengers in all economy class configurations.", "The plane would fly international routes.", "The Boeing 747 is an American wide-body commercial jet airliner and cargo aircraft, often referred to by its original nickname, \"Jumbo Jet\". Its distinctive hump upper deck along the forward part of the aircraft has made it one of the most recognizable aircraft, and it was the first wide-body airplane produced.", "An international route is a route that crosses a border between two countries.", "The 747-400 is mainly used on long-haul routes, typically to international destinations.", "A domestic flight is a form of commercial flight within civil aviation where the departure and the arrival take place in the same country.", "The 747 is capable of carrying up to 660 passengers on long-haul routes, and is commonly used for cargo transport.", "Domestic airlines are airlines that operate within the territory of a country.", "Airplane is a powered, fixed-wing aircraft that is propelled forward by thrust from a jet engine or propeller.", "An airplane or aeroplane (informally plane) is a powered, fixed-wing aircraft that is propelled forward by thrust from a jet engine, propeller or rocket engine. Airplanes come in a variety of sizes, shapes, and wing configurations.", "The 747 is capable of carrying up to 660 passengers over 4,450 nautical miles (8,260 km) at a cruising speed of Mach 0.85.", "This is a domestic route.", "The Airbus A380 is a double-deck, wide-body, four-engine jet airliner manufactured by European manufacturer Airbus.", "There are three major types of aircraft: commercial, private, and military."]