["A common material to clean and shine the surfboard is wax.", "You can use a cloth to clean and shine the surfboard.", "You can use a wax to clean and shine the surfboard.", "You can use toothpaste to clean and shine the surfboard.", "Surfboards are made of wood or fiberglass.", "You can use a surfboard wax to clean and shine a surfboard.", "Surfboards are made out of foam and fiberglass.", "A cloth or soft material can be used to clean the surfboard.", "There are many different materials that can be used to make surfboards.", "A common material that can be used to clean the surfboard is a microfiber cloth.", "A surfboard can be cleaned with a surf wax.", "a surfboard is made of polyurethane foam, fiberglass and polyester resin.", "A surfboard is a longboard used in the sport of surfing.", "A surfboard is a large board with a fin at the bottom, used for surfing.", "A surfboard is a buoyant watercraft used in the sport of surfing.", "Surfboards are made of soft wood.", "A surfboard is an elongated platform used in surfing. Surfboards are relatively light, but are strong enough to support an individual standing on them while riding an ocean surface wave breaking wave.", "A surfboard is an elongated platform used in surfing. Surfboards are relatively light, but are strong enough to support an individual standing on them while riding an ocean wave.", "The surfboard can be cleaned with water and soap.", "Surfboards are made of fiberglass, which is a composite material.", "A surfboard is an elongated platform used in surfing. Surfboards are relatively light, but are strong enough to support an individual standing on them while riding a Ocean surface wave breaking wave. Major advances over the years include the addition of one or more fins on the rear of the board to improve directional stability.", "A surfboard is made of fiberglass.", "Surfboards are made from fiberglass.", "A surfboard wax is a material applied to the deck of a surfboard, bodyboard, or skimboard, to keep the surfer from slipping off the board when paddling out or riding a wave.", "A surfboard is an elongated platform used in the sport of surfing.", "A surfboard wax is a product that is applied to the deck of a surfboard to keep the surfer from slipping off.", "Surfboards are made of a foam core wrapped in fiberglass and epoxy resin.", "The surfboard is made of fiberglass.", "A surfboard is an elongated platform used in surfing.", "Surfboard wax is a material applied to the deck of a surfboard, bodyboard, or skimboard, to keep the surfer from slipping off the board when paddling out or riding a wave.", "surfboard wax is a product used to coat the deck of a surfboard to keep the surfer from slipping off.", "The surfboard is made of polyurethane foam covered with layers of fiberglass cloth, and polyester or epoxy resin.", "A surfboard is a buoyant board used in surfing. Surfboards are relatively light, but are strong enough to support an individual standing on them while riding an ocean wave. They were invented in ancient Hawaii, where they were known as papa he'e nalu in the Hawaiian language, they were usually made of wood from local trees, such as koa, and were often over 460 cm (15 ft) in length and extremely heavy.", "You can clean a surfboard with soap and water.", "The most common way to clean a surfboard is with a soft sponge and fresh water.", "Surfboard can be cleaned with a sponge.", "The most common material used to make surfboards is fiberglass.", "When you are done surfing, you can use a soft cloth and some water to clean your board.", "The best way to clean a surfboard is to use a soft cloth and warm water.", "Surfboards are long, narrow, relatively thin foam boards with a rounded nose and a square tail, often carrying a fin or three.", "The man is using a surfboard.", "Surf wax is a formulation of natural and/or synthetic wax for application to the deck of a surfboard, bodyboard, or skimboard, to keep the surfer from slipping off the board when paddling out or riding a wave.", "The surfboard fins are made from fiberglass.", "You can use a common material to clean shine the object being held.", "Cleaning and polishing"]