["A city is a large human settlement.", "The buildings are blurred by fog.", "The buildings are blurred because of fog.", "The buildings are blurred because there is fog.", "Buildings are blurred because of fog.", "The buildings in the city are blurred because of the fog.", "The fog is causing the buildings to blur.", "The buildings are blurred because of the fog.", "The buildings seem to be blurred because of fog.", "The buildings seem to be blurred because of the fog.", "Buildings are blurred due to fog.", "The buildings are blurred because they are in the fog.", "The city is covered in fog.", "There is fog in the city.", "The city is foggy.", "The buildings seem to be blurred because it is foggy outside.", "The buildings are blurred because it is foggy out.", "The city is a large and permanent human settlement.", "A fog is a visible aerosol consisting of tiny water droplets or ice crystals suspended in the air at or near the Earth's surface.", "Fog is a visible aerosol consisting of tiny water droplets suspended in the air at or near the Earth's surface.", "Fog is a visible aerosol consisting of tiny water droplets or ice crystals suspended in the air at or near the Earth's surface.", "Fog is a visible aerosol consisting of tiny water droplets or ice crystals suspended in the air at or near the Earth's surface. Fog can be considered a type of low-lying cloud and is heavily influenced by nearby bodies of water, topography, and wind conditions.", "Fog is a visible aerosol consisting of tiny water droplets suspended in the air, typically near the surface.", "The fog is caused by the reflection of light off of water droplets.", "The buildings are blurred because the picture was taken in a foggy day.", "Fog is a visible mass consisting of liquid water droplets or ice crystals suspended in the air at or near the Earth's surface.", "The buildings seem to be blurred because they are in the distance.", "Fog is a collection of water droplets or ice crystals suspended in the air at or near the Earth's surface.", "The fog.", "The haze is a direct result of air pollution.", "City of London is a city and local government district that contains the historic centre and the primary central business district (CBD) of London. It constituted most of London from its settlement by the Romans in the 1st century AD to the Middle Ages, but the agglomeration has since grown far beyond the City's borders."]