["The language spoken in this place is English.", "The official language of the United States is English.", "The most common language in the country is English.", "English is the language spoken in the United States.", "The language is English.", "English is the official language of the United States.", "Street signs are usually posted in English, but different languages can be used in different countries.", "English is spoken in England.", "English is spoken in the United States of America.", "The street signs are written in English.", "The languages spoken in the area are English and German.", "The English language is a West Germanic language that was first spoken in early medieval England and is now a global lingua franca.", "The street sign is in English.", "In the United States, street signs are usually in English.", "The name of the street sign is in the English language.", "The country has two official languages: English and French.", "The official language of the country is French.", "English is a West Germanic language that was first spoken in early medieval England and is now a global lingua franca.", "The language of the people in the place is the language.", "In the United States, all street signs are in English.", "English is a West Germanic language that was first spoken in early medieval England and eventually became a global lingua franca.", "The official language of the United Nations is English.", "English is the most widely spoken language in the United States.", "The language of a place is the language that is spoken in that place.", "The street sign is written in Chinese.", "Street signs are a form of traffic sign used to mark streets and roads.", "This is a street sign.", "The United States has no official language at the federal level. Many states have adopted English as their official language, along with some other official languages.", "English is a West Germanic language that was first spoken in early medieval England and eventually became a global lingua franca. It is named after the Angles, one of the Germanic tribes that migrated to the area of Great Britain that later took their name, as England. Both names derive from Anglia, a peninsula in the Baltic Sea.", "The language of the streets refers to the ways in which people communicate with each other on the streets.", "Sign languages are languages that use the visual-manual modality to convey meaning.", "The United States has no official language at the federal level.", "A sign language is a language which primarily uses manual communication to convey meaning.", "Spanish is a Romance language that originated in the Castile region of Spain and today has hundreds of millions of native-speakers across the world.", "The official language of France is French, and it is spoken by about 354 million people worldwide.", "The Finnish language is a Finnic language spoken by the majority of the population in Finland and by ethnic Finns outside Finland.", "German is spoken in Germany and Austria."]