["The conversation is about email.", "The conversation is an email conversation.", "It is a conversation via email.", "Email is a method of exchanging digital messages between people using electronic devices.", "Email is a method of exchanging messages between people using electronic devices.", "Email is a method of exchanging messages (\"mail\") between people using electronic devices.", "An email is a method of exchanging messages (\"mail\") between people using electronic devices.", "Email (or e-mail) is a method of exchanging messages (\"mail\") between people using electronic devices.", "An email is a method of exchanging digital messages between people using digital devices such as computers and mobile phones.", "Email is a method of exchanging digital messages between people using digital devices such as computers, tablets and mobile phones.", "Email is an electronic means of sending text messages from one person to another via a network.", "Email is a method of exchanging digital messages from an author to one or more recipients.", "Email is a method of exchanging digital messages from an author to one or more recipients. Email operates across the Internet or other computer networks.", "an email is an electronic message that is sent from one computer to another.", "Email is a method of exchanging messages (\"mail\") between people using electronic devices. Invented by Ray Tomlinson, email first entered limited use in the 1960s and by the mid-1970s had taken the form now recognized as email. Email operates across computer networks, which in the 2010s is primarily the Internet. Some early email systems required the author and the recipient to both be online at the same time, in common with instant messaging. Today's email systems are based on a store-and-forward model. Email servers accept, forward, deliver, and store messages. Neither the users nor their computers are required to", "Email is a method of exchanging messages between people using electronic devices. Email entered limited use in the 1960s, but users could only send to users of the same computer, and some early email systems required the author and the recipient to both be online simultaneously, similar to instant messaging.", "Email is electronic mail.", "This is a typical email conversation.", "Email is the most common form of electronic communication.", "This is an email conversation.", "A computer is a device that can be instructed to carry out sequences of arithmetic or logical operations automatically via computer programming.", "A computer keyboard is a typewriter-style device which uses an arrangement of buttons or keys to act as mechanical levers or electronic switches.", "It is an email.", "An email is a message that may contain text, files, images, or other attachments sent through a network to a specified individual or group of individuals.", "This is an email screen.", "The conversation is a text message.", "A conversation is an interactive communication between two or more people.", "A conversation is a form of interactive, spontaneous communication between two or more people.", "Conversation is interactive communication between two or more people.", "A conversation is a form of interactive, spontaneous communication between two or more people who are following rules of etiquette.", "A conversation is a spoken exchange of thoughts, opinions, and feelings between two or more people. Conversations are the ideal form of communication, although there are many other possible communication methods, for instance phone calls, text messages, e-mails, etc.", "This is a personal conversation."]