["A person is nearsighted if they can see close objects clearly, but far objects are blurry.", "Nearsightedness is a condition in which the light that enters the eye focuses in front of the retina, resulting in a blurred appearance of distant objects.", "A person is near-sighted if the image is formed in front of the retina.", "A nearsighted person is a person who has difficulty seeing distant objects.", "A person is near sighted if they can see objects close to them clearly but not far away.", "Nearsightedness, also known as short-sightedness and myopia, is an eye disorder where light focuses in front of, instead of on, the retina. This causes distant objects to be blurry while close objects appear normal.", "Nearsightedness, also known as shortsightedness, is a condition of the eye where light focuses at a point in front of the retina, causing distant objects to be blurry while close objects appear normal.", "A person is nearsighted when the ability to see up close is better than the ability to see far away.", "People who are nearsighted can see things close to them clearly, but things in the distance are blurry.", "The man is wearing glasses, so he is most likely nearsighted.", "Nearsightedness (myopia) is a common vision condition in which you can see objects near to you clearly, but objects farther away are blurry.", "A person who is far-sighted can see things in the distance better than things up close.", "Farsightedness, also known as hyperopia, is a condition of the eye where light focuses behind the retina, resulting in a blurred appearance for close objects.", "Farsightedness (hyperopia) is a common type of refractive error where distant objects may be seen more clearly than objects that are near.", "Farsightedness, also known as hyperopia, is a condition of the eye where light focuses behind the retina, resulting in a blurred image for nearby objects.", "A person who is far-sighted can see distant objects clearly but cannot see objects that are near.", "A person with myopia has light rays that focus in front of the retina instead of directly on it. This causes distant objects to appear blurry.", "Farsightedness is a condition of the eye where light focuses behind the retina instead of on the retina.", "Based on the refraction in the image explain if this man is far sighted or near sighted?", "Farsightedness is a condition of the eye where light focuses behind the retina, resulting in distant objects appearing blurry while close objects appear normal.", "A man is nearsighted.", "Farsightedness, also known as hyperopia, is a condition of the eye where light focuses behind, instead of on, the retina.", "Myopia, also known as nearsightedness and shortsightedness, is a condition of the eye where the light that comes in does not directly focus on the retina but in front of it, causing the image that one sees when looking at a distant object to be out of focus, but in focus when looking at a close object.", "Myopia, also known as nearsightedness and shortsightedness, is a condition of the eye where light focuses in front of, instead of on, the retina. This causes distant objects to be blurry while close objects appear normal.", "Farsightedness is a condition in which the cornea is too flat or the eye is too short, and the light entering the eye focuses behind the retina.", "Myopia, also known as nearsightedness and shortsightedness, is a condition of the eye where light focuses in front of, instead of on, the retina.", "Farsightedness and nearsightedness are common refractive errors that can cause blurry distance and close-up vision.", "Myopia, also known as nearsightedness, is a refractive error of the eye in which the light that comes in does not directly focus on the retina but in front of it, causing the image that one sees when looking at a distant object to be out of focus, but in focus when looking at a close object.", "The refraction in the image explains that this man is near sighted.", "The refraction in the image suggests that the man is near sighted.", "The man is nearsighted.", "The refraction in the image indicates the man is near sighted.", "The Refraction of Light is the bending of light rays when they pass through a medium.", "Refraction is the bending of light rays when passing through one medium to another. Refraction is responsible for many optical phenomena including mirages, rainbows, and optical illusions.", "The refraction of light is the bending of light as it passes from one medium to another.", "The refraction of light is the bending of light as it passes from one medium to another medium.", "The man is far sighted.", "The refraction of light is the bending of light in a medium.", "The refraction in the image shows that this man is near sighted, because the glasses are concave.", "The man is near-sighted.", "When light rays are refracted through a medium, the amount of refraction is dependent on the speed of light through the medium.", "The most common eye problem is refraction disorder. This is when the eye is not able to bend the light properly, and causes nearsightedness and farsightedness.", "The man is near sighted.", "The lens of the eye is a transparent structure that focuses light rays onto the retina.", "The human eye is an organ which reacts to light and pressure."]