["The blue board has a symbol that indicates a bus stop.", "The blue sign signifies that a bus stop is ahead.", "The blue board is a sign for a bus stop.", "The blue board indicates that the bus stop is a temporary stop.", "the blue board indicates that it is a bus stop.", "The symbol on the blue board indicates that the bus stop is closed.", "The symbol indicates the bus stop.", "The symbol in the blue board indicates that the bus stop is closed.", "Bus sign is a sign that indicates a bus stop.", "The blue board is the symbol for a bus stop.", "The blue board indicates the bus stop.", "The bus stop sign is a traffic sign, usually erected at the side of a road, that indicates where a bus stop is.", "The sign is a blue sign indicating that the road is closed.", "The transit bus stop sign is a blue board.", "The symbol in the blue board indicates that the street is closed.", "The blue sign is a traffic sign which is put on places where there is a danger for traffic.", "The blue board is a sign that indicates that the street is closed.", "The bus stop sign is a bus stop sign.", "The blue board indicates the parking control sign.", "The blue sign is a parking sign.", "The blue board indicates that the bus stop is closed.", "A blue sign is a traffic sign that shows the name of a place, tourist attraction or other point of interest, with a blue background.", "The blue sign with a white letter \"P\" and a red band indicates a parking restriction.", "The blue board indicates that the street is closed.", "The symbol in the blue board indicates that the parking is limited to a certain time limit.", "The blue board indicates that the bus is running late.", "A stop sign is a traffic sign to notify drivers that they must make sure no cars are coming and stop before proceeding.", "A street sign is a traffic sign that indicates the name of a street.", "The symbol indicates that the stop is a designated time point.", "Bus stop is a bus stop on the side of a road, at which buses stop for passengers to board or alight from a bus.", "This sign indicates that you must stop at a point indicated by a stop line, or if there is no stop line, before entering the pedestrian crossing.", "A bus stop is a designated place where buses stop for passengers to board or alight from a bus.", "A bus stop is a designated place where buses stop for passengers to get on and off the bus.", "A parking sign is a traffic sign that indicates where parking is allowed and where it is not allowed.", "The sign means that the parking is prohibited.", "A blue sign means that the road is in a national park, scenic area, or historic site.", "The blue board is a sign of the times. It is a sign of the times that the world is changing. The blue board is a sign of the times. It is a sign of the times that the world is changing.", "a sign is an object, quality, event, or entity whose presence or occurrence indicates the probable presence or occurrence of something else.", "An information sign, also known as an informational sign, is a type of traffic sign used to give information to road users."]