["The office has a computer on the desk.", "A home office is generally a room or other area of a residence set aside for the purpose of working from home.", "A home office is generally a room or other area of a residence set aside for the purpose of working, either at home or running a business from home.", "A home office is generally a room or other area of a residence set aside for the purpose of working at home.", "A home office is generally a room or other area of a residence set aside for the purpose of working at home, whether for personal or business use.", "A home office is a room or other area of a private residence dedicated to official or business activities.", "A home office is a place of business, for professional work, that is located in a private residence.", "A home office is generally a room or other area of the home of a self-employed person or of an employee who telecommutes.", "A home office is a place of business that is located in a private residence.", "A home office is a space in a home set aside for the purpose of running a business.", "A home office is a business that is based in a person's home.", "A home office is a space in a home used for work.", "A home office is generally a room or other area of the home of a self-employed person or person who telecommutes to their job, where one can do their work.", "A home office is generally a room or other area of the home of a self-employed person or person who telecommutes to their job, where he or she can do their work.", "A home office is a part of a house that is used as an office, or a room in an office building used mainly by one person.", "The home office is a study, den, or office in a residence which can be used as a place to work at home.", "We would suspect that this office is in a home because the computer is on a desk.", "Home office is a term used to describe the practice of working from home, usually a portion of one's home that has been set aside for that purpose.", "Home office is a home based business, which is conducted from home.", "The computer is on the desk.", "an office in a home is usually small.", "The office is in a home.", "The computer is on a wooden desk.", "The office is in a home because it is not in an office building.", "Home offices are usually in homes.", "The office is in a home because it is not in a building.", "The office is in a home because it is not a professional office.", "A computer desk is a desk that is designed to accommodate a computer.", "Home computers are computers that are used for personal use.", "The computer desk is a type of furniture intended to create a working surface and provide storage space for computer hardware such as the monitor, keyboard, computer mouse, printer, and tower or CPU.", "The computer desk is smaller than an office desk.", "A computer desk is a desk that is specifically designed to accommodate a computer.", "A computer desk is a desk that is designed to accommodate computer hardware such as a laptop or desktop computer.", "The computer is a desktop computer.", "The office is in a home because it is not in a school.", "An office is generally a room or other area where an organization's employees perform administrative work in order to support and realize objects and goals of the organization.", "Most home offices are small.", "An office is generally a room or other area where administrative work done by organizations members.", "The desk is a piece of furniture used as a table for working at.", "A desktop computer is a personal computer designed for regular use at a single location on or near a desk or table due to its size and power requirements.", "The computer is a personal computer.", "The desk is wood, not metal.", "A home is a place of residence or refuge.", "Desks are usually made of wood or metal, although materials such as tempered glass are sometimes seen.", "There is a plant on the desk.", "The home office deduction allows you to deduct a portion of the expenses of running your home, such as utilities and mortgage or rent, if you use part of your home exclusively and regularly for your business.", "The computer is an Apple.", "The computer monitor is off."]