["Birthday candles are the candles that are used to decorate birthday cakes.", "Birthday candles are the candles found on birthday cakes.", "The candles are blown out on a birthday cake.", "The birthday cake is traditionally a cake made with a sweet frosting and topped with lit candles.", "A birthday candle is a small candle placed on top of a birthday cake. The cake is then presented to the person whose birthday it is, and the candle is lit.", "A birthday candle is a candle placed on a birthday cake.", "A birthday cake is a cake eaten as part of a birthday celebration. Birthday cakes are often layer cakes with frosting served with small lit candles on top representing the celebrant's age.", "Birthday candles are a type of candle used to celebrate the anniversary of someone's birth, such as on a birthday cake.", "Birthday cake is a cake eaten as part of a birthday celebration.", "The birthday cake is traditionally decorated with small candies, bits of icing and candles.", "A birthday cake is a cake eaten as part of a birthday celebration.", "Candles are the most common type of birthday cake decoration.", "A birthday cake.", "Birthday candles are the candles used to celebrate a birthday.", "A birthday cake is a cake eaten as part of a birthday celebration in many world traditions.", "Birthday cake is a cake eaten as part of a birthday celebration in many world traditions.", "Candles are often used on birthday cakes.", "Birthday candles are blown out at every birthday party.", "Candles are often used on birthday cakes to indicate the number of years the person has lived.", "a birthday cake is a cake eaten as part of a birthday celebration in many world traditions. Variations of the typical birthday cake include birthday cupcakes, cake pops, pastries, and tarts.", "A birthday cake is a cake eaten as part of a birthday celebration in many world traditions. Variations of the typical birthday cake include birthday cupcakes, cake pops, pastries, and tarts.", "Birthday cake is a cake eaten as part of a birthday celebration in many world traditions. Variations of the typical birthday cake include birthday cupcakes, cake pops, pastries, and tarts.", "The birthday cake is traditionally a cake with a single candle in the center, lit before the song is sung.", "The birthday cake is blown out at every birthday party.", "Candles are the best decoration for a birthday party.", "The tradition of putting candles on a birthday cake is believed to have originated in ancient Greece.", "A birthday party is a celebration of the anniversary of the birth of the person who is being honored.", "Candles are blown out at every birthday party.", "Everyone loves birthday cake.", "A birthday is the anniversary of the birth of a person or figuratively of an institution. Birthdays of people are celebrated in numerous cultures, often with birthday gifts, birthday cards, a birthday party or a rite of passage.", "A birthday is the anniversary of the birth of a person, or figuratively of an institution. Birthdays of people are celebrated in numerous cultures, often with birthday gifts, birthday cards, a birthday party, or a rite of passage.", "birthday candles.", "Birthday candles.", "The tradition of birthday cakes appears to have its origins in ancient Greece.", "The candles are blown out.", "Cake", "The candle is a source of light, and in some cases, a source of heat and a means of keeping time.", "The song \"Happy Birthday to You\" is the most recognized song in the English language."]