["The remote control is a Sony, a brand of Sony Corporation.", "The remote control is a Sony remote control.", "The remote control is a device used to control a television.", "The remote control is a component of an electronics device, most commonly a television set, used for operating the device wirelessly from a short line-of-sight distance.", "The remote control is a Samsung remote control.", "The remote control is a device used to operate the television from a distance.", "The remote control is a device used to operate a television, DVD player, or other devices.", "A remote control is a component of an electronics device, usually a television set, used for operating the television device wirelessly from a short line-of-sight distance.", "The remote control is a device that can be used to control a television, DVD player, or other electronic device.", "The remote control is a hand-held device used to operate the television set.", "A remote control is a component of an electronics device, most commonly a television set, used for operating the device wirelessly from a short line-of-sight distance.", "The remote control is a device used to operate the television set from a short distance away.", "The remote control is a device that can be used to operate the television set from a short distance away.", "The remote control, often referred to as a remote, is a hand-held device used to operate devices such as televisions, DVD players and VCRs, cable television boxes, and other home appliances.", "The remote is made by Sony.", "A television remote control is a type of remote control used for operating televisions.", "The remote control is a hand-held device used to operate the television without actually touching it.", "A television remote control is a device which allows the user to operate various aspects of a television set, such as changing channel, adjusting the volume, or turning the set on or off.", "A remote control is an electronic device used to operate the device from a distance, usually wirelessly.", "A remote control is an electronic device used to operate the device from a distance, usually wirelessly. For example, in consumer electronics, a remote control can be used to operate devices such as a television set, DVD player or other home appliance, from a short distance.", "The remote control is a universal remote control.", "The remote control is a key component of the entertainment experience, allowing users to browse content, change channels, adjust the volume, and more.", "The Samsung Smart Control is a motion-sensing remote control for the Samsung Smart TV.", "The remote control is a silver remote control.", "The remote control is made by the brand LG.", "This remote is a Samsung remote.", "The remote control was invented in the 1950s.", "IR remote control.", "The brand of this remote is Samsung.", "Sony is a brand of television.", "The brand is sony.", "The Apple TV Remote is a remote control device released in October 2015 by Apple Inc.", "Sony is a Japanese company that makes TVs.", "Sony is a Japanese multinational conglomerate corporation headquartered in Kōnan, Minato, Tokyo.", "Sony", "Sony Corporation is a Japanese multinational conglomerate corporation headquartered in Kōnan, Minato, Tokyo. Its diversified business includes consumer and professional electronics, gaming, entertainment and financial services.", "The Sony Corporation is a Japanese multinational conglomerate corporation headquartered in Knan Minato, Tokyo, Japan.", "Samsung is a South Korean multinational conglomerate company headquartered in Samsung Town, Seoul.", "Samsung is a South Korean multinational conglomerate headquartered in Samsung Town, Seoul.", "The first remote control was invented in 1956 by Robert Adler, an Austrian-born American physicist."]