["Wallpaper is a covering material used to decorate interior walls.", "wallpaper is a covering used to decorate the interior of a building.", "A wallpaper or wallcovering is a decorative covering such as paper, fabric, or even ceramic tile applied to a wall or ceiling surface that is intended for aesthetic effect.", "Wallpaper is a kind of material used to cover and decorate the interior walls of homes, offices, cafes, government buildings, museums, post offices, and other buildings.", "Wallpaper is a material used in interior decoration to decorate the interior walls of domestic and public buildings.", "wallpaper is a material used in interior decoration to decorate the interior walls of domestic and public buildings.", "Wallpapers are types of wall coverings used to decorate interior walls.", "Wallpaper is a kind of decorative paper used to cover and decorate the interior walls of homes, offices, cafes, and other buildings.", "Wallpaper is a kind of material used to cover and decorate the interior walls of homes, offices, cafes, government buildings, museums, post offices, and other buildings; it is one aspect of interior decoration.", "Wallpaper is a material used to cover and decorate the interior walls of homes, offices, cafes, government buildings, museums, post offices, and other buildings; it is one aspect of interior decoration.", "The wallcovering is called wallpaper.", "The wallcovering is called \"wallpaper\".", "Wallpaper is a material used in interior decoration to decorate the interior walls of domestic and public buildings. It is usually sold in rolls and is applied onto a wall using wallpaper paste.", "Wallpaper is called paper.", "The wallpaper is called wallpaper.", "A wallcovering is a material used to cover and decorate the interior walls of homes, offices, cafes, government buildings, museums, post offices, and other buildings; it is one aspect of interior decoration.", "The term wallpaper was first used in English in 1712, after the French word papier peint."]