["The screen is a display device.", "The screen is a monitor.", "The screen can be changed by turning the monitor off and on.", "The screen can be changed by clicking on the screen.", "You can change the screen by pressing the power button on the computer.", "The screen of a computer can be changed by using a mouse or touchpad.", "The screen can be changed by pushing the power button.", "You can change the screen by using the monitor controls.", "The screen can be changed by pressing the buttons on the keyboard.", "The screen is the display monitor of a computer.", "We can change the screen by pressing the power button.", "To change the screen, you can use a keyboard and mouse.", "We can change the screen by pressing the button on the left side of the monitor.", "The screen can be changed by clicking on the screen and selecting a different screen.", "The screen is a computer monitor.", "You can change the screen by adjusting the screen resolution.", "The screen can be changed by moving the mouse.", "We can change the screen by changing the resolution of the screen.", "We can change the screen by pressing the button.", "You can change the screen by turning the screen off.", "The screen can be changed by turning the knob.", "We can change the screen by changing the resolution.", "To change the screen, use the remote control.", "To change the screen on your computer, go to settings and then display settings.", "You can change the screen by changing the color of the screen.", "The screen of a computer can be changed by pressing the F8 key.", "We can change the screen by changing the screen resolution.", "You can change the screen by using the arrow keys.", "We can use a remote control to change the screen.", "We can change this screen by using the mouse.", "We can change the screen by changing the settings.", "You can change the screen by pressing the F1-F12 key.", "We can change this screen by using a pencil.", "You can change the screen by clicking the right mouse button and selecting 'Properties' and then changing the background image in the 'Desktop' tab.", "The computer screen is the display monitor, which shows the user the current status of the computer.", "A computer monitor is an output device that displays information in pictorial form.", "A computer monitor is an output device which displays information in pictorial form.", "A computer monitor is the device that displays the information produced by the video card.", "A computer screen is a flat surface on which information can be displayed.", "A computer monitor is an output device that displays information in pictorial form. A monitor usually comprises the display device, circuitry, casing, and power supply.", "a monitor is an output device which displays information in pictorial form.", "Computer monitors are the display devices used with all general purpose computers.", "The display of a cathode ray tube (CRT) computer monitor.", "The screen resolution or display resolution is the number of distinct pixels in each dimension that can be displayed.", "A computer is a machine that can be instructed to carry out sequences of arithmetic or logical operations automatically via computer programming."]