["A claw-foot tub is a style of bathtub.", "A clawfoot tub is a bathtub with feet.", "A clawfoot bathtub is a type of bathtub.", "A claw-foot tub or claw-foot bathtub is a type of bathtub.", "A clawfoot tub or claw-foot tub is a type of bathtub.", "A clawfoot bathtub is a bathtub with feet.", "A clawfoot tub or claw-foot tub is a style of bathtub.", "This is a clawfoot bathtub.", "This is a claw foot bathtub.", "A claw foot tub is a bathtub with four feet that are shaped like claws.", "A clawfoot bath is a free-standing bathtub that is supported by four legs.", "This is a claw foot bath tub.", "A clawfoot bathtub, also known as a claw-foot tub or claw-foot bath, is a type of bathtub.", "A clawfoot tub or claw-foot tub is a type of bathtub. Its legs resemble a clawfoot.", "A claw-foot tub is a style of bathtub which is supported by four legs, resembling a clawfoot.", "A claw foot bath tub is a bath tub with claw feet.", "a claw-foot bathtub is a style of bathtub which is supported by four claw-like feet.", "A clawfoot bathtub, also known as a claw-foot tub or claw-foot bath, is a type of bathtub characterised by a rectangular shape, rounded at one or both of the shorter ends, and four rounded feet, or claws, placed at the corners.", "A clawfoot bathtub is a bathtub with feet resembling claws.", "A claw-foot tub is a style of bathtub that is supported by four legs.", "A clawfoot bathtub is a bathtub that has a clawfoot or claw-foot bathtub is a type of bathtub which has feet.", "A clawfoot tub is a bathtub with four feet.", "A claw-foot bathtub is a bathtub that is mounted on four legs.", "A clawfoot tub or claw-foot tub is a type of bathtub. Its legs resemble a clawfoot. Clawfoot tubs usually require more water than a standard bathtub, because generally they are larger.", "A claw foot bathtub is a bathtub with four legs that look like claws.", "A claw-foot tub or claw-foot bathtub is a bathtub with feet that look like a clawfoot. Clawfoot tubs are freestanding bathtubs; they are not fastened to the wall in any way.", "It is a claw bath tub.", "A claw-foot bathtub is a bathtub with four feet.", "A clawfoot tub or claw-foot tub, is a bathtub with feet (or \"claws\") that typically are made of cast iron, porcelain or acrylic.", "clawfoot bathtub is a bathtub with four feet.", "A claw-foot bathtub is a bathtub with four feet. The bathtub is usually made of cast iron, porcelain enameled steel, acrylic, or fiberglass.", "clawfoot tub", "A clawfoot tub or claw-foot tub is a bathtub with feet that are visible at the bottom of the tub; normally four feet, these tubs are traditionally made of cast iron and lined with porcelain.", "A claw foot bath is a bath that is high off the ground.", "This is a claw bath.", "The claw-foot bathtub or claw-foot tub was considered a luxury item in the late 19th century, originally made from cast iron and lined with porcelain.", "There are many different types of bathtubs.", "A bathtub, bath, or tub is a large or small container for holding water in which a person or animal may bathe.", "There are many types of bathtubs, including the alcove tub, the corner tub, the drop-in tub, the freestanding tub, the garden tub, the clawfoot tub, the whirlpool tub, and the soaking tub.", "a bath tub in a bathroom on tile flooring"]