["The event they are planning for is wedding.", "A wedding is an event where two people get married.", "A wedding is a ceremony where two people are united in marriage.", "The event is a wedding.", "A wedding is a ceremony where two people are united in marriage. Wedding traditions and customs vary greatly between cultures, ethnic groups, religions, countries, and social classes.", "a wedding is an event where two people are united in marriage.", "Wedding is a ceremony where two people are united in marriage.", "They are planning for a wedding.", "Wedding", "The men are planning for a wedding.", "A wedding.", "A wedding is a ceremony where two people are united in marriage. Wedding traditions and customs vary greatly between cultures, ethnic groups, religions, countries, and social classes. Most wedding ceremonies involve an exchange of marriage vows by the couple, presentation of a gift (offering, rings, symbolic item, flowers, money), and a public proclamation of marriage by an authority figure or celebrant. Special wedding garments are often worn, and the ceremony is sometimes followed by a wedding reception. Music, poetry, prayers or readings from religious texts or literature are also commonly incorporated into the ceremony.", "They are preparing for a wedding.", "The two men are planning for a wedding.", "The man is tying the tie for a wedding.", "Weddings are a common event that men wear suits to.", "The wedding is planned for the evening of the wedding.", "A tie is a long piece of cloth, worn usually by men, for decorative purposes around the neck, resting under the shirt collar and knotted at the throat.", "The two men are planning a wedding party.", "He is getting ready for a wedding.", "A tie clasp is a necktie accessory that is used to fasten a tie to the underlying shirt front, preventing it from swinging and ensuring that the tie hangs straight, resulting in a neat, uniform appearance.", "A tie is a long piece of cloth worn for decorative purposes around the neck or shoulders, resting under the shirt collar and knotted at the throat.", "Wedding.", "A tie clasp is a neckwear accessory that clips a tie to the underlying shirt front, preventing it from swinging and ensuring that the knot lies straight, resulting in a neat, uniform appearance.", "A tie is a long piece of cloth worn for decorative purposes around the neck, resting under the shirt collar and knotted at the throat.", "A tie clasp is a decorative fastener that is used to hold the two sides of a necktie together.", "A tie clasp is a decorative fastener that is used to hold the tie in place, especially the long end of the tie.", "A tie is a long piece of cloth worn for decorative purposes around the neck or shoulders, resting under the shirt collar and knotted at the throat. Variants include the ascot tie, bow tie, bolo tie, zipper tie, cravat, and clip-on tie. The modern necktie, ascot, and bow tie are descended from the cravat. Neck ties are generally unsized, but may be available in a longer size.", "A man is putting on his tie.", "a man is tying a tie.", "The two men are helping the other man put on a tie for a wedding.", "Tie clasps are used to secure the tie to the shirt front and prevent it from flapping around.", "A tie bar is a small piece of metal that clasps the tie to the dress shirt, preventing the tie from swinging and ensuring that the tie hangs straight, resulting in a neat, uniform appearance.", "A formal event is a social gathering that follows a set of rules and guidelines.", "The groom and groomsmen usually wear the same style of dress as each other.", "The event planner is responsible for the design, planning, and execution of the event.", "A social gathering to which people have been invited.", "The men are wearing formal outfits."]