["A fruit is the edible part of a plant that usually contains seeds.", "A fruit is the seed-bearing structure in flowering plants formed from the ovary after flowering. A vegetable is any part of a plant that is consumed by humans as food as part of a savoury meal.", "Fruits are the sweet and fleshy product of a tree or other plant that contains seed and can be eaten as food.", "Pears are fruits.", "pears are fruits.", "Pears are a fruit.", "A fruit is the seed-bearing structure in flowering plants formed from the ovary after flowering. Fruits are the means by which angiosperms disseminate seeds.", "Pears are fruit.", "Fruits are the ripened ovaries of plants, including the seeds within. Many plants and animals have coevolved such that the fruits of the former are an attractive food source to the latter, because animals that eat the fruits may excrete the seeds some distance away.", "Fruits are the ripened ovaries of plants, including the seeds within.", "Fruit is the sweet and fleshy product of a tree or other plant that contains seed and can be eaten as food.", "A fruit is the seed-bearing structure in flowering plants formed from the ovary after flowering.", "A fruit is the seed-bearing structure in flowering plants.", "Pears are a type of fruit.", "These are fruits.", "Fruits are the ripened ovaries—together with seeds—of plants, some of which are edible.", "Pears are a type of fruit that grows on trees.", "Fruits and vegetables are the same thing.", "A fruit is the seed-bearing structure in flowering plants (also known as angiosperms) formed from the ovary after flowering.", "Tomatoes are fruits.", "Fruits are the means by which angiosperms disseminate seeds. Edible fruits, in particular, have propagated with the movements of humans and animals in a symbiotic relationship as a means for seed dispersal and nutrition.", "Fruit is the seed-bearing structure in flowering plants formed from the ovary after flowering.", "Pears are a sweet fruit.", "Fruit", "Fruit is the seed-bearing structure in flowering plants (also known as angiosperms) formed from the ovary after flowering.", "Fruits are the means by which angiosperms disseminate seeds.", "Tomatoes are fruits, which are generally eaten as vegetables.", "Fruits are sweet and vegetables are not.", "Pears are edible fruits produced by the pear tree, which is a species of Pyrus.", "The pear is any of several tree and shrub species of genus Pyrus, in the family Rosaceae. It is also the name of the pomaceous fruit of the trees.", "Vegetables are parts of plants that are consumed by humans as food as part of a meal.", "A vegetable is an edible plant or its part, intended for cooking or eating raw.", "The tomato is the edible, often red, berry of the plant Solanum lycopersicum, commonly known as a tomato plant."]