["A chair is a piece of furniture used for sitting.", "A chair is a piece of furniture. It has a back and legs. You can sit on a chair.", "A chair is a piece of furniture with a raised surface used to sit on, commonly for use by one person.", "You can sit on a chair.", "A computer chair is a chair that is designed to be used with a computer.", "A chair is a piece of furniture.", "A chair is a piece of furniture designed to support the human body.", "You can sit on the chair.", "You can sit in a chair.", "The computer desk is a piece of furniture that is used to hold a computer and its peripherals.", "A chair is a piece of furniture with a raised surface supported by legs, commonly used to seat a single person.", "You could sit on a chair.", "You could sit on the chair.", "A chair is a piece of furniture with a raised surface supported by legs, commonly used to seat a single person. Chairs are supported most often by four legs and have a back.", "You can sit on the floor, on a chair, on a sofa, or on a bed.", "You could sit in a chair.", "A computer room is a room in which computer equipment is housed.", "A computer room is a room in which computers are used.", "A computer is a device that can be instructed to carry out sequences of arithmetic or logical operations automatically via computer programming.", "A computer room is any room in which a computer is used, or in which many computers are kept.", "You could sit at a desk.", "A computer is a machine that can be instructed to carry out sequences of arithmetic or logical operations automatically via computer programming. Modern computers have the ability to follow generalized sets of operations, called programs.", "A computer is a machine that can be instructed to carry out sequences of arithmetic or logical operations automatically via computer programming.", "Computers are used as control systems for a wide variety of industrial and consumer devices.", "You could sit anywhere you want.", "A sofa is a piece of furniture for seating two or three people in the form of a bench, with or without armrests, that is fully upholstered, and often fitted with springs and tailored cushions.", "A desk is a piece of furniture with a flat table-style work surface used in a school, office, home or the like for academic, professional or domestic activities such as reading, writing, or using equipment such as a computer.", "There are two chairs in the room.", "Computer monitors are the display devices used with all general purpose computers.", "A couch, also known as a sofa, settee, futon, or chesterfield, is a piece of furniture for seating two or more people in the form of a bench, with armrests, that is partially or entirely upholstered, and often fitted with springs and tailored cushions."]