["A wetsuit is a garment, usually made of foamed neoprene, which is worn by surfers, divers, windsurfers, canoeists, and others engaged in water sports and other activities in or on water, primarily providing thermal insulation, but also buoyancy and protection from abrasion, ultraviolet exposure and stings from marine organisms.", "Wetsuit is a garment, usually made of foamed neoprene, which is worn by surfers, divers, windsurfers, canoeists, and others engaged in water sports and other activities in or on water, primarily providing thermal insulation, but also buoyancy and protection from abrasion, ultraviolet exposure and stings from marine organisms.", "The wetsuit is a garment, usually made of foamed neoprene, which is worn by surfers, divers, windsurfers, canoeists, and others engaged in water sports, providing thermal insulation, abrasion resistance and buoyancy.", "A wetsuit is a garment, usually made of foamed neoprene, which is worn by surfers, divers, windsurfers, canoeists, and others engaged in water sports, providing thermal insulation, abrasion resistance and buoyancy.", "A wetsuit is a garment, usually made of foamed neoprene, which is worn by surfers, divers, windsurfers, canoeists, and others engaged in water sports and other activities in or on water, primarily providing thermal insulation, but in some circumstances, also buoyancy and protection from abrasion, ultraviolet exposure and stings from marine organisms.", "The wetsuit is a garment, usually made of foamed neoprene, which is worn by surfers, divers, windsurfers, canoeists, and others engaged in water sports and other activities in or on water, primarily providing thermal insulation, but also buoyancy and protection from abrasion, ultraviolet exposure and stings from marine organisms.", "Surfing wetsuit is a specially designed garment made of neoprene or similar material that protects the wearer against cold and abrasion while surfing.", "A wetsuit is a garment, usually made of foamed neoprene, which is worn by surfers, divers, windsurfers, canoeists, and others engaged in water sports and other activities in or on water, primarily providing thermal insulation, but also buoyancy and protection from abrasion, ultraviolet exposure and stings from marine organisms. The insulation properties depend on bubbles of gas enclosed within the material, which reduce its ability to conduct heat.", "Wetsuits are used in water sports such as surfing, scuba diving, wakeboarding, and bodysurfing.", "Wetsuits are worn while surfing, diving, windsurfing, canoeing, kayaking, water skiing, wakeboarding, sailing, bodyboarding, bodysurfing, riverboarding, river bugging, riverboarding, river bugging, riverboarding, river bugging, riverboarding, river bugging, riverboarding, river bugging, riverboarding, river bugging, riverboarding, river bugging, riverboarding, river bugging, riverboarding, river bugging, riverboarding, river bugging, riverboarding, river bugging, riverboarding, river bugging, riverboarding, river bugging,", "A wet suit is a rubber suit worn by surfers.", "Wetsuits are made of a thin layer of neoprene, which contains small bubbles of nitrogen gas when made for use as a thermal insulator in wet suits.", "You would wear a wetsuit while surfing.", "You would wear a wetsuit.", "Wetsuits are made of foamed neoprene, which is a synthetic rubber that contains small bubbles of gas.", "The surfers are wearing wetsuits.", "Surfers wear swimsuits or board shorts."]