["Glass shower enclosures are made of tempered glass.", "There are many types of glass used to make shower enclosures. The most common are tempered glass, laminated glass, and acrylic.", "The shower enclosure is made of tempered glass.", "Shower glass is a type of glass that is used to make shower enclosures.", "Tempered glass is used to make shower enclosures.", "The most common types of glass used in shower enclosures are tempered glass and laminated glass.", "Shower enclosures are made of tempered glass.", "Glass shower doors are made from tempered glass, which is a type of safety glass.", "The most common types of glass used in shower enclosures are clear glass, tempered glass, and frosted glass.", "Glass shower doors are made from either tempered glass or laminated glass.", "Glass shower enclosures are made of glass.", "Shower enclosures are made of glass.", "The shower enclosure is made of glass.", "Shower enclosures are usually made of glass.", "The glass is made of tempered glass.", "Shower doors are made from clear glass, patterned glass, or frosted glass.", "Glass is a non-crystalline, often transparent amorphous solid, that has widespread practical, technological, and decorative use in, for example, window panes, tableware, and optics. Glass is most often formed by rapid cooling of the molten form; some glasses such as volcanic glass are naturally occurring.", "Glass used in residential windows is typically annealed, which means it is slowly cooled after the manufacturing process to relieve internal stresses and make it less brittle.", "Glass is a non-crystalline amorphous solid that is often transparent and has widespread practical, technological, and decorative usage in, for example, window panes, tableware, and optoelectronics.", "The common types of glass are: Tempered glass, Laminated glass, Flat glass, Patterned glass, Wired glass, Low-emissivity glass, Insulating glass, Reflective glass, and Solar control glass.", "Glass is a non-crystalline amorphous solid that is often transparent and has widespread practical, technological, and decorative usage in, for example, window panes, tableware, and optics.", "The glass is a type of glassware made of glass and is used for drinking.", "The glass is tempered glass.", "Shower enclosures can be made from glass, fiberglass, acrylic, and other materials.", "The glass is made of plexiglass.", "A shower enclosure is a shower stall or bathtub enclosure that is fitted with a glass door.", "Shower enclosures are made from a variety of materials, but the most common are glass, acrylic, fiberglass, and metal.", "Tempered glass, also known as toughened glass, is a type of safety glass processed by controlled thermal or chemical treatments to increase its strength compared with normal glass.", "Tempered glass is a type of safety glass processed by controlled thermal or chemical treatments to increase its strength compared with normal glass. Tempering puts the outer surfaces into compression and the interior into tension. Such stresses cause the glass, when broken, to crumble into small granular chunks instead of splintering into jagged shards as plate glass (aka: annealed glass) creates. The granular chunks are less likely to cause injury.", "Shower enclosures are used to contain water in the shower.", "Tempered glass is a type of safety glass processed by controlled thermal or chemical treatments to increase its strength compared with normal glass.", "Tempered glass is a type of safety glass processed by controlled thermal or chemical treatments to increase its strength compared with normal glass. Tempering puts the outer surfaces into compression and the inner surfaces into tension.", "Frosted glass is produced by the sandblasting or acid etching of clear sheet glass.", "A shower is a place in which a person bathes under a spray of typically warm or hot water."]