["The steam is coming from the steam engine.", "Steam engines use steam to produce power.", "The steam is from the engine.", "The steam is caused by the burning of coal in the engine.", "The steam engine is a heat engine that performs mechanical work using steam as its working fluid.", "The steam is caused by the train engine.", "A steam engine is a heat engine that performs mechanical work using steam as its working fluid.", "The steam is being caused by the engine.", "The engine is powered by steam.", "Steam engines use heat to make steam, which is used to power the engine.", "The steam comes out because of the train engine.", "Steam locomotives use water, which is heated up to create steam that is used to power the engine.", "Steam engines use heat to create steam which powers a piston.", "The steam is coming out of the train because it is a steam engine.", "The steam is coming out of the train engine.", "The steam is coming out of the engine.", "Steam engines are external combustion engines, where the working fluid is separate from the combustion products.", "A steam train is a train that produces its pulling power through a steam engine.", "Steam locomotives are fueled by burning combustible material – usually coal, wood, or oil – to produce steam in a boiler. The steam moves reciprocating pistons which are mechanically connected to the locomotive's main wheels (drivers). Both fuel and water supplies are carried with the locomotive, either on the locomotive itself or in wagons (tenders) pulled behind.", "Steam is a gas produced by the heating of water to its boiling point.", "The steam is coming out because of the water in the boiler.", "Steam is caused by the burning of coal.", "The heat of the steam engine is caused by the burning of coal.", "Steam locomotives use steam engines to move the train.", "Steam locomotives use steam engines to move.", "Steam is water vaporized by heat.", "A steam locomotive is a type of railway locomotive that produces its pulling power through a steam engine.", "The steam is caused by the burning of coal.", "A steam locomotive is a locomotive whose primary power source is a steam engine.", "The steam engine uses the force produced by steam pressure to push a piston back and forth inside a cylinder.", "The steam engine uses the force produced by steam pressure to push a piston back and forth inside a cylinder. This pushing force is transformed, by a connecting rod and flywheel, into rotational force for work.", "The steam is coming out because the train is moving.", "Steam is water in the gas phase. It is commonly formed by boiling or evaporating water.", "They are created by boiling water, which creates steam."]