["Umbrellas are used for protection from the rain.", "Umbrellas are used for protection from the rain and sometimes the sun.", "Umbrellas are used as protection against rain.", "Umbrellas are used to protect you from the rain.", "Umbrellas are often used as a protection from the rain.", "Umbrellas are used by people to protect themselves from rain.", "Umbrellas are used to protect people from the rain.", "Umbrellas are used as protection from the sun.", "The umbrella is a device used for protection against rain or sunlight.", "These umbrellas were for protection from the rain.", "Umbrellas were made for people to use when it was raining, so they could protect themselves from getting wet.", "Umbrella is a device used for protection against rain or sunlight.", "Umbrellas were used to protect people from the rain.", "Umbrellas were originally designed to provide protection from the rain.", "Umbrellas protect you from the rain.", "Umbrellas protect from rain.", "The umbrellas are for shade.", "Umbrellas were used to prevent the rain from falling on the people.", "The umbrellas are for providing shade.", "Umbrella is a canopy designed to protect against precipitation. The word umbrella typically refers to a device used for protection from rain.", "Umbrellas were first used for protection from the sun.", "umbrella", "An umbrella or parasol is a folding canopy supported by wooden or metal ribs, which is usually mounted on a wooden, metal, or plastic pole. It is designed to protect a person against rain or sunlight.", "The umbrella or parasol is a folding canopy supported by wooden or metal ribs, which is usually mounted on a wooden, metal, or plastic pole. It is designed to protect a person against rain or sunlight.", "These umbrellas were used as a part of an art installation.", "An umbrella or parasol is a folding canopy supported by wooden or metal ribs, which is usually mounted on a wooden, metal, or plastic pole.", "Umbrella or parasol is a folding canopy supported by wooden or metal ribs, which is usually mounted on a wooden, metal, or plastic pole.", "These umbrellas were for a wedding.", "Umbrellas were first used in China and Egypt.", "Umbrellas were invented in the Far East, probably China, at least 2,000 years ago, and were carried by the Chinese nobility as early as the 4th century BC.", "They were used to protect the people from the rain.", "Umbrellas and parasols are mostly hand-held portable devices sized for personal use.", "Umbrellas and parasols are primarily hand-held portable devices sized for personal use.", "Umbrellas and parasols are mostly hand-held portable devices sized for personal use. The largest hand-portable umbrellas are golf umbrellas. Umbrellas can be divided into two categories: fully collapsible umbrellas, in which the metal pole supporting the canopy retracts, making the umbrella small enough to fit in a handbag; and non-collapsible umbrellas, in which the support pole cannot retract and only the canopy can be collapsed. Another distinction can be made between manually operated umbrellas and spring-loaded automatic umbrellas which spring open at the press of a button", "These were for shade."]