["The bird is a species of bird that is a small bird.", "The species of bird is a seagull.", "The bird is a gull.", "The bird is a sparrow.", "The bird is a common gull.", "The bird is a seagull.", "the bird is a small bird.", "The bird is a pigeon.", "A bird is a feathered, winged, bipedal, warm-blooded, egg-laying, vertebrate.", "A bird is a warm-blooded egg-laying vertebrate distinguished by the possession of feathers, wings, and a beak and (typically) by being able to fly.", "A bird is a featherless, warm-blooded, egg-laying vertebrate distinguished by the possession of feathers, forelimbs modified as wings, and a horny beak.", "The bird is a species of bird in the family Corvidae.", "A robin is a small bird.", "The bird is a raven.", "It is a bird of the crow family, Corvidae.", "The oystercatcher is a group of waders forming the family Haematopodidae, which has a single genus, Haematopus.", "The Eurasian oystercatcher (Haematopus ostralegus), also known as the common pied oystercatcher, or palaearctic oystercatcher, or just oystercatcher, is a wader in the oystercatcher bird family Haematopodidae. It is the most widespread of the oystercatchers, with three subspecies breeding in Europe, Asia and the coasts of northwest Africa and North America.", "The bird is standing on the ground.", "The red-winged blackbird is a passerine bird of the family Icteridae found in most of North and much of Central America. It may winter as far north as Pennsylvania and British Columbia, but northern populations are migratory.", "The herring gull (Larus argentatus) is a large gull of the family Laridae. This bird is found in North America and Europe.", "The American robin (Turdus migratorius) is a migratory songbird of the true thrush genus and Turdidae, the wider thrush family.", "Birds are a group of endothermic vertebrates, characterised by feathers, toothless beaked jaws, the laying of hard-shelled eggs, a high metabolic rate, a four-chambered heart, and a strong yet lightweight skeleton.", "A seagull is a bird. Seagulls are a type of gull.", "The species is the Rock Pigeon, also known as the Rock Dove.", "The bird is called a penguin. Penguins are a group of aquatic, flightless birds living almost exclusively in the Southern Hemisphere.", "The bird is a penguin.", "The American robin is a migratory songbird of the thrush family.", "The American robin is a migratory songbird of the true thrush genus and Turdidae, the wider thrush family.", "The black-legged kittiwake is a seabird species in the gull family Laridae. This species was first described by Linnaeus in his Systema Naturae in 1758 as Larus tridactylus.", "The Sanderling is a small wading bird.", "The yellow-legged gull is a large gull, closely related to the western gull, from which it was only recently split.", "The species is Black-legged Kittiwake.", "The species of bird is a blue jay.", "The peregrine falcon is a cosmopolitan bird of prey in the family Falconidae.", "The bird is a puffin. Puffins are any of three small species of alcids (auks) in the bird genus Fratercula with a brightly coloured beak during the breeding season.", "The Northern Fulmar is a highly abundant seabird found throughout the North Atlantic and North Pacific oceans.", "A species is a group of similar organisms that can mate with each other to produce fertile offspring."]