["The sunglasses brand is Ray-Ban.", "The brand of sunglasses is Ray-Ban.", "The most famous brand of sunglasses is Ray-Ban.", "The sunglasses are Ray-Ban.", "This model is wearing Ray-Ban Wayfarer sunglasses.", "The model is wearing Ray-Ban sunglasses.", "Ray-Ban sunglasses are the best-selling sunglasses in the world.", "The brand of sunglasses is Oakley.", "Ray-Ban is an Italian brand of sunglasses and eyeglasses founded in 1937 by the American company Bausch & Lomb. The brand is best known for their Wayfarer and Aviator lines of sunglasses.", "Ray-Ban, Oakley, Prada, and Gucci are common brands of sunglasses.", "Ray-Ban is an American-founded Italian brand of luxury sunglasses and eyeglasses created in 1936 by the American company Bausch & Lomb. The brand is best known for their Wayfarer and Aviator lines of sunglasses.", "Ray-Ban is an Italian brand of luxury sunglasses and eyeglasses founded in 1937 by the American company Bausch & Lomb.", "Ray-Ban is an American-founded Italian brand of luxury sunglasses and eyeglasses created in 1936 by the American company Bausch & Lomb.", "The woman is wearing Ray-Ban sunglasses.", "Ray-Ban is a brand of sunglasses and eyeglasses founded in 1937 by American company Bausch & Lomb.", "Ray-Ban is a brand of sunglasses and eyeglasses founded in 1937 by the American company Bausch & Lomb. The brand is best known for their Wayfarer and Aviator styles of sunglasses.", "Ray-Ban is a brand of sunglasses and eyeglasses founded in 1937 by the American company Bausch & Lomb.", "Ray-Ban is a brand of sunglasses and eyeglasses founded in 1937 by American company Bausch & Lomb. The brand is best known for their Wayfarer and Aviator lines of sunglasses.", "Ray-Ban, a brand of sunglasses and eyeglasses founded in 1937 by American company Bausch & Lomb.", "She is wearing a pair of Ray-Ban sunglasses.", "The woman is wearing a pair of Ray-Ban sunglasses.", "Prada is an Italian luxury fashion house, specializing in leather handbags, travel accessories, shoes, ready-to-wear, perfumes and other fashion accessories, founded in 1913 by Mario Prada.", "She is wearing Prada.", "Aviator sunglasses are a style of sunglasses that were developed by Bausch & Lomb.", "The sunglasses are black and white.", "A sunglasses company based in Italy.", "Sunglasses are a form of protective eyewear designed primarily to prevent bright sunlight and high-energy visible light from damaging or discomforting the eyes.", "The sunglasses are made by the brand Gucci.", "Sunglasses or sun glasses are a form of protective eyewear designed primarily to prevent bright sunlight and high-energy visible light from damaging or discomforting the eyes.", "Sunglasses, also called sun glasses or sunnies, are a form of protective eyewear designed primarily to prevent bright sunlight and high-energy visible light from damaging or discomforting the eyes.", "Ray-Ban.", "The model is wearing Gucci sunglasses.", "The first sunglasses were invented in China in the 12th century.", "The woman is wearing Dolce & Gabbana sunglasses."]