["The language is English. The food is pizza.", "The neon sign is in English and the foods are pizza.", "The language is English and they are advertising pizza.", "The language is English and the foods are pizza.", "The language is English and the food is pizza.", "The language is Italian. The advertisement is advertising pizza.", "The neon sign is in English and they are advertising pizza.", "The language is german and the food is pizza.", "The sign is in English and it is advertising pizza.", "The sign says: \"PIZZA\" in English.", "The neon sign is in English. It is advertising pizza.", "The language is Italian and the foods are pizza and pasta.", "The advertisement is in English, and it is advertising pizza.", "The language is English and the foods are pizza and tacos.", "The sign is in Spanish and is advertising pizza.", "The advertisement is in English and is advertising pizza.", "The language is Japanese and they are advertising pizza and beer.", "The word pizza is an Italian word.", "The word pizza is from Italian, and in Italian, it means pie.", "The sign advertises pizza, which is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients.", "The language is Japanese, and the foods are being advertised are pizza and ramen.", "The advertisements are in English and advertise food, such as pizza.", "The neon sign is written in the English language. The neon sign is advertising pizza, burgers, and sandwiches.", "The advertisements are in English and they are advertising food.", "The neon sign says \"Pizza\", and the neon text says \"Pizza\" and \"Pizza\".", "The word pizza is a word of Italian origin, which is a flatbread generally topped with tomato sauce and cheese and baked in an oven.", "Italian is a Romance language of the Indo-European language family. Pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients.", "Pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients baked at a high temperature, traditionally in a wood-fired oven.", "Pizza is a savory dish of Italian origin consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients (anchovies, olives, meat, etc.) baked at a high temperature, traditionally in a wood-fired oven.", "The neon sign is in Chinese and it is advertising Chinese food.", "The sign reads 'Pizza', 'Coca Cola' and 'Coffee'.", "The language is English.", "The Pizza is an oven-baked, flat, disc-shaped bread typically topped with a tomato sauce, cheese and various toppings.", "pizza is a type of food typically consisting of a flat, round bread topped with tomato sauce and cheese.", "The language on the advertisement is Chinese.", "The language is Japanese and the foods are Japanese foods.", "The language is Japanese and the foods are probably sushi and ramen.", "The neon lights that are on the sign are called neon lights.", "A neon sign is a lighting display made of glass tubes that have been filled with a gas and bent into the shape of letters or decorative designs. They are used to make eye-catching displays in shops, bars, restaurants, and other places.", "A neon sign is a lighting display made of glass tubes that have been filled with a gas and bent into the shape of letters or decorative designs.", "Italian is a Romance language of the Indo-European language family. Italian descended from the Vulgar Latin of the Roman Empire and, together with Sardinian, is by most measures the Romance language closest to it.", "The English language is the primary language of several countries, including Australia, Canada, New Zealand, the United States, and the United Kingdom, and is widely spoken in some areas of the Caribbean, Africa, and South Asia.", "The most common language spoken in the United States is English.", "Restaurant signs are used to tell the public what foods are being served."]