["They are riding the elephants.", "The elephants are used for transportation.", "People ride elephants for fun.", "Elephants are used for ceremonial purposes, such as weddings, and for riding.", "Elephants are used for work, for transportation, for entertainment and for their ivory.", "The men are on top of the elephants to ride them.", "Elephants are used for transportation in India.", "Elephants are used in many cultures for entertainment, as working animals, and for ceremonial purposes.", "The men are riding the elephants.", "The men are riding the elephants for fun.", "Elephants are used in India for ceremonial purposes.", "The men are on the elephants because they are riding them.", "Men ride on top of elephants in India for tourism purposes.", "These men are on top of the elephants to ride them.", "These men are riding on top of the elephants for transportation.", "Elephants are used as working animals in Asia.", "Elephants are used to carry people in India.", "Elephants are often used for transportation in India.", "Elephants are used for a variety of purposes, including as working animals and for their ivory.", "The men are riding on the elephants.", "The men are riding atop the elephants.", "These men riding on the top of the elephants to control the elephants.", "The men are riding on the elephants so they can see the elephants.", "These men are on top of the elephants to control them.", "The men are riding on top of the elephants.", "Elephant riding is a popular activity in some parts of the world.", "These men are on top of the elephants in order to hunt them.", "Elephant rides are a popular tourist attraction in many parts of the world.", "Elephants are hunted for their ivory tusks.", "Elephant riding is a popular tourist activity in many parts of the world, including India.", "The men are riding on top of the elephants because they are in a parade.", "The elephant is a very useful animal.", "In the Indian subcontinent, elephants are traditionally associated with religious traditions, and have been used in ceremonies.", "Elephants are large mammals of the family Elephantidae and the order Proboscidea.", "The elephant is a symbol of good luck, wisdom, and power.", "Elephants are large mammals of the family Elephantidae and the order Proboscidea. Three species are currently recognised: the African bush elephant, the African forest elephant, and the Asian elephant."]