["The phone is blackberry.", "The blackberry phone is a model of phone.", "The phone is a blackberry.", "The blackberry is a mobile phone.", "The phone is a blackberry phone.", "The model of phone is blackberry.", "The model of phone is a Blackberry.", "This is a blackberry phone.", "Blackberry is a line of smartphones.", "A blackberry is a smart phone.", "The pictured phone is a Blackberry.", "The Blackberry is a line of smartphones and services designed and marketed by BlackBerry Limited.", "A blackberry is a device that can be used to make phone calls.", "The BlackBerry is a line of wireless handheld devices and services designed and marketed by Research In Motion Limited (RIM).", "Blackberry is a line of smartphones, tablets, and services originally designed and marketed by Canadian company BlackBerry Limited", "The Blackberry is a line of wireless handheld devices and services designed and marketed by Research In Motion Limited (RIM) operating as BlackBerry.", "Blackberry.", "BlackBerry is a line of smartphones, tablets, and services originally designed and marketed by Canadian company BlackBerry Limited.", "The BlackBerry is a line of wireless handheld devices and services designed and marketed by BlackBerry Limited, formerly known as Research In Motion Limited (RIM).", "BlackBerry is a line of smartphones, tablets, and services originally designed and marketed by Canadian company BlackBerry Limited (formerly known as Research In Motion Limited).", "Blackberry is a wireless handheld device that allows you to send and receive email, browse the web, and more.", "BlackBerry is a line of smartphones, tablets, and services originally designed and marketed by Canadian company BlackBerry Limited (formerly known as Research In Motion, or RIM).", "Blackberry phones are models of phones that have been produced by Blackberry, which is a Canadian company that produces smartphones and other wireless devices.", "The Blackberry Q10.", "The Blackberry Q10 is a smartphone developed by Blackberry.", "The Blackberry Bold is a line of smartphones developed by BlackBerry, Ltd.", "The BlackBerry Bold is a line of smartphones developed by BlackBerry, Ltd.", "The Blackberry Curve 9360 is a smartphone developed by Research In Motion.", "The Blackberry Bold 9900 is a smartphone developed by Research In Motion. The device, which runs on the BlackBerry OS 7 operating system, is available in black and white.", "The Blackberry 9000 is a smartphone that was released in 2008 by Research in Motion.", "The BlackBerry Q10 is a touchscreen-based QWERTY smartphone developed by BlackBerry, previously known as RIM.", "The BlackBerry KEYone is a touchscreen-based Android smartphone with an integrated hardware keyboard that is manufactured by TCL Corporation under the brand name of BlackBerry Mobile.", "The Blackberry Passport is a phone with a square screen and a physical keyboard.", "The BlackBerry Torch 9810 is a slate smartphone developed by Research In Motion and released on August 3, 2011. The device runs on BlackBerry OS 7 and is a redesign of the BlackBerry Torch 9800.", "The BlackBerry Curve 8520 is a smartphone from the BlackBerry Curve series manufactured in Canada.", "A smartphone is a handheld personal computer.", "A mobile phone, cell phone, cellphone, or hand phone, sometimes shortened to simply mobile, cell or just phone, is a portable telephone that can make and receive calls over a radio frequency link while the user is moving within a telephone service area.", "A phone is a telecommunications device that permits two or more users to conduct a conversation when they are too far apart to be heard directly.", "The phone is a Samsung Galaxy S8. The model number is SM-G950U.", "The Apple iPhone is a line of smartphones designed and marketed by Apple Inc."]