["A company called International Trucks is a company that makes trucks.", "A truck is a motor vehicle designed to transport cargo.", "A trucking company is a company that provides trucking services for shippers.", "The Mack Trucks, Inc., is an American truck manufacturer founded in 1900. Currently a subsidiary of Volvo.", "The company is Mack Trucks, Inc., is an American truck manufacturing company and a former manufacturer of buses and trolley buses.", "Mack Trucks, Inc., is an American truck–manufacturing company and a former manufacturer of buses and trolley buses.", "Mack Trucks, Inc., is an American truck manufacturing company and a former manufacturer of buses and trolley buses.", "Mack Trucks is an American truck manufacturing company and a former manufacturer of buses and trolley buses.", "International Trucks is a brand of medium-duty, over-the-road, and severe-service commercial trucks currently manufactured by the International Truck and Engine Corporation subsidiary of the Navistar International Corporation holding company, formerly known as the International Harvester Company which was formed in 1902.", "The company that makes this truck is Mack Trucks.", "Mack Trucks is an American truck-manufacturing company and a former manufacturer of buses and trolley buses.", "Mack Trucks, Inc., is an American truck manufacturer founded in 1900.", "The company that owns the truck is Waste Management.", "This truck works for the company called Mack.", "International Trucks is an American truck manufacturer with over a century of experience in the industry. The company is a subsidiary of Navistar International Corporation, a holding company that was formerly a manufacturer of military and commercial vehicles.", "Mack Trucks, Inc., is an American truck–manufacturing company and a former manufacturer of buses and trolley buses. Founded in 1900 as the Mack Brothers Company, it manufactured its first truck in 1907 and adopted its present name in 1922.", "The Mack Trucks are a truck manufacturing company in the United States, which has its headquarters in Greensboro, North Carolina.", "The trucks are Mack trucks.", "International Trucks is a brand of medium-duty, over-the-road, and severe-service commercial trucks currently manufactured by the International Truck and Engine Corporation subsidiary of the Navistar International Corporation holding company, formerly known as the International Harvester Company (IHC or IH) which was formed in 1902.", "The truck is a Mack truck.", "This truck works for Waste Management.", "International is a brand of medium-duty, over-the-road, and severe service commercial trucks currently manufactured by the International Truck and Engine Corporation subsidiary of the Navistar International Corporation holding company, formerly known as the International Harvester Company (IHC) which was formed in 1902.", "International is a brand of medium-duty, over-the-road, and severe service commercial trucks currently manufactured by the International Truck and Engine Corporation subsidiary of the Navistar International Corporation holding company, formerly known as the International Harvester Company.", "International is a truck manufacturer.", "International Truck and Engine Corporation is the operating company of Navistar International Corporation.", "International Truck is a brand of medium-duty, over-the-road, and off-highway trucks manufactured by Navistar International.", "International Harvester Company (IHC or IH; now Navistar International Corporation was an American manufacturer of agricultural machinery, construction equipment, trucks, and household and commercial products.", "International Harvester Company (IHC or IH; now Navistar International Corporation was an agricultural machinery, construction equipment, vehicle, commercial truck, and household and commercial products manufacturer.", "International Harvester Company was a United States manufacturer of agricultural machinery, construction equipment, trucks, and household and commercial products.", "A truck or lorry is a motor vehicle designed to transport cargo.", "A garbage truck or dustcart refers to a truck specially designed to collect municipal solid waste and haul the collected waste to a solid waste treatment facility such as a landfill.", "A truck or lorry is a motor vehicle designed to transport cargo. Trucks vary greatly in size, power, and configuration.", "The company is Waste Management.", "A dump truck, known also as a dumper truck or tipper truck, is used for taking dumps (such as sand, gravel, or demolition waste) for construction.", "Waste Management is an American waste management, comprehensive waste, and environmental services company in North America.", "Peterbilt Motors Company, founded in 1939, is an American manufacturer of medium- and heavy-duty Class 5 through Class 8 trucks headquartered in Denton, Texas.", "The truck is parked by a curb."]