["Ultimate Frisbee is a team sport played with a flying disc.", "Ultimate Frisbee is a non-contact team sport played with a flying disc (Frisbee).", "Ultimate Frisbee is a non-contact team sport played with a flying disc.", "Ultimate frisbee is a non-contact team sport played with a flying disc (frisbee). Ultimate was developed in 1968 by a group of students at Columbia High School in Maplewood, New Jersey, USA.", "Ultimate, originally known as ultimate frisbee, is a non-contact team sport originally played by players with a flying disc.", "An ultimate disc is a flying disc used in the sport of ultimate.", "Ultimate is a non-contact team sport played with a flying disc (frisbee).", "Ultimate is a non-contact team sport played with a flying disc (Frisbee).", "Ultimate (originally known as ultimate frisbee) is a non-contact team sport played with a flying disc (frisbee). Ultimate was developed in 1968 by a group of students at Columbia High School in Maplewood, New Jersey.", "Ultimate is a non-contact team sport played with a flying disc (frisbee). Ultimate was developed in 1968 by a group of students at Columbia High School in Maplewood, New Jersey.", "The frisbee is a disc that is thrown and caught for recreation and as a sport.", "Ultimate is a non-contact team sport played with a flying disc (frisbee). Points are scored by passing the disc to a teammate in the opposing end zone. Other basic rules are that players must not take steps while holding the disc, and interceptions, incomplete passes, and passes out of bounds are turnovers.", "Ultimate is a non-contact team sport played with a flying disc.", "Ultimate is a team sport played with a flying disc.", "A frisbee is a gliding toy or sporting item that is generally plastic and roughly 8 to 10 inches in diameter with a lip, used recreationally and competitively for throwing and catching, for example, in flying disc games.", "Ultimate is played by two teams with a flying disc on a field with end zones in which each team defends.", "The man is playing ultimate frisbee.", "He is playing with the disc.", "The disc is a flat, round object that is used in many sports. It is thrown, caught, kicked, or hit with a stick, and sometimes it is used as a weapon.", "A flying disc or frisbee is a gliding toy or sporting item that is generally plastic and roughly 20 to 25 centimetres in diameter with a lip.", "A frisbee is a gliding toy or sporting item that is generally plastic and roughly 8 to 10 inches in diameter with a pronounced lip.", "The man is playing with the disc.", "A disc is a flat, round object that can be used for a variety of purposes.", "The frisbee is being thrown by the man."]