["The type of pastry is donut.", "Doughnuts are a type of pastry.", "A donut is a type of pastry.", "Donuts are a type of pastry.", "A doughnut or donut (both: US /ˈdoʊnət/ or UK /ˈdʌnət/) is a type of fried dough confectionery or dessert food.", "A doughnut or donut is a type of fried dough confectionery or dessert food.", "A doughnut or donut is a type of fried dough confection or dessert food.", "A donut or doughnut is a type of fried dough confectionery or dessert food.", "A donut or doughnut is a type of fried dough confection or dessert food. The doughnut is popular in many countries and prepared in various forms as a sweet snack that can be homemade or purchased in bakeries, supermarkets, food stalls, and franchised specialty outlets.", "A donut or doughnut is a type of fried dough confectionery or dessert food. The doughnut is popular in many countries and prepared in various forms as a sweet snack that can be homemade or purchased in bakeries, supermarkets, food stalls, and franchised specialty vendors.", "A doughnut or donut is a type of fried dough confection or dessert food. The doughnut is popular in many countries and prepared in various forms as a sweet snack that can be homemade or purchased in bakeries, supermarkets, food stalls, and franchised specialty vendors.", "A doughnut or donut is a type of fried dough confection or dessert food. The doughnut is popular in many countries and is prepared in various forms as a sweet snack that can be homemade or purchased in bakeries, supermarkets, food stalls, and franchised specialty outlets.", "A doughnut or donut is a type of fried dough confectionery or dessert food. The doughnut is popular in many countries and prepared in various forms as a sweet snack that can be homemade or purchased in bakeries, supermarkets, food stalls, and franchised specialty outlets.", "Doughnuts (also spelled donuts) are a type of fried dough confectionery or dessert food.", "Doughnuts (also written donuts) are a type of fried dough confectionery or dessert food.", "A donut is a type of fried dough confectionery or dessert food.", "Doughnuts are usually deep fried from a flour dough, and typically either ring-shaped or without a hole and often filled.", "A pastry is a baked food, usually sweet, made of dough.", "A pastry is a baked good.", "Pastry is a dough of flour, water and shortening that may be savoury or sweetened.", "Pastries are baked or fried foods that are made of dough or batter and usually are sweet."]