["A tree is a tall plant with a trunk and branches made of wood.", "The tree in this picture is a pine tree.", "The tree is a conifer.", "The tree is a pine tree.", "A tree is a plant form that can be found in many different shapes and sizes.", "There are many kinds of trees, such as oak, pine, apple, and so on.", "A tree is a tall plant with a trunk and branches made of wood. Trees can live for many years.", "A pine tree is shown in this picture.", "It is a tree.", "A tree is a perennial plant with an elongated stem, or trunk, supporting branches and leaves in most species. In some usages, the definition of a tree may be narrower, including only woody plants with secondary growth, plants that are usable as lumber or plants above a specified height. In wider definitions, the taller palms, tree ferns, bananas, and bamboos are also trees. Trees are not a taxonomic group but include a variety of plant species that have independently evolved a woody trunk and branches as a way to tower above other plants to compete for sunlight.", "A tree is a plant form that can be found in many different orders and families of plants. Trees show many growth forms, leaf type and shape, bark traits and organs.", "A tree is a perennial plant with an elongated stem, or trunk, supporting branches and leaves in most species. In some usages, the definition of a tree may be narrower, including only woody plants with secondary growth, plants that are usable as lumber or plants above a specified height. In wider definitions, the taller palms, tree ferns, bananas, and bamboos are also trees. Trees are not a taxonomic group but include a variety of plant species that have independently evolved a woody trunk and branches as a way to tower above other plants to compete for sunlight. Trees tend to be long-lived,", "A tree is a perennial plant with an elongated stem, or trunk, supporting branches and leaves in most species.", "Trees are tall plants with woody stems. They have leaves, flowers, and fruit.", "Trees are tall plants with woody trunks.", "The skateboard is a type of skateboard used primarily for the activity of skateboarding.", "A skateboard is a type of sports equipment used primarily for the sport of skateboarding.", "The oak tree is a tree or shrub in the genus Quercus.", "A tree is a perennial plant with an elongated stem, or trunk, supporting branches and leaves in most species. In some usages, the definition of a tree may be narrower, including only woody plants with secondary growth, plants that are usable as lumber or plants above a specified height.", "The tree is an oak tree.", "The tree shown in the picture is an oak tree.", "Evergreen trees are coniferous trees which have leaves in all seasons.", "A pine is any conifer in the genus Pinus, /ˈpiːnuːs/, of the family Pinaceae. Pine trees are evergreen, coniferous resinous trees (or, rarely, shrubs) growing 3–80 m (10–260 ft) tall, with the majority of species reaching 15–45 m (50–150 ft) tall.", "The skateboarder is skating on the sidewalk.", "A maple tree is a deciduous tree that is native to North America. It has a broad, rounded shape and is known for its bright red fall color.", "Trees are not a taxonomic group but include a variety of plant species that have independently evolved a woody trunk and branches as a way to tower above other plants to compete for sunlight.", "The most common tree in the world is the oak.", "The tree is a palm tree.", "There are over 100 species of pine trees.", "A pine is any conifer in the genus Pinus, /ˈpiːnuːs/, of the family Pinaceae.", "The maple is a tree belonging to the genus Acer and the family Sapindaceae.", "A palm tree is any of the numerous plants of the family Palmae, a large family of flowering plants, the only family in the monocot order Arecales."]