["The ingredients are pepperoni, cheese, and dough.", "The ingredients are pepperoni, bread, cheese, tomato sauce and soda.", "The ingredients are pepperoni, cheese, and sauce.", "The ingredients used in this food are: dough, sauce, cheese, pepperoni, and oil.", "The ingredients used in this food are pepperoni and cheese.", "The ingredients in this food are pepperoni and cheese.", "The food contains pepperoni, cheese, and sauce.", "pepperoni, pizza sauce, cheese.", "Pizza is made from dough, tomato sauce, cheese, and toppings such as pepperoni, sausage, mushrooms, onions, and peppers.", "The main ingredients of pepperoni are pork and beef. It also contains salt, spices, garlic, sugar, and sodium nitrate.", "This is a pepperoni pizza.", "Pepperoni pizza is a type of pizza that is topped with pepperoni.", "Pizza ingredients are simple: flour, water, yeast, salt and olive oil.", "The ingredients of pepperoni are pork, beef, salt, dextrose, spices, garlic powder, lactic acid starter culture, and BHA, BHT, and citric acid as preservatives.", "The ingredients of the food are: garlic, salt, pepper, onion, and pepper.", "Pepperoni is an American variety of salami, made from cured pork and beef mixed together and seasoned with paprika or other chili pepper.", "Pizza sauce is made from tomatoes, olive oil, garlic, and herbs.", "Pepperoni is a spicy Italian-American variety of salami, made from cured pork and beef mixed together.", "pepperoni is a type of sausage.", "Ingredients in soda are carbonated water, high fructose corn syrup, caramel color, phosphoric acid, natural flavors, and caffeine.", "The ingredients in a soda are carbonated water, sweeteners, flavors and preservatives.", "A pepperoni is a type of salami, usually made from cured pork and beef mixed together.", "Pepperoni is a variety of salami, made from cured pork and beef mixed together.", "Soda is made of carbonated water and sweeteners.", "Pepperoni is a cured dry sausage made from beef and pork.", "Pepperoni is a cured dry sausage similar to the spicy salamis of southern Italy.", "Soda is made from soda water, sugar, and flavoring.", "Tomatoes, cheese, basil, and dough are used in pizza.", "Pizza is made with dough, tomato sauce, cheese and other toppings.", "Pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients baked at a high temperature, traditionally in a wood-fired oven.", "The ingredients of the food are salt, flour, yeast, water, and oil.", "Soda is a soft drink made with carbonated water.", "Pizza is a savory dish of Italian origin, consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and various other ingredients (anchovies, olives, meat, etc.) baked at a high temperature, traditionally in a wood-fired oven.", "Salt, pepper, and oregano are the most common seasonings used to flavor pizza.", "Pizza is a traditional Italian dish consisting of a yeasted flatbread typically topped with tomato sauce and cheese and baked in an oven.", "This soda is made with water, high fructose corn syrup, and carbon dioxide.", "Ingredients are used in food.", "The ingredients are flour, yeast, water, salt, and olive oil.", "The ingredients of this food are: water, sugar, and caramel color.", "The main ingredients in the bread are flour and water.", "Flour, water and yeast are the basic ingredients in bread."]