["The most famous country for surfing is Hawaii.", "Australia is the most famous country in the world for surfing.", "Surfing is a popular sport in many countries, including Australia, Brazil, Canada, and the United States.", "The sport of surfing originated in Hawaii, and is still the most popular surf destination in the world.", "The United States is the most famous country in the world for surfing.", "Surfing is most popular in Australia, Hawaii, California and South Africa.", "The United States is most famous for surfing.", "Surfing is most popular in Hawaii.", "Hawaii is famous for surfing.", "Surfing originated in Hawaii and is now popular around the world.", "Surfing is most closely associated with Hawaii.", "Surfing originated in Hawaii, and is practiced most commonly in Hawaii, Australia, South Africa, New Zealand, and the United States.", "Surfing originated in Hawaii.", "Hawaii is the birthplace of modern surfing.", "Surfing first appeared in Hawaii.", "Hawaii is the most famous country for this sport.", "Hawaii is most famous for this sport.", "Australia has a large surfing community.", "Surfing originated in Polynesia, and the sport was practiced among the aboriginal peoples of Australia and Peru.", "Surfing originated in Polynesia, where it was practiced by all members of society.", "Surfing is a surface water sport in which the surfer rides a surfboard on the crest and face of a wave which is carrying the surfer towards the shore.", "Surfing is a surface water sport in which the wave rider, referred to as a surfer, rides on the forward or deep face of a moving wave, which is usually carrying the surfer towards the shore. Waves suitable for surfing are primarily found in the ocean, but can also be found in lakes or rivers in the form of a standing wave or tidal bore. However, surfers can also utilize artificial waves such as those from boat wakes and the waves created in artificial wave pools.", "The United States of America is the most famous country for this sport.", "Surfing is a surface water sport in which the wave rider, referred to as a surfer, rides on the forward or deep face of a moving wave, which is usually carrying the surfer towards the shore.", "Surfing is a surface water sport in which the wave rider, referred to as a surfer, rides on the forward or deep face of a moving wave, which usually carries the surfer towards the shore.", "Surfing is a surface water sport in which the wave rider, referred to as a surfer, rides on the forward or deep face of a moving wave.", "The country in the world most famous for this sport is Australia.", "Australia is most famous for this sport.", "Australia is the most famous country in the world.", "Australia is a country in the southern hemisphere.", "The United States of America is a country in North America. It is the world's third-largest country by total area and the fourth-largest country by land area.", "The United States of America is a country in North America.", "Hawaii is a state of the United States of America located in the Pacific Ocean. It is the only U.S. state located outside North America and the only island state.", "Brazil is a country in South America."]