["A clock is a device that tells the time.", "A clock is a device used to measure, keep, and indicate time.", "The clock is a device that tells the time.", "A clock is an instrument to measure, keep, and indicate time.", "The clock is a device that measures, keeps, and indicates time.", "An analog clock has 12 numbers on it.", "A clock is an instrument used to measure, keep, and indicate time. The clock is one of the oldest human inventions, meeting the need to measure intervals of time shorter than the natural units: the day, the lunar month, and the year.", "A clock is a device used to measure, keep, and indicate time. The clock is one of the oldest human inventions, meeting the need to consistently measure intervals of time shorter than the natural units: the day, the lunar month, and the year.", "A clock is an instrument to measure, keep, and indicate time. The clock is one of the oldest human inventions, meeting the need to measure intervals of time shorter than the natural units: the day, the lunar month, and the year.", "The clock has 10 numbers.", "A clock is an instrument used to measure, keep, and indicate time.", "The clock has 12 numbers on it.", "A clock is a device used to measure, keep, and indicate time. Clocks are often found in households and offices, and they can be found in many other places, including classrooms, factories, and on mobile phones.", "The clock has 12 numbers.", "Clocks have 12 numbers.", "The clock is a timepiece that measures the passage of time. In the strictest sense, a clock is an instrument for measuring time.", "The clock has twelve numbers on it.", "An analog clock is a clock which displays the time of day by the position of rotating hands.", "An analog clock is a type of clock that displays the time of day with hands on a round dial.", "The clock has a total of 12 numbers on it.", "An analog clock is a clock that measures the passage of time by displaying the time with a dial or dials and moving hands.", "A clock face or dial is the part of an analog clock (or watch) that displays the time through the use of a fixed-numbered dial or dials and moving hands.", "The number of numbers on a clock is 12.", "An analog clock is a clock that displays the time through the use of a fixed-numbered dial or dials and moving hands.", "Analog clocks usually indicate time using angles.", "There are 12 numbers on a clock.", "Most clocks have a 12-hour face, and indicate AM or PM.", "An analog clock is a type of clock that displays the time with a dial whose hands rotate to point to the hours, minutes, and seconds.", "The number of numbers on a clock is twelve.", "There are 12 numbers on this item."]