["The most famous professional athlete of this sport who is african american is Shaun White.", "Shaun White is the most famous professional athlete of this sport who is african american.", "The most famous professional athlete of this sport who is african american is Bode Miller.", "Bode Miller is the most famous professional athlete of this sport who is african american.", "The most famous professional athlete of this sport who is african american is Shawn White.", "The most famous professional athlete of this sport who is african american is Tiger Woods.", "Tiger Woods is the most famous professional athlete of this sport who is african american.", "Bode Miller is a professional athlete who is african american.", "The most famous professional athlete of this sport who is African American is Michael Jordan.", "The most famous professional athlete of this sport is Tiger Woods.", "Vonetta Flowers is the most famous professional athlete of this sport who is african american.", "Tiger Woods is a famous professional athlete.", "Bode Miller is an American former World Cup alpine ski racer and Olympic gold medalist.", "Bode Miller is an American former World Cup alpine ski racer.", "Bode Miller is an American former World Cup alpine ski racer. He is an Olympic and World Championship gold medalist, a two-time overall World Cup champion in 2005 and 2008, and the most successful male American alpine ski racer of all time.", "Bode Miller is a former World Cup alpine ski racer with the U.S. Ski Team. He is an Olympic and World Championship gold medalist, a two-time overall World Cup champion in 2005 and 2008, and the most successful male American alpine ski racer of all time.", "Bode Miller is an American alpine ski racer and Olympic and World Championship gold medalist.", "Bode Miller is a professional skier.", "Shaun White is an American professional snowboarder and skateboarder.", "Shaun White is an American professional snowboarder and skateboarder. He is a three-time Olympic gold medalist.", "Shaun White is a professional snowboarder and skateboarder.", "Shaun White is a professional snowboarder.", "Shaun White is an American professional snowboarder, skateboarder and musician. He is a three-time Olympic gold medalist. He holds the record for the most X-Games gold medals and most Olympic gold medals by a snowboarder, and he has won 10 ESPY Awards.", "The most famous African American figure skater is Debi Thomas.", "Tiger Woods", "Tiger Woods is a professional golfer.", "The first African American to win an Olympic medal in alpine skiing was Daron Rahlves.", "Vonetta Flowers is the first African American to win a gold medal in the Winter Olympics."]