["Some people put stickers on a street sign.", "The sign has many stickers on it.", "The stickers are put on the sign.", "Some people put stickers on the sign.", "People put stickers on a sign.", "People put stickers on this sign.", "The sign was covered in stickers.", "People put stickers on the sign.", "people put stickers on the sign.", "They put stickers on the sign.", "stickers on a yellow street sign all over a yellow sign", "People put stickers on signs.", "Stickers are adhesive labels with illustrations, words, or designs on them.", "A sticker is a type of label: a piece of printed paper or plastic with pressure sensitive adhesive on one side. They can be used for decoration, depending on the situation.", "Stickers are images or labels that are attached to a surface. They are used for decoration and for practical purposes.", "Stickers are a type of label: a piece of printed paper, plastic, vinyl, or other material with pressure sensitive adhesive on one side. They can be used for decoration, depending on the situation.", "A sticker is a type of label: a piece of printed paper, plastic, vinyl, or other material with pressure sensitive adhesive on one side. They can be used for decoration, depending on the situation.", "Stickers are a type of label: a piece of printed paper or plastic with pressure sensitive adhesive on one side.", "Stickers are images or labels that can be placed on a variety of objects and surfaces.", "A sticker is a type of label: a piece of printed paper, plastic, vinyl, or other material with pressure sensitive adhesive on one side. They can be used for decoration, depending on the situation. They can come in many different shapes, sizes and colours and are put on things such as lunchboxes, in children's rooms, on paper, lockers, notebooks and so on.", "A sticker is a type of label: a piece of printed paper or plastic with pressure sensitive adhesive on one side.", "A sticker is a type of label: a piece of printed paper, plastic, vinyl, or other material with pressure sensitive adhesive on one side.", "Stickers", "The stickers were put on the sign to make it look like a man.", "Stickers.", "The stickers were put on the sign because it was a political statement.", "Stickers are images that can be added to your chat messages by selecting them from a menu.", "The stickers are depicting the men.", "A street sign is a traffic sign that indicates the name of a street or intersection.", "A street sign is a traffic sign that indicates the name of a street, or where two streets intersect.", "The street sign is a type of traffic sign used to indicate the name of a street, boulevard, or other road.", "A street sign is a traffic sign that indicates the name of a street, highway, or other route that is usually placed at the beginning of a street or road. The street sign usually shows the name of the road, but often also shows the name of the town or village in which the street is located.", "The street sign is a caution sign.", "A sign is an object, quality, event, or entity whose presence or occurrence indicates the probable presence or occurrence of something else.", "A street or road name or odonym is an identifying name given to a street. The street name usually forms part of the address (though addresses in some parts of the world, notably most of Japan, make no reference to street names). Buildings are often given numbers along the street to further help identify them."]