["A supermarket is a self-service shop offering a wide variety of food and household products, organized into sections and shelves.", "a supermarket is a self-service shop offering a wide variety of food and household products, organized into sections and shelves.", "A supermarket is a self-service shop offering a wide variety of food and household merchandise, organized into departments.", "A supermarket is a self-service shop offering a wide variety of food and household products, organized into sections.", "A supermarket is a self-service shop offering a wide variety of food and household products, organized into aisles.", "A supermarket is a self-service shop offering a wide variety of food, beverages and household products, organized into sections and shelves.", "A supermarket is a self-service shop offering a wide variety of food and household products, organized into sections and shelves. It is larger and has a wider selection than earlier grocery stores, but is smaller and more limited in the range of merchandise than a hypermarket or big-box market.", "A supermarket is a self-service shop offering a wide variety of food and household products, organized into sections. It is larger in size and has a wider selection than earlier grocery stores, but is smaller and more limited in the range of merchandise than a hypermarket or big-box market.", "A supermarket is a self-service shop offering a wide variety of food and household products, organized into aisles. It is larger in size and has a wider selection than earlier grocery stores, but is smaller and more limited in the range of merchandise than a hypermarket or big-box market.", "A supermarket is a self-service shop offering a wide variety of food and household products, organized into aisles. It is larger in size and has a wider selection than a traditional grocery store, but is smaller and more limited in the range of merchandise than a hypermarket or big-box market.", "A supermarket is a large form of the traditional grocery store.", "A grocery store is a retail store that primarily sells food.", "A grocery store is a store that sells food.", "It is a supermarket.", "Supermarkets are self-service shops offering a wide variety of food and household products, organized into sections.", "A grocery store or grocer's shop is a retail shop that primarily sells food.", "A grocery store is a retail store that primarily sells food. A grocer is a bulk seller of food.", "This is a grocery store."]