["Airplanes are commonly seen flying in the sky.", "Airplanes are usually seen in the sky.", "Air shows are events where aircraft are exhibited.", "Air shows are held at airfields or air bases where aircraft can display their flying and maneuvering abilities.", "An air show is a public event where aircraft are exhibited.", "Air shows are held at airfields or air bases where aircraft can be displayed on the ground and in the air.", "An air show, (or airshow, air fair, air tattoo) is a public event where aircraft are displayed.", "An air show is a public event at which aviators display their flying skills and the capabilities of their aircraft to spectators, usually by means of aerobatics.", "An air show, (or airshow, air fair, air tattoo) is a public event where aircraft are exhibited. They often include aerobatics demonstrations, without they are called \"static air shows\" with aircraft parked on the ground.", "An air show, (or airshow, air fair, air tattoo), is a public event where aircraft are exhibited.", "An air show is a public event at which aviators display their flying skills and the capabilities of their aircraft to spectators in aerobatics.", "An air show is a public event where aircraft are exhibited. They often include aerobatic displays, without they are called \"static air shows\" with aircraft parked on the ground.", "The air show is an event at which aviation displays take place.", "An air show is a public event at which aviators display their flying skills and the capabilities of their aircraft to spectators, usually by means of aerobatics. Air shows without aerobatic displays, having only aircraft displayed parked on the ground, are called \"static air shows\".", "Air show is an event at which aviators display their flying skills and the capabilities of their aircraft to spectators, usually by means of aerobatics.", "Air shows are events at which aviators display their flying skills and the capabilities of their aircraft to spectators, usually by means of aerobatics.", "An air show, (or air fair, air tattoo) is a public event where aircraft are exhibited. They often include aerobatics demonstrations, without they are called \"static air shows\" with aircraft parked on the ground.", "Aircraft are often seen at an airport.", "An airshow is a public event where aircraft are exhibited.", "An air show, (or air fair, air tattoo) is a public event where aircraft are exhibited.", "Airplanes are seen in airports.", "One might see these in an air show.", "You might see these at an air show.", "An airshow, (or air fair, air tattoo), is a public event where aircraft are exhibited.", "An airshow is an event at which aviators display their flying skills and the capabilities of their aircraft to spectators in aerobatics.", "You can see jet planes in the sky.", "Airshow", "At an air show.", "The International Air Show is an air show held at the Farnborough Airport in England. It is held every two years, alternating with the Paris Air Show.", "A jet aircraft is an aircraft propelled by jet engines.", "You can see these in the sky.", "The airplane is an aircraft that is propelled forward by thrust from a jet engine or propeller.", "A jet plane is a fixed-wing aircraft propelled by jet engines.", "You might see these in an airport.", "These are seen in the sky.", "Airplanes are usually found in airports.", "The picture is of the sky.", "The airplane is a flying machine.", "Military aircraft are aircraft that are operated by a legal or insurrectionary armed service of any type.", "In the sky.", "A jet engine is a type of reaction engine discharging a fast-moving jet that generates thrust by jet propulsion.", "The sky is the limit.", "A military air base is an aerodrome used by a military force for the operation of military aircraft."]