["a stove is a kitchen appliance.", "A stove is a heating device that is used to cook food.", "A stove is a device that produces heat.", "Electric stoves are kitchen appliances that use electricity to heat food.", "A stove is a heating device.", "The electric stove is a device that converts electrical energy into heat energy.", "electric stove", "A stove is an enclosed space in which fuel is burned to provide heating, either to heat the space in which the stove is situated, or to heat the stove itself and items placed on it.", "A stove is a device in which heat energy is converted to heat energy.", "A stove is a device in which heat energy is converted to heat for heating purposes.", "The stove is electric.", "The stove is a gas stove.", "The oven is a gas oven and the stove is an electric stove.", "The stove is gas.", "Electric stove: An electric stove or electric range is a stove with an integrated electrical heating device to cook and bake.", "Gas stoves tend to cook food faster than electric.", "Gas stoves are typically more expensive than electric stoves, but they heat up faster and cook food more evenly.", "Gas stoves are usually powered by natural gas or propane.", "Gas stove, a stove that is fuelled by combustible gas.", "A gas stove is a stove that is fuelled by combustible gas such as syngas, natural gas, propane, butane, liquefied petroleum gas or other flammable gas.", "Electric stoves are typically cheaper than gas stoves.", "Gas stoves have a few advantages over electric stoves. First, gas stoves are cheaper to operate.", "Gas stove is a stove that is fueled by combustible gas such as syngas, natural gas, propane, butane, liquefied petroleum gas or other flammable gas.", "The advantage of an electric stove is that it is safer, cleaner, and easier to use.", "An electric oven or electric cooker is a kitchen appliance used for baking or roasting and consists of an oven and a stove.", "The oven is electric.", "Stoves come in a variety of sizes and shapes and may be free-standing, fitting into a corner, or built into a wall or kitchen unit.", "The kitchen is usually equipped with a stove, a sink with hot and cold running water, a refrigerator, and worktops and kitchen cabinets arranged according to a modular design.", "An oven is a thermally insulated chamber used for the heating, baking, or drying of a substance, and most commonly used for cooking.", "In a typical large kitchen, there might be a large gas burner with six or eight burners.", "A kitchen is a room or part of a room used for cooking and food preparation in a dwelling or in a commercial establishment."]