["Frequent flyer is a loyalty program offered by an airline.", "A frequent flyer is a customer of an airline's frequent-flyer program. Frequent flyers often earn mileage points for flying on the same airline or its partners.", "Frequent flyer miles are promotional offers made by airlines to encourage people to fly more often.", "Frequent flyer programs are a loyalty program offered by an airline. These programs are designed to encourage airline customers enrolled in the program to accumulate points (also called miles, kilometers, or segments) which may then be redeemed for air travel or other rewards.", "The frequent-flyer program is a loyalty program offered by an airline. Many airlines have frequent-flyer programs designed to encourage airline customers enrolled in the program to accumulate points (also called miles, kilometers, or segments) which may then be redeemed for air travel or other rewards.", "A frequent flyer is a person who travels frequently by a particular airline.", "A frequent flyer program is a loyalty program offered by an airline. Many airlines have frequent flyer programs designed to encourage airline customers enrolled in the program to accumulate points (also called miles, kilometers, or segments) which may then be redeemed for air travel or other rewards.", "A frequent flyer program is a loyalty program offered by an airline.", "A frequent flyer is a person who travels frequently by a particular airline or airlines as a passenger.", "Frequent flyer programs are marketed by airlines to encourage airline customers enrolled in the program to accumulate points (also called miles, kilometers or segments) which may then be redeemed for air travel or other rewards.", "Frequent flyer programs are marketed by airlines to encourage airline customers enrolled in the program to accumulate points (also called miles, kilometers, or segments) which may then be redeemed for air travel or other rewards.", "Frequent flyer programs are marketing programs operated by airlines that award frequent flyers with free flights, upgrades, and other benefits.", "Frequent flyer miles are part of a loyalty program by an airline to reward frequent fliers.", "A frequent flyer is a person who travels frequently by air.", "A frequent flyer is a person who travels by air frequently.", "The term \"frequent flyer\" is used in the United States to refer to a person who travels frequently on a particular airline or hotel chain.", "Frequent flyer programs are structured marketing efforts that reward, and therefore encourage, loyal patronage to a particular airline.", "Frequent flyer miles, also known as air miles, are part of a loyalty program operated by an airline. Points are earned on flights or with affiliated partners and can be redeemed for free flights or upgrades on flights.", "Some airlines offer discounts to frequent fliers, sometimes called \"frequent fliers\".", "Frequent flyer programs are structured marketing efforts that reward, and therefore encourage, loyal patronage.", "A frequent flyer program (FFP) is a loyalty program offered by an airline. Many airlines have frequent flyer programs designed to encourage airline customers enrolled in the program to accumulate points (also called miles, kilometers, or segments) which may then be redeemed for air travel or other rewards.", "A frequent flier, or frequent flyer, is a traveler who often travels by air.", "People that make use of special frequent usage discounts when traveling on this vehicle are sometimes referred to as frequent flyers.", "Frequent flier miles are a form of loyalty program operated by many airlines.", "A frequent flyer program (FFP) is a loyalty program offered by an airline. Many airlines have frequent flyer programs designed to encourage airline customers enrolled in the program to accumulate miles and points which may then be redeemed for air travel or other rewards.", "A frequent-flyer program (FFP) is a loyalty program offered by an airline. Many airlines have frequent-flyer programs designed to encourage airline customers enrolled in the program to accumulate points (also called miles, kilometers, or segments) which may then be redeemed for air travel or other rewards.", "Frequent fliers are people who often fly on airplanes.", "A frequent flyer program (FFP) is a loyalty program offered by an airline.", "A frequent-flyer program (FFP) is a loyalty program offered by an airline.", "Passengers can earn frequent flyer miles on most flights, depending on the fare class paid.", "Frequent fliers are people who travel by air frequently.", "People that make use of special frequent usage discounts when traveling on this vehicle are sometimes referred to as frequent fliers.", "Flyers who travel frequently on the same airline or airline alliance can be rewarded with free or reduced-cost travel.", "A flyer is a form of paper advertisement intended for wide distribution and typically posted or distributed in a public place, handed out to individuals or sent through the mail. Flyers may be used by individuals, businesses, or organizations to:"]